stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
/***************************************************************************//**
 * @file  zap-cluster-command-parser.c
 * @brief This file contains a set of generated functions that parse the
 * incomming zcl command messages.
 * This file is generated. Do not update file manually.
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc. Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement. This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/

#ifdef SL_COMPONENT_CATALOG_PRESENT
#include "sl_component_catalog.h"
#endif

#if (defined(SL_CATALOG_ZIGBEE_ZCL_FRAMEWORK_CORE_PRESENT) || defined(SL_CATALOG_ZIGBEE_GREEN_POWER_ADAPTER_PRESENT))
#include <stdint.h>

#include "af.h"
#include "zap-type.h"
#include "zap-cluster-command-parser.h"
#include "sl_signature_decode.h"

// Generated interface function
static EmberAfStatus sli_do_decode(EmberAfClusterCommand *cmd,
                                   const sl_signature_t sig,
                                   uint8_t *outputBuffer) {
  sl_signature_decode_status_t ret;
  ret = sl_signature_decode(cmd->buffer, 
                            cmd->bufLen, 
                            cmd->payloadStartIndex, 
                            sig, 
                            outputBuffer);
  if ( ret == SL_SIGNATURE_DECODE_OK ) {
    return EMBER_ZCL_STATUS_SUCCESS;
  } else {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }
}


// Signature for GetZoneIdMapResponse command
static const sl_signature_t sig_ias_ace_cluster_get_zone_id_map_response_command = sl_zcl_ias_ace_cluster_get_zone_id_map_response_command_signature;
// Command parser for GetZoneIdMapResponse command
EmberAfStatus zcl_decode_ias_ace_cluster_get_zone_id_map_response_command (EmberAfClusterCommand * cmd, sl_zcl_ias_ace_cluster_get_zone_id_map_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_ias_ace_cluster_get_zone_id_map_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ZoneStatusChangeNotification command
static const sl_signature_t sig_ias_zone_cluster_zone_status_change_notification_command = sl_zcl_ias_zone_cluster_zone_status_change_notification_command_signature;
// Command parser for ZoneStatusChangeNotification command
EmberAfStatus zcl_decode_ias_zone_cluster_zone_status_change_notification_command (EmberAfClusterCommand * cmd, sl_zcl_ias_zone_cluster_zone_status_change_notification_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_ias_zone_cluster_zone_status_change_notification_command, (uint8_t*)cmd_struct);
} 


// Signature for InitiateKeyEstablishmentRequest command
static const sl_signature_t sig_key_establishment_cluster_initiate_key_establishment_request_command = sl_zcl_key_establishment_cluster_initiate_key_establishment_request_command_signature;
// Command parser for InitiateKeyEstablishmentRequest command
EmberAfStatus zcl_decode_key_establishment_cluster_initiate_key_establishment_request_command (EmberAfClusterCommand * cmd, sl_zcl_key_establishment_cluster_initiate_key_establishment_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_key_establishment_cluster_initiate_key_establishment_request_command, (uint8_t*)cmd_struct);
} 


// Signature for InitiateKeyEstablishmentResponse command
static const sl_signature_t sig_key_establishment_cluster_initiate_key_establishment_response_command = sl_zcl_key_establishment_cluster_initiate_key_establishment_response_command_signature;
// Command parser for InitiateKeyEstablishmentResponse command
EmberAfStatus zcl_decode_key_establishment_cluster_initiate_key_establishment_response_command (EmberAfClusterCommand * cmd, sl_zcl_key_establishment_cluster_initiate_key_establishment_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_key_establishment_cluster_initiate_key_establishment_response_command, (uint8_t*)cmd_struct);
} 


// Signature for TakeSnapshot command
static const sl_signature_t sig_simple_metering_cluster_take_snapshot_command = sl_zcl_simple_metering_cluster_take_snapshot_command_signature;
// Command parser for TakeSnapshot command
EmberAfStatus zcl_decode_simple_metering_cluster_take_snapshot_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_take_snapshot_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_take_snapshot_command, (uint8_t*)cmd_struct);
} 


// Signature for ActionControl command
static const sl_signature_t sig_gaming_cluster_action_control_command = sl_zcl_gaming_cluster_action_control_command_signature;
// Command parser for ActionControl command
EmberAfStatus zcl_decode_gaming_cluster_action_control_command (EmberAfClusterCommand * cmd, sl_zcl_gaming_cluster_action_control_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_gaming_cluster_action_control_command, (uint8_t*)cmd_struct);
} 


// Signature for EZModeInvoke command
static const sl_signature_t sig_identify_cluster_ez_mode_invoke_command = sl_zcl_identify_cluster_ez_mode_invoke_command_signature;
// Command parser for EZModeInvoke command
EmberAfStatus zcl_decode_identify_cluster_ez_mode_invoke_command (EmberAfClusterCommand * cmd, sl_zcl_identify_cluster_ez_mode_invoke_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_identify_cluster_ez_mode_invoke_command, (uint8_t*)cmd_struct);
} 


// Signature for RssiPing command
static const sl_signature_t sig_rssi_location_cluster_rssi_ping_command = sl_zcl_rssi_location_cluster_rssi_ping_command_signature;
// Command parser for RssiPing command
EmberAfStatus zcl_decode_rssi_location_cluster_rssi_ping_command (EmberAfClusterCommand * cmd, sl_zcl_rssi_location_cluster_rssi_ping_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_rssi_location_cluster_rssi_ping_command, (uint8_t*)cmd_struct);
} 


// Signature for Squawk command
static const sl_signature_t sig_ias_wd_cluster_squawk_command = sl_zcl_ias_wd_cluster_squawk_command_signature;
// Command parser for Squawk command
EmberAfStatus zcl_decode_ias_wd_cluster_squawk_command (EmberAfClusterCommand * cmd, sl_zcl_ias_wd_cluster_squawk_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_ias_wd_cluster_squawk_command, (uint8_t*)cmd_struct);
} 


// Signature for GetCurrentPrice command
static const sl_signature_t sig_price_cluster_get_current_price_command = sl_zcl_price_cluster_get_current_price_command_signature;
// Command parser for GetCurrentPrice command
EmberAfStatus zcl_decode_price_cluster_get_current_price_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_get_current_price_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_get_current_price_command, (uint8_t*)cmd_struct);
} 


