stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for CancelAllLoadControlEvents command
static const sl_signature_t sig_demand_response_and_load_control_cluster_cancel_all_load_control_events_command = sl_zcl_demand_response_and_load_control_cluster_cancel_all_load_control_events_command_signature;
// Command parser for CancelAllLoadControlEvents command
EmberAfStatus zcl_decode_demand_response_and_load_control_cluster_cancel_all_load_control_events_command (EmberAfClusterCommand * cmd, sl_zcl_demand_response_and_load_control_cluster_cancel_all_load_control_events_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_demand_response_and_load_control_cluster_cancel_all_load_control_events_command, (uint8_t*)cmd_struct);
} 


// Signature for ClearEventLogResponse command
static const sl_signature_t sig_events_cluster_clear_event_log_response_command = sl_zcl_events_cluster_clear_event_log_response_command_signature;
// Command parser for ClearEventLogResponse command
EmberAfStatus zcl_decode_events_cluster_clear_event_log_response_command (EmberAfClusterCommand * cmd, sl_zcl_events_cluster_clear_event_log_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_events_cluster_clear_event_log_response_command, (uint8_t*)cmd_struct);
} 


// Signature for GetAlertsResponse command
static const sl_signature_t sig_appliance_events_and_alert_cluster_get_alerts_response_command = sl_zcl_appliance_events_and_alert_cluster_get_alerts_response_command_signature;
// Command parser for GetAlertsResponse command
EmberAfStatus zcl_decode_appliance_events_and_alert_cluster_get_alerts_response_command (EmberAfClusterCommand * cmd, sl_zcl_appliance_events_and_alert_cluster_get_alerts_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_appliance_events_and_alert_cluster_get_alerts_response_command, (uint8_t*)cmd_struct);
} 


// Signature for AlertsNotification command
static const sl_signature_t sig_appliance_events_and_alert_cluster_alerts_notification_command = sl_zcl_appliance_events_and_alert_cluster_alerts_notification_command_signature;
// Command parser for AlertsNotification command
EmberAfStatus zcl_decode_appliance_events_and_alert_cluster_alerts_notification_command (EmberAfClusterCommand * cmd, sl_zcl_appliance_events_and_alert_cluster_alerts_notification_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_appliance_events_and_alert_cluster_alerts_notification_command, (uint8_t*)cmd_struct);
} 


// Signature for GetWeeklySchedule command
static const sl_signature_t sig_thermostat_cluster_get_weekly_schedule_command = sl_zcl_thermostat_cluster_get_weekly_schedule_command_signature;
// Command parser for GetWeeklySchedule command
EmberAfStatus zcl_decode_thermostat_cluster_get_weekly_schedule_command (EmberAfClusterCommand * cmd, sl_zcl_thermostat_cluster_get_weekly_schedule_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_thermostat_cluster_get_weekly_schedule_command, (uint8_t*)cmd_struct);
} 


// Signature for EstablishmentRequest command
static const sl_signature_t sig_voice_over_zig_bee_cluster_establishment_request_command = sl_zcl_voice_over_zig_bee_cluster_establishment_request_command_signature;
// Command parser for EstablishmentRequest command
EmberAfStatus zcl_decode_voice_over_zig_bee_cluster_establishment_request_command (EmberAfClusterCommand * cmd, sl_zcl_voice_over_zig_bee_cluster_establishment_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_voice_over_zig_bee_cluster_establishment_request_command, (uint8_t*)cmd_struct);
} 


// Signature for ColorLoopSet command
static const sl_signature_t sig_color_control_cluster_color_loop_set_command = sl_zcl_color_control_cluster_color_loop_set_command_signature;
// Command parser for ColorLoopSet command
EmberAfStatus zcl_decode_color_control_cluster_color_loop_set_command (EmberAfClusterCommand * cmd, sl_zcl_color_control_cluster_color_loop_set_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_color_control_cluster_color_loop_set_command, (uint8_t*)cmd_struct);
} 


// Signature for LocationDataNotification command
static const sl_signature_t sig_rssi_location_cluster_location_data_notification_command = sl_zcl_rssi_location_cluster_location_data_notification_command_signature;
// Command parser for LocationDataNotification command
EmberAfStatus zcl_decode_rssi_location_cluster_location_data_notification_command (EmberAfClusterCommand * cmd, sl_zcl_rssi_location_cluster_location_data_notification_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_rssi_location_cluster_location_data_notification_command, (uint8_t*)cmd_struct);
} 


// Signature for CompactLocationDataNotification command
static const sl_signature_t sig_rssi_location_cluster_compact_location_data_notification_command = sl_zcl_rssi_location_cluster_compact_location_data_notification_command_signature;
// Command parser for CompactLocationDataNotification command
EmberAfStatus zcl_decode_rssi_location_cluster_compact_location_data_notification_command (EmberAfClusterCommand * cmd, sl_zcl_rssi_location_cluster_compact_location_data_notification_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_rssi_location_cluster_compact_location_data_notification_command, (uint8_t*)cmd_struct);
} 


// Signature for OnWithTimedOff command
static const sl_signature_t sig_on_off_cluster_on_with_timed_off_command = sl_zcl_on_off_cluster_on_with_timed_off_command_signature;
// Command parser for OnWithTimedOff command
EmberAfStatus zcl_decode_on_off_cluster_on_with_timed_off_command (EmberAfClusterCommand * cmd, sl_zcl_on_off_cluster_on_with_timed_off_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_on_off_cluster_on_with_timed_off_command, (uint8_t*)cmd_struct);
} 


// Signature for GpSinkCommissioningMode command
static const sl_signature_t sig_green_power_cluster_gp_sink_commissioning_mode_command = sl_zcl_green_power_cluster_gp_sink_commissioning_mode_command_signature;
// Command parser for GpSinkCommissioningMode command
EmberAfStatus zcl_decode_green_power_cluster_gp_sink_commissioning_mode_command (EmberAfClusterCommand * cmd, sl_zcl_green_power_cluster_gp_sink_commissioning_mode_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_green_power_cluster_gp_sink_commissioning_mode_command, (uint8_t*)cmd_struct);
} 


// Signature for CopyScene command
static const sl_signature_t sig_scenes_cluster_copy_scene_command = sl_zcl_scenes_cluster_copy_scene_command_signature;
// Command parser for CopyScene command
EmberAfStatus zcl_decode_scenes_cluster_copy_scene_command (EmberAfClusterCommand * cmd, sl_zcl_scenes_cluster_copy_scene_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_scenes_cluster_copy_scene_command, (uint8_t*)cmd_struct);
} 


// Signature for StartWarning command
static const sl_signature_t sig_ias_wd_cluster_start_warning_command = sl_zcl_ias_wd_cluster_start_warning_command_signature;
// Command parser for StartWarning command
EmberAfStatus zcl_decode_ias_wd_cluster_start_warning_command (EmberAfClusterCommand * cmd, sl_zcl_ias_wd_cluster_start_warning_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_ias_wd_cluster_start_warning_command, (uint8_t*)cmd_struct);
} 


// Signature for GetEventLog command
static const sl_signature_t sig_events_cluster_get_event_log_command = sl_zcl_events_cluster_get_event_log_command_signature;
// Command parser for GetEventLog command
EmberAfStatus zcl_decode_events_cluster_get_event_log_command (EmberAfClusterCommand * cmd, sl_zcl_events_cluster_get_event_log_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_events_cluster_get_event_log_command, (uint8_t*)cmd_struct);
} 


