stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for Delete command
static const sl_signature_t sig_information_cluster_delete_command = sl_zcl_information_cluster_delete_command_signature;
// Command parser for Delete command
EmberAfStatus zcl_decode_information_cluster_delete_command (EmberAfClusterCommand * cmd, sl_zcl_information_cluster_delete_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_information_cluster_delete_command, (uint8_t*)cmd_struct);
} 


// Signature for ChangePaymentModeResponse command
static const sl_signature_t sig_prepayment_cluster_change_payment_mode_response_command = sl_zcl_prepayment_cluster_change_payment_mode_response_command_signature;
// Command parser for ChangePaymentModeResponse command
EmberAfStatus zcl_decode_prepayment_cluster_change_payment_mode_response_command (EmberAfClusterCommand * cmd, sl_zcl_prepayment_cluster_change_payment_mode_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_prepayment_cluster_change_payment_mode_response_command, (uint8_t*)cmd_struct);
} 


// Signature for SaveStartupParameters command
static const sl_signature_t sig_commissioning_cluster_save_startup_parameters_command = sl_zcl_commissioning_cluster_save_startup_parameters_command_signature;
// Command parser for SaveStartupParameters command
EmberAfStatus zcl_decode_commissioning_cluster_save_startup_parameters_command (EmberAfClusterCommand * cmd, sl_zcl_commissioning_cluster_save_startup_parameters_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_commissioning_cluster_save_startup_parameters_command, (uint8_t*)cmd_struct);
} 


// Signature for RestoreStartupParameters command
static const sl_signature_t sig_commissioning_cluster_restore_startup_parameters_command = sl_zcl_commissioning_cluster_restore_startup_parameters_command_signature;
// Command parser for RestoreStartupParameters command
EmberAfStatus zcl_decode_commissioning_cluster_restore_startup_parameters_command (EmberAfClusterCommand * cmd, sl_zcl_commissioning_cluster_restore_startup_parameters_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_commissioning_cluster_restore_startup_parameters_command, (uint8_t*)cmd_struct);
} 


// Signature for ResetStartupParameters command
static const sl_signature_t sig_commissioning_cluster_reset_startup_parameters_command = sl_zcl_commissioning_cluster_reset_startup_parameters_command_signature;
// Command parser for ResetStartupParameters command
EmberAfStatus zcl_decode_commissioning_cluster_reset_startup_parameters_command (EmberAfClusterCommand * cmd, sl_zcl_commissioning_cluster_reset_startup_parameters_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_commissioning_cluster_reset_startup_parameters_command, (uint8_t*)cmd_struct);
} 


// Signature for GetLocationData command
static const sl_signature_t sig_rssi_location_cluster_get_location_data_command = sl_zcl_rssi_location_cluster_get_location_data_command_signature;
// Command parser for GetLocationData command
EmberAfStatus zcl_decode_rssi_location_cluster_get_location_data_command (EmberAfClusterCommand * cmd, sl_zcl_rssi_location_cluster_get_location_data_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_rssi_location_cluster_get_location_data_command, (uint8_t*)cmd_struct);
} 


// Signature for GetPowerProfilePriceExtended command
static const sl_signature_t sig_power_profile_cluster_get_power_profile_price_extended_command = sl_zcl_power_profile_cluster_get_power_profile_price_extended_command_signature;
// Command parser for GetPowerProfilePriceExtended command
EmberAfStatus zcl_decode_power_profile_cluster_get_power_profile_price_extended_command (EmberAfClusterCommand * cmd, sl_zcl_power_profile_cluster_get_power_profile_price_extended_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_power_profile_cluster_get_power_profile_price_extended_command, (uint8_t*)cmd_struct);
} 


// Signature for RestartDevice command
static const sl_signature_t sig_commissioning_cluster_restart_device_command = sl_zcl_commissioning_cluster_restart_device_command_signature;
// Command parser for RestartDevice command
EmberAfStatus zcl_decode_commissioning_cluster_restart_device_command (EmberAfClusterCommand * cmd, sl_zcl_commissioning_cluster_restart_device_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_commissioning_cluster_restart_device_command, (uint8_t*)cmd_struct);
} 


// Signature for TransferPartitionedFrame command
static const sl_signature_t sig_partition_cluster_transfer_partitioned_frame_command = sl_zcl_partition_cluster_transfer_partitioned_frame_command_signature;
// Command parser for TransferPartitionedFrame command
EmberAfStatus zcl_decode_partition_cluster_transfer_partitioned_frame_command (EmberAfClusterCommand * cmd, sl_zcl_partition_cluster_transfer_partitioned_frame_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_partition_cluster_transfer_partitioned_frame_command, (uint8_t*)cmd_struct);
} 


// Signature for MultipleAck command
static const sl_signature_t sig_partition_cluster_multiple_ack_command = sl_zcl_partition_cluster_multiple_ack_command_signature;
// Command parser for MultipleAck command
EmberAfStatus zcl_decode_partition_cluster_multiple_ack_command (EmberAfClusterCommand * cmd, sl_zcl_partition_cluster_multiple_ack_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_partition_cluster_multiple_ack_command, (uint8_t*)cmd_struct);
} 


// Signature for WriteFileRequest command
static const sl_signature_t sig_data_sharing_cluster_write_file_request_command = sl_zcl_data_sharing_cluster_write_file_request_command_signature;
// Command parser for WriteFileRequest command
EmberAfStatus zcl_decode_data_sharing_cluster_write_file_request_command (EmberAfClusterCommand * cmd, sl_zcl_data_sharing_cluster_write_file_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_data_sharing_cluster_write_file_request_command, (uint8_t*)cmd_struct);
} 


