stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for FileTransmission command
static const sl_signature_t sig_data_sharing_cluster_file_transmission_command = sl_zcl_data_sharing_cluster_file_transmission_command_signature;
// Command parser for FileTransmission command
EmberAfStatus zcl_decode_data_sharing_cluster_file_transmission_command (EmberAfClusterCommand * cmd, sl_zcl_data_sharing_cluster_file_transmission_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_data_sharing_cluster_file_transmission_command, (uint8_t*)cmd_struct);
} 


// Signature for RecordTransmission command
static const sl_signature_t sig_data_sharing_cluster_record_transmission_command = sl_zcl_data_sharing_cluster_record_transmission_command_signature;
// Command parser for RecordTransmission command
EmberAfStatus zcl_decode_data_sharing_cluster_record_transmission_command (EmberAfClusterCommand * cmd, sl_zcl_data_sharing_cluster_record_transmission_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_data_sharing_cluster_record_transmission_command, (uint8_t*)cmd_struct);
} 


// Signature for SearchChatResponse command
static const sl_signature_t sig_chatting_cluster_search_chat_response_command = sl_zcl_chatting_cluster_search_chat_response_command_signature;
// Command parser for SearchChatResponse command
EmberAfStatus zcl_decode_chatting_cluster_search_chat_response_command (EmberAfClusterCommand * cmd, sl_zcl_chatting_cluster_search_chat_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_chatting_cluster_search_chat_response_command, (uint8_t*)cmd_struct);
} 


// Signature for Stop command
static const sl_signature_t sig_level_control_cluster_stop_command = sl_zcl_level_control_cluster_stop_command_signature;
// Command parser for Stop command
EmberAfStatus zcl_decode_level_control_cluster_stop_command (EmberAfClusterCommand * cmd, sl_zcl_level_control_cluster_stop_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_level_control_cluster_stop_command, (uint8_t*)cmd_struct);
} 


// Signature for StopMoveStep command
static const sl_signature_t sig_color_control_cluster_stop_move_step_command = sl_zcl_color_control_cluster_stop_move_step_command_signature;
// Command parser for StopMoveStep command
EmberAfStatus zcl_decode_color_control_cluster_stop_move_step_command (EmberAfClusterCommand * cmd, sl_zcl_color_control_cluster_stop_move_step_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_color_control_cluster_stop_move_step_command, (uint8_t*)cmd_struct);
} 


// Signature for ConfigureDeliveryEnable command
static const sl_signature_t sig_information_cluster_configure_delivery_enable_command = sl_zcl_information_cluster_configure_delivery_enable_command_signature;
// Command parser for ConfigureDeliveryEnable command
EmberAfStatus zcl_decode_information_cluster_configure_delivery_enable_command (EmberAfClusterCommand * cmd, sl_zcl_information_cluster_configure_delivery_enable_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_information_cluster_configure_delivery_enable_command, (uint8_t*)cmd_struct);
} 


// Signature for SurveyBeacons command
static const sl_signature_t sig_sl_works_with_all_hubs_cluster_survey_beacons_command = sl_zcl_sl_works_with_all_hubs_cluster_survey_beacons_command_signature;
// Command parser for SurveyBeacons command
EmberAfStatus zcl_decode_sl_works_with_all_hubs_cluster_survey_beacons_command (EmberAfClusterCommand * cmd, sl_zcl_sl_works_with_all_hubs_cluster_survey_beacons_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_sl_works_with_all_hubs_cluster_survey_beacons_command, (uint8_t*)cmd_struct);
} 


// Signature for CheckInResponse command
static const sl_signature_t sig_poll_control_cluster_check_in_response_command = sl_zcl_poll_control_cluster_check_in_response_command_signature;
// Command parser for CheckInResponse command
EmberAfStatus zcl_decode_poll_control_cluster_check_in_response_command (EmberAfClusterCommand * cmd, sl_zcl_poll_control_cluster_check_in_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_poll_control_cluster_check_in_response_command, (uint8_t*)cmd_struct);
} 


// Signature for GetZoneStatusResponse command
static const sl_signature_t sig_ias_ace_cluster_get_zone_status_response_command = sl_zcl_ias_ace_cluster_get_zone_status_response_command_signature;
// Command parser for GetZoneStatusResponse command
EmberAfStatus zcl_decode_ias_ace_cluster_get_zone_status_response_command (EmberAfClusterCommand * cmd, sl_zcl_ias_ace_cluster_get_zone_status_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_ias_ace_cluster_get_zone_status_response_command, (uint8_t*)cmd_struct);
} 


// Signature for SupportedTunnelProtocolsResponse command
static const sl_signature_t sig_tunneling_cluster_supported_tunnel_protocols_response_command = sl_zcl_tunneling_cluster_supported_tunnel_protocols_response_command_signature;
// Command parser for SupportedTunnelProtocolsResponse command
EmberAfStatus zcl_decode_tunneling_cluster_supported_tunnel_protocols_response_command (EmberAfClusterCommand * cmd, sl_zcl_tunneling_cluster_supported_tunnel_protocols_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_tunneling_cluster_supported_tunnel_protocols_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ConfigureNodeDescription command
static const sl_signature_t sig_information_cluster_configure_node_description_command = sl_zcl_information_cluster_configure_node_description_command_signature;
// Command parser for ConfigureNodeDescription command
EmberAfStatus zcl_decode_information_cluster_configure_node_description_command (EmberAfClusterCommand * cmd, sl_zcl_information_cluster_configure_node_description_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_information_cluster_configure_node_description_command, (uint8_t*)cmd_struct);
} 


