stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for StartChatRequest command
static const sl_signature_t sig_chatting_cluster_start_chat_request_command = sl_zcl_chatting_cluster_start_chat_request_command_signature;
// Command parser for StartChatRequest command
EmberAfStatus zcl_decode_chatting_cluster_start_chat_request_command (EmberAfClusterCommand * cmd, sl_zcl_chatting_cluster_start_chat_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_chatting_cluster_start_chat_request_command, (uint8_t*)cmd_struct);
} 


// Signature for LockDoor command
static const sl_signature_t sig_door_lock_cluster_lock_door_command = sl_zcl_door_lock_cluster_lock_door_command_signature;
// Command parser for LockDoor command
EmberAfStatus zcl_decode_door_lock_cluster_lock_door_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_lock_door_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_lock_door_command, (uint8_t*)cmd_struct);
} 


// Signature for UnlockDoor command
static const sl_signature_t sig_door_lock_cluster_unlock_door_command = sl_zcl_door_lock_cluster_unlock_door_command_signature;
// Command parser for UnlockDoor command
EmberAfStatus zcl_decode_door_lock_cluster_unlock_door_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_unlock_door_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_unlock_door_command, (uint8_t*)cmd_struct);
} 


// Signature for Toggle command
static const sl_signature_t sig_door_lock_cluster_toggle_command = sl_zcl_door_lock_cluster_toggle_command_signature;
// Command parser for Toggle command
EmberAfStatus zcl_decode_door_lock_cluster_toggle_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_toggle_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_toggle_command, (uint8_t*)cmd_struct);
} 


// Signature for ApsLinkKeyAuthorizationQuery command
static const sl_signature_t sig_sl_works_with_all_hubs_cluster_aps_link_key_authorization_query_command = sl_zcl_sl_works_with_all_hubs_cluster_aps_link_key_authorization_query_command_signature;
// Command parser for ApsLinkKeyAuthorizationQuery command
EmberAfStatus zcl_decode_sl_works_with_all_hubs_cluster_aps_link_key_authorization_query_command (EmberAfClusterCommand * cmd, sl_zcl_sl_works_with_all_hubs_cluster_aps_link_key_authorization_query_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_sl_works_with_all_hubs_cluster_aps_link_key_authorization_query_command, (uint8_t*)cmd_struct);
} 


// Signature for ReadHandshakeParam command
static const sl_signature_t sig_partition_cluster_read_handshake_param_command = sl_zcl_partition_cluster_read_handshake_param_command_signature;
// Command parser for ReadHandshakeParam command
EmberAfStatus zcl_decode_partition_cluster_read_handshake_param_command (EmberAfClusterCommand * cmd, sl_zcl_partition_cluster_read_handshake_param_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_partition_cluster_read_handshake_param_command, (uint8_t*)cmd_struct);
} 


// Signature for ApsLinkKeyAuthorizationQueryResponse command
static const sl_signature_t sig_sl_works_with_all_hubs_cluster_aps_link_key_authorization_query_response_command = sl_zcl_sl_works_with_all_hubs_cluster_aps_link_key_authorization_query_response_command_signature;
// Command parser for ApsLinkKeyAuthorizationQueryResponse command
EmberAfStatus zcl_decode_sl_works_with_all_hubs_cluster_aps_link_key_authorization_query_response_command (EmberAfClusterCommand * cmd, sl_zcl_sl_works_with_all_hubs_cluster_aps_link_key_authorization_query_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_sl_works_with_all_hubs_cluster_aps_link_key_authorization_query_response_command, (uint8_t*)cmd_struct);
} 


// Signature for WriteHandshakeParam command
static const sl_signature_t sig_partition_cluster_write_handshake_param_command = sl_zcl_partition_cluster_write_handshake_param_command_signature;
// Command parser for WriteHandshakeParam command
EmberAfStatus zcl_decode_partition_cluster_write_handshake_param_command (EmberAfClusterCommand * cmd, sl_zcl_partition_cluster_write_handshake_param_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_partition_cluster_write_handshake_param_command, (uint8_t*)cmd_struct);
} 


// Signature for ReadHandshakeParamResponse command
static const sl_signature_t sig_partition_cluster_read_handshake_param_response_command = sl_zcl_partition_cluster_read_handshake_param_response_command_signature;
// Command parser for ReadHandshakeParamResponse command
EmberAfStatus zcl_decode_partition_cluster_read_handshake_param_response_command (EmberAfClusterCommand * cmd, sl_zcl_partition_cluster_read_handshake_param_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_partition_cluster_read_handshake_param_response_command, (uint8_t*)cmd_struct);
} 


// Signature for PathDeletion command
static const sl_signature_t sig_data_rate_control_cluster_path_deletion_command = sl_zcl_data_rate_control_cluster_path_deletion_command_signature;
// Command parser for PathDeletion command
EmberAfStatus zcl_decode_data_rate_control_cluster_path_deletion_command (EmberAfClusterCommand * cmd, sl_zcl_data_rate_control_cluster_path_deletion_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_data_rate_control_cluster_path_deletion_command, (uint8_t*)cmd_struct);
} 


// Signature for PathCreation command
static const sl_signature_t sig_data_rate_control_cluster_path_creation_command = sl_zcl_data_rate_control_cluster_path_creation_command_signature;
// Command parser for PathCreation command
EmberAfStatus zcl_decode_data_rate_control_cluster_path_creation_command (EmberAfClusterCommand * cmd, sl_zcl_data_rate_control_cluster_path_creation_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_data_rate_control_cluster_path_creation_command, (uint8_t*)cmd_struct);
} 


