stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for DataRateNotification command
static const sl_signature_t sig_data_rate_control_cluster_data_rate_notification_command = sl_zcl_data_rate_control_cluster_data_rate_notification_command_signature;
// Command parser for DataRateNotification command
EmberAfStatus zcl_decode_data_rate_control_cluster_data_rate_notification_command (EmberAfClusterCommand * cmd, sl_zcl_data_rate_control_cluster_data_rate_notification_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_data_rate_control_cluster_data_rate_notification_command, (uint8_t*)cmd_struct);
} 


// Signature for DataRateControl command
static const sl_signature_t sig_data_rate_control_cluster_data_rate_control_command = sl_zcl_data_rate_control_cluster_data_rate_control_command_signature;
// Command parser for DataRateControl command
EmberAfStatus zcl_decode_data_rate_control_cluster_data_rate_control_command (EmberAfClusterCommand * cmd, sl_zcl_data_rate_control_cluster_data_rate_control_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_data_rate_control_cluster_data_rate_control_command, (uint8_t*)cmd_struct);
} 


// Signature for TransferNpdu command
static const sl_signature_t sig_ba_cnet_protocol_tunnel_cluster_transfer_npdu_command = sl_zcl_ba_cnet_protocol_tunnel_cluster_transfer_npdu_command_signature;
// Command parser for TransferNpdu command
EmberAfStatus zcl_decode_ba_cnet_protocol_tunnel_cluster_transfer_npdu_command (EmberAfClusterCommand * cmd, sl_zcl_ba_cnet_protocol_tunnel_cluster_transfer_npdu_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_ba_cnet_protocol_tunnel_cluster_transfer_npdu_command, (uint8_t*)cmd_struct);
} 


// Signature for ZoneEnrollRequest command
static const sl_signature_t sig_ias_zone_cluster_zone_enroll_request_command = sl_zcl_ias_zone_cluster_zone_enroll_request_command_signature;
// Command parser for ZoneEnrollRequest command
EmberAfStatus zcl_decode_ias_zone_cluster_zone_enroll_request_command (EmberAfClusterCommand * cmd, sl_zcl_ias_zone_cluster_zone_enroll_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_ias_zone_cluster_zone_enroll_request_command, (uint8_t*)cmd_struct);
} 


// Signature for RestartDeviceResponse command
static const sl_signature_t sig_commissioning_cluster_restart_device_response_command = sl_zcl_commissioning_cluster_restart_device_response_command_signature;
// Command parser for RestartDeviceResponse command
EmberAfStatus zcl_decode_commissioning_cluster_restart_device_response_command (EmberAfClusterCommand * cmd, sl_zcl_commissioning_cluster_restart_device_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_commissioning_cluster_restart_device_response_command, (uint8_t*)cmd_struct);
} 


// Signature for SaveStartupParametersResponse command
static const sl_signature_t sig_commissioning_cluster_save_startup_parameters_response_command = sl_zcl_commissioning_cluster_save_startup_parameters_response_command_signature;
// Command parser for SaveStartupParametersResponse command
EmberAfStatus zcl_decode_commissioning_cluster_save_startup_parameters_response_command (EmberAfClusterCommand * cmd, sl_zcl_commissioning_cluster_save_startup_parameters_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_commissioning_cluster_save_startup_parameters_response_command, (uint8_t*)cmd_struct);
} 


// Signature for RestoreStartupParametersResponse command
static const sl_signature_t sig_commissioning_cluster_restore_startup_parameters_response_command = sl_zcl_commissioning_cluster_restore_startup_parameters_response_command_signature;
// Command parser for RestoreStartupParametersResponse command
EmberAfStatus zcl_decode_commissioning_cluster_restore_startup_parameters_response_command (EmberAfClusterCommand * cmd, sl_zcl_commissioning_cluster_restore_startup_parameters_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_commissioning_cluster_restore_startup_parameters_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ResetStartupParametersResponse command
static const sl_signature_t sig_commissioning_cluster_reset_startup_parameters_response_command = sl_zcl_commissioning_cluster_reset_startup_parameters_response_command_signature;
// Command parser for ResetStartupParametersResponse command
EmberAfStatus zcl_decode_commissioning_cluster_reset_startup_parameters_response_command (EmberAfClusterCommand * cmd, sl_zcl_commissioning_cluster_reset_startup_parameters_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_commissioning_cluster_reset_startup_parameters_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ExecutionOfACommand command
static const sl_signature_t sig_appliance_control_cluster_execution_of_a_command_command = sl_zcl_appliance_control_cluster_execution_of_a_command_command_signature;
// Command parser for ExecutionOfACommand command
EmberAfStatus zcl_decode_appliance_control_cluster_execution_of_a_command_command (EmberAfClusterCommand * cmd, sl_zcl_appliance_control_cluster_execution_of_a_command_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_appliance_control_cluster_execution_of_a_command_command, (uint8_t*)cmd_struct);
} 


// Signature for OverloadWarning command
static const sl_signature_t sig_appliance_control_cluster_overload_warning_command = sl_zcl_appliance_control_cluster_overload_warning_command_signature;
// Command parser for OverloadWarning command
EmberAfStatus zcl_decode_appliance_control_cluster_overload_warning_command (EmberAfClusterCommand * cmd, sl_zcl_appliance_control_cluster_overload_warning_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_appliance_control_cluster_overload_warning_command, (uint8_t*)cmd_struct);
} 


