stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for SetPinResponse command
static const sl_signature_t sig_door_lock_cluster_set_pin_response_command = sl_zcl_door_lock_cluster_set_pin_response_command_signature;
// Command parser for SetPinResponse command
EmberAfStatus zcl_decode_door_lock_cluster_set_pin_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_set_pin_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_set_pin_response_command, (uint8_t*)cmd_struct);
} 


// Signature for SetRfidResponse command
static const sl_signature_t sig_door_lock_cluster_set_rfid_response_command = sl_zcl_door_lock_cluster_set_rfid_response_command_signature;
// Command parser for SetRfidResponse command
EmberAfStatus zcl_decode_door_lock_cluster_set_rfid_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_set_rfid_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_set_rfid_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ArmResponse command
static const sl_signature_t sig_ias_ace_cluster_arm_response_command = sl_zcl_ias_ace_cluster_arm_response_command_signature;
// Command parser for ArmResponse command
EmberAfStatus zcl_decode_ias_ace_cluster_arm_response_command (EmberAfClusterCommand * cmd, sl_zcl_ias_ace_cluster_arm_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_ias_ace_cluster_arm_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ConnectStatusNotification command
static const sl_signature_t sig_11073_protocol_tunnel_cluster_connect_status_notification_command = sl_zcl_11073_protocol_tunnel_cluster_connect_status_notification_command_signature;
// Command parser for ConnectStatusNotification command
EmberAfStatus zcl_decode_11073_protocol_tunnel_cluster_connect_status_notification_command (EmberAfClusterCommand * cmd, sl_zcl_11073_protocol_tunnel_cluster_connect_status_notification_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_11073_protocol_tunnel_cluster_connect_status_notification_command, (uint8_t*)cmd_struct);
} 


// Signature for LocalChangeSupply command
static const sl_signature_t sig_simple_metering_cluster_local_change_supply_command = sl_zcl_simple_metering_cluster_local_change_supply_command_signature;
// Command parser for LocalChangeSupply command
EmberAfStatus zcl_decode_simple_metering_cluster_local_change_supply_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_local_change_supply_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_local_change_supply_command, (uint8_t*)cmd_struct);
} 


// Signature for RequestNewPassword command
static const sl_signature_t sig_device_management_cluster_request_new_password_command = sl_zcl_device_management_cluster_request_new_password_command_signature;
// Command parser for RequestNewPassword command
EmberAfStatus zcl_decode_device_management_cluster_request_new_password_command (EmberAfClusterCommand * cmd, sl_zcl_device_management_cluster_request_new_password_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_device_management_cluster_request_new_password_command, (uint8_t*)cmd_struct);
} 


// Signature for ClearEventLogRequest command
static const sl_signature_t sig_events_cluster_clear_event_log_request_command = sl_zcl_events_cluster_clear_event_log_request_command_signature;
// Command parser for ClearEventLogRequest command
EmberAfStatus zcl_decode_events_cluster_clear_event_log_request_command (EmberAfClusterCommand * cmd, sl_zcl_events_cluster_clear_event_log_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_events_cluster_clear_event_log_request_command, (uint8_t*)cmd_struct);
} 


// Signature for ControlResponse command
static const sl_signature_t sig_voice_over_zig_bee_cluster_control_response_command = sl_zcl_voice_over_zig_bee_cluster_control_response_command_signature;
// Command parser for ControlResponse command
EmberAfStatus zcl_decode_voice_over_zig_bee_cluster_control_response_command (EmberAfClusterCommand * cmd, sl_zcl_voice_over_zig_bee_cluster_control_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_voice_over_zig_bee_cluster_control_response_command, (uint8_t*)cmd_struct);
} 


// Signature for Control command
static const sl_signature_t sig_voice_over_zig_bee_cluster_control_command = sl_zcl_voice_over_zig_bee_cluster_control_command_signature;
// Command parser for Control command
EmberAfStatus zcl_decode_voice_over_zig_bee_cluster_control_command (EmberAfClusterCommand * cmd, sl_zcl_voice_over_zig_bee_cluster_control_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_voice_over_zig_bee_cluster_control_command, (uint8_t*)cmd_struct);
} 


// Signature for SetIasZoneEnrollmentMethod command
static const sl_signature_t sig_sl_works_with_all_hubs_cluster_set_ias_zone_enrollment_method_command = sl_zcl_sl_works_with_all_hubs_cluster_set_ias_zone_enrollment_method_command_signature;
// Command parser for SetIasZoneEnrollmentMethod command
EmberAfStatus zcl_decode_sl_works_with_all_hubs_cluster_set_ias_zone_enrollment_method_command (EmberAfClusterCommand * cmd, sl_zcl_sl_works_with_all_hubs_cluster_set_ias_zone_enrollment_method_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_sl_works_with_all_hubs_cluster_set_ias_zone_enrollment_method_command, (uint8_t*)cmd_struct);
} 


// Signature for UpdateCommissionState command
static const sl_signature_t sig_identify_cluster_update_commission_state_command = sl_zcl_identify_cluster_update_commission_state_command_signature;
// Command parser for UpdateCommissionState command
EmberAfStatus zcl_decode_identify_cluster_update_commission_state_command (EmberAfClusterCommand * cmd, sl_zcl_identify_cluster_update_commission_state_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_identify_cluster_update_commission_state_command, (uint8_t*)cmd_struct);
} 


// Signature for SetWeeklySchedule command
static const sl_signature_t sig_thermostat_cluster_set_weekly_schedule_command = sl_zcl_thermostat_cluster_set_weekly_schedule_command_signature;
// Command parser for SetWeeklySchedule command
EmberAfStatus zcl_decode_thermostat_cluster_set_weekly_schedule_command (EmberAfClusterCommand * cmd, sl_zcl_thermostat_cluster_set_weekly_schedule_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_thermostat_cluster_set_weekly_schedule_command, (uint8_t*)cmd_struct);
} 


// Signature for CurrentWeeklySchedule command
static const sl_signature_t sig_thermostat_cluster_current_weekly_schedule_command = sl_zcl_thermostat_cluster_current_weekly_schedule_command_signature;
// Command parser for CurrentWeeklySchedule command
EmberAfStatus zcl_decode_thermostat_cluster_current_weekly_schedule_command (EmberAfClusterCommand * cmd, sl_zcl_thermostat_cluster_current_weekly_schedule_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_thermostat_cluster_current_weekly_schedule_command, (uint8_t*)cmd_struct);
} 


