stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for LocationDataResponse command
static const sl_signature_t sig_rssi_location_cluster_location_data_response_command = sl_zcl_rssi_location_cluster_location_data_response_command_signature;
// Command parser for LocationDataResponse command
EmberAfStatus zcl_decode_rssi_location_cluster_location_data_response_command (EmberAfClusterCommand * cmd, sl_zcl_rssi_location_cluster_location_data_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_rssi_location_cluster_location_data_response_command, (uint8_t*)cmd_struct);
} 


// Signature for SignalStateResponse command
static const sl_signature_t sig_appliance_control_cluster_signal_state_response_command = sl_zcl_appliance_control_cluster_signal_state_response_command_signature;
// Command parser for SignalStateResponse command
EmberAfStatus zcl_decode_appliance_control_cluster_signal_state_response_command (EmberAfClusterCommand * cmd, sl_zcl_appliance_control_cluster_signal_state_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_appliance_control_cluster_signal_state_response_command, (uint8_t*)cmd_struct);
} 


// Signature for SignalStateNotification command
static const sl_signature_t sig_appliance_control_cluster_signal_state_notification_command = sl_zcl_appliance_control_cluster_signal_state_notification_command_signature;
// Command parser for SignalStateNotification command
EmberAfStatus zcl_decode_appliance_control_cluster_signal_state_notification_command (EmberAfClusterCommand * cmd, sl_zcl_appliance_control_cluster_signal_state_notification_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_appliance_control_cluster_signal_state_notification_command, (uint8_t*)cmd_struct);
} 


// Signature for RequestInformation command
static const sl_signature_t sig_information_cluster_request_information_command = sl_zcl_information_cluster_request_information_command_signature;
// Command parser for RequestInformation command
EmberAfStatus zcl_decode_information_cluster_request_information_command (EmberAfClusterCommand * cmd, sl_zcl_information_cluster_request_information_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_information_cluster_request_information_command, (uint8_t*)cmd_struct);
} 


// Signature for Update command
static const sl_signature_t sig_information_cluster_update_command = sl_zcl_information_cluster_update_command_signature;
// Command parser for Update command
EmberAfStatus zcl_decode_information_cluster_update_command (EmberAfClusterCommand * cmd, sl_zcl_information_cluster_update_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_information_cluster_update_command, (uint8_t*)cmd_struct);
} 


// Signature for Arm command
static const sl_signature_t sig_ias_ace_cluster_arm_command = sl_zcl_ias_ace_cluster_arm_command_signature;
// Command parser for Arm command
EmberAfStatus zcl_decode_ias_ace_cluster_arm_command (EmberAfClusterCommand * cmd, sl_zcl_ias_ace_cluster_arm_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_ias_ace_cluster_arm_command, (uint8_t*)cmd_struct);
} 


// Signature for ResetAlarm command
static const sl_signature_t sig_alarms_cluster_reset_alarm_command = sl_zcl_alarms_cluster_reset_alarm_command_signature;
// Command parser for ResetAlarm command
EmberAfStatus zcl_decode_alarms_cluster_reset_alarm_command (EmberAfClusterCommand * cmd, sl_zcl_alarms_cluster_reset_alarm_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_alarms_cluster_reset_alarm_command, (uint8_t*)cmd_struct);
} 


// Signature for Alarm command
static const sl_signature_t sig_alarms_cluster_alarm_command = sl_zcl_alarms_cluster_alarm_command_signature;
// Command parser for Alarm command
EmberAfStatus zcl_decode_alarms_cluster_alarm_command (EmberAfClusterCommand * cmd, sl_zcl_alarms_cluster_alarm_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_alarms_cluster_alarm_command, (uint8_t*)cmd_struct);
} 


// Signature for TriggerEffect command
static const sl_signature_t sig_identify_cluster_trigger_effect_command = sl_zcl_identify_cluster_trigger_effect_command_signature;
// Command parser for TriggerEffect command
EmberAfStatus zcl_decode_identify_cluster_trigger_effect_command (EmberAfClusterCommand * cmd, sl_zcl_identify_cluster_trigger_effect_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_identify_cluster_trigger_effect_command, (uint8_t*)cmd_struct);
} 


// Signature for OffWithEffect command
static const sl_signature_t sig_on_off_cluster_off_with_effect_command = sl_zcl_on_off_cluster_off_with_effect_command_signature;
// Command parser for OffWithEffect command
EmberAfStatus zcl_decode_on_off_cluster_off_with_effect_command (EmberAfClusterCommand * cmd, sl_zcl_on_off_cluster_off_with_effect_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_on_off_cluster_off_with_effect_command, (uint8_t*)cmd_struct);
} 


// Signature for EstablishmentResponse command
static const sl_signature_t sig_voice_over_zig_bee_cluster_establishment_response_command = sl_zcl_voice_over_zig_bee_cluster_establishment_response_command_signature;
// Command parser for EstablishmentResponse command
EmberAfStatus zcl_decode_voice_over_zig_bee_cluster_establishment_response_command (EmberAfClusterCommand * cmd, sl_zcl_voice_over_zig_bee_cluster_establishment_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_voice_over_zig_bee_cluster_establishment_response_command, (uint8_t*)cmd_struct);
} 


// Signature for GetAlarmResponse command
static const sl_signature_t sig_alarms_cluster_get_alarm_response_command = sl_zcl_alarms_cluster_get_alarm_response_command_signature;
// Command parser for GetAlarmResponse command
EmberAfStatus zcl_decode_alarms_cluster_get_alarm_response_command (EmberAfClusterCommand * cmd, sl_zcl_alarms_cluster_get_alarm_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_alarms_cluster_get_alarm_response_command, (uint8_t*)cmd_struct);
} 


// Signature for DeviceConfigurationResponse command
static const sl_signature_t sig_rssi_location_cluster_device_configuration_response_command = sl_zcl_rssi_location_cluster_device_configuration_response_command_signature;
// Command parser for DeviceConfigurationResponse command
EmberAfStatus zcl_decode_rssi_location_cluster_device_configuration_response_command (EmberAfClusterCommand * cmd, sl_zcl_rssi_location_cluster_device_configuration_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_rssi_location_cluster_device_configuration_response_command, (uint8_t*)cmd_struct);
} 


// Signature for AddGroupResponse command
static const sl_signature_t sig_groups_cluster_add_group_response_command = sl_zcl_groups_cluster_add_group_response_command_signature;
// Command parser for AddGroupResponse command
EmberAfStatus zcl_decode_groups_cluster_add_group_response_command (EmberAfClusterCommand * cmd, sl_zcl_groups_cluster_add_group_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_groups_cluster_add_group_response_command, (uint8_t*)cmd_struct);
} 


// Signature for RemoveGroupResponse command
static const sl_signature_t sig_groups_cluster_remove_group_response_command = sl_zcl_groups_cluster_remove_group_response_command_signature;
// Command parser for RemoveGroupResponse command
EmberAfStatus zcl_decode_groups_cluster_remove_group_response_command (EmberAfClusterCommand * cmd, sl_zcl_groups_cluster_remove_group_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_groups_cluster_remove_group_response_command, (uint8_t*)cmd_struct);
} 


// Signature for RemoveAllScenesResponse command
static const sl_signature_t sig_scenes_cluster_remove_all_scenes_response_command = sl_zcl_scenes_cluster_remove_all_scenes_response_command_signature;
// Command parser for RemoveAllScenesResponse command
EmberAfStatus zcl_decode_scenes_cluster_remove_all_scenes_response_command (EmberAfClusterCommand * cmd, sl_zcl_scenes_cluster_remove_all_scenes_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_scenes_cluster_remove_all_scenes_response_command, (uint8_t*)cmd_struct);
} 


// Signature for EnhancedMoveHue command
static const sl_signature_t sig_color_control_cluster_enhanced_move_hue_command = sl_zcl_color_control_cluster_enhanced_move_hue_command_signature;
// Command parser for EnhancedMoveHue command
EmberAfStatus zcl_decode_color_control_cluster_enhanced_move_hue_command (EmberAfClusterCommand * cmd, sl_zcl_color_control_cluster_enhanced_move_hue_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_color_control_cluster_enhanced_move_hue_command, (uint8_t*)cmd_struct);
} 


