stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for SearchGame command
static const sl_signature_t sig_gaming_cluster_search_game_command = sl_zcl_gaming_cluster_search_game_command_signature;
// Command parser for SearchGame command
EmberAfStatus zcl_decode_gaming_cluster_search_game_command (EmberAfClusterCommand * cmd, sl_zcl_gaming_cluster_search_game_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_gaming_cluster_search_game_command, (uint8_t*)cmd_struct);
} 


// Signature for StartChatResponse command
static const sl_signature_t sig_chatting_cluster_start_chat_response_command = sl_zcl_chatting_cluster_start_chat_response_command_signature;
// Command parser for StartChatResponse command
EmberAfStatus zcl_decode_chatting_cluster_start_chat_response_command (EmberAfClusterCommand * cmd, sl_zcl_chatting_cluster_start_chat_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_chatting_cluster_start_chat_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ViewGroupResponse command
static const sl_signature_t sig_groups_cluster_view_group_response_command = sl_zcl_groups_cluster_view_group_response_command_signature;
// Command parser for ViewGroupResponse command
EmberAfStatus zcl_decode_groups_cluster_view_group_response_command (EmberAfClusterCommand * cmd, sl_zcl_groups_cluster_view_group_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_groups_cluster_view_group_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ConnectRequest command
static const sl_signature_t sig_11073_protocol_tunnel_cluster_connect_request_command = sl_zcl_11073_protocol_tunnel_cluster_connect_request_command_signature;
// Command parser for ConnectRequest command
EmberAfStatus zcl_decode_11073_protocol_tunnel_cluster_connect_request_command (EmberAfClusterCommand * cmd, sl_zcl_11073_protocol_tunnel_cluster_connect_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_11073_protocol_tunnel_cluster_connect_request_command, (uint8_t*)cmd_struct);
} 


// Signature for EnhancedStepHue command
static const sl_signature_t sig_color_control_cluster_enhanced_step_hue_command = sl_zcl_color_control_cluster_enhanced_step_hue_command_signature;
// Command parser for EnhancedStepHue command
EmberAfStatus zcl_decode_color_control_cluster_enhanced_step_hue_command (EmberAfClusterCommand * cmd, sl_zcl_color_control_cluster_enhanced_step_hue_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_color_control_cluster_enhanced_step_hue_command, (uint8_t*)cmd_struct);
} 


// Signature for MoveColorTemperature command
static const sl_signature_t sig_color_control_cluster_move_color_temperature_command = sl_zcl_color_control_cluster_move_color_temperature_command_signature;
// Command parser for MoveColorTemperature command
EmberAfStatus zcl_decode_color_control_cluster_move_color_temperature_command (EmberAfClusterCommand * cmd, sl_zcl_color_control_cluster_move_color_temperature_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_color_control_cluster_move_color_temperature_command, (uint8_t*)cmd_struct);
} 


// Signature for StepColorTemperature command
static const sl_signature_t sig_color_control_cluster_step_color_temperature_command = sl_zcl_color_control_cluster_step_color_temperature_command_signature;
// Command parser for StepColorTemperature command
EmberAfStatus zcl_decode_color_control_cluster_step_color_temperature_command (EmberAfClusterCommand * cmd, sl_zcl_color_control_cluster_step_color_temperature_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_color_control_cluster_step_color_temperature_command, (uint8_t*)cmd_struct);
} 


// Signature for UpgradeEndRequest command
static const sl_signature_t sig_over_the_air_bootloading_cluster_upgrade_end_request_command = sl_zcl_over_the_air_bootloading_cluster_upgrade_end_request_command_signature;
// Command parser for UpgradeEndRequest command
EmberAfStatus zcl_decode_over_the_air_bootloading_cluster_upgrade_end_request_command (EmberAfClusterCommand * cmd, sl_zcl_over_the_air_bootloading_cluster_upgrade_end_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_over_the_air_bootloading_cluster_upgrade_end_request_command, (uint8_t*)cmd_struct);
} 


// Signature for QueryNextImageResponse command
static const sl_signature_t sig_over_the_air_bootloading_cluster_query_next_image_response_command = sl_zcl_over_the_air_bootloading_cluster_query_next_image_response_command_signature;
// Command parser for QueryNextImageResponse command
EmberAfStatus zcl_decode_over_the_air_bootloading_cluster_query_next_image_response_command (EmberAfClusterCommand * cmd, sl_zcl_over_the_air_bootloading_cluster_query_next_image_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_over_the_air_bootloading_cluster_query_next_image_response_command, (uint8_t*)cmd_struct);
} 


// Signature for QuerySpecificFileResponse command
static const sl_signature_t sig_over_the_air_bootloading_cluster_query_specific_file_response_command = sl_zcl_over_the_air_bootloading_cluster_query_specific_file_response_command_signature;
// Command parser for QuerySpecificFileResponse command
EmberAfStatus zcl_decode_over_the_air_bootloading_cluster_query_specific_file_response_command (EmberAfClusterCommand * cmd, sl_zcl_over_the_air_bootloading_cluster_query_specific_file_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_over_the_air_bootloading_cluster_query_specific_file_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ImageBlockResponse command
static const sl_signature_t sig_over_the_air_bootloading_cluster_image_block_response_command = sl_zcl_over_the_air_bootloading_cluster_image_block_response_command_signature;
// Command parser for ImageBlockResponse command
EmberAfStatus zcl_decode_over_the_air_bootloading_cluster_image_block_response_command (EmberAfClusterCommand * cmd, sl_zcl_over_the_air_bootloading_cluster_image_block_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_over_the_air_bootloading_cluster_image_block_response_command, (uint8_t*)cmd_struct);
} 


// Signature for GetNodeInformationResponse command
static const sl_signature_t sig_chatting_cluster_get_node_information_response_command = sl_zcl_chatting_cluster_get_node_information_response_command_signature;
// Command parser for GetNodeInformationResponse command
EmberAfStatus zcl_decode_chatting_cluster_get_node_information_response_command (EmberAfClusterCommand * cmd, sl_zcl_chatting_cluster_get_node_information_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_chatting_cluster_get_node_information_response_command, (uint8_t*)cmd_struct);
} 


// Signature for AddSceneResponse command
static const sl_signature_t sig_scenes_cluster_add_scene_response_command = sl_zcl_scenes_cluster_add_scene_response_command_signature;
// Command parser for AddSceneResponse command
EmberAfStatus zcl_decode_scenes_cluster_add_scene_response_command (EmberAfClusterCommand * cmd, sl_zcl_scenes_cluster_add_scene_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_scenes_cluster_add_scene_response_command, (uint8_t*)cmd_struct);
} 


// Signature for RemoveSceneResponse command
static const sl_signature_t sig_scenes_cluster_remove_scene_response_command = sl_zcl_scenes_cluster_remove_scene_response_command_signature;
// Command parser for RemoveSceneResponse command
EmberAfStatus zcl_decode_scenes_cluster_remove_scene_response_command (EmberAfClusterCommand * cmd, sl_zcl_scenes_cluster_remove_scene_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_scenes_cluster_remove_scene_response_command, (uint8_t*)cmd_struct);
} 


