stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for StoreSceneResponse command
static const sl_signature_t sig_scenes_cluster_store_scene_response_command = sl_zcl_scenes_cluster_store_scene_response_command_signature;
// Command parser for StoreSceneResponse command
EmberAfStatus zcl_decode_scenes_cluster_store_scene_response_command (EmberAfClusterCommand * cmd, sl_zcl_scenes_cluster_store_scene_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_scenes_cluster_store_scene_response_command, (uint8_t*)cmd_struct);
} 


// Signature for EnhancedAddSceneResponse command
static const sl_signature_t sig_scenes_cluster_enhanced_add_scene_response_command = sl_zcl_scenes_cluster_enhanced_add_scene_response_command_signature;
// Command parser for EnhancedAddSceneResponse command
EmberAfStatus zcl_decode_scenes_cluster_enhanced_add_scene_response_command (EmberAfClusterCommand * cmd, sl_zcl_scenes_cluster_enhanced_add_scene_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_scenes_cluster_enhanced_add_scene_response_command, (uint8_t*)cmd_struct);
} 


// Signature for CopySceneResponse command
static const sl_signature_t sig_scenes_cluster_copy_scene_response_command = sl_zcl_scenes_cluster_copy_scene_response_command_signature;
// Command parser for CopySceneResponse command
EmberAfStatus zcl_decode_scenes_cluster_copy_scene_response_command (EmberAfClusterCommand * cmd, sl_zcl_scenes_cluster_copy_scene_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_scenes_cluster_copy_scene_response_command, (uint8_t*)cmd_struct);
} 


// Signature for EnhancedViewSceneResponse command
static const sl_signature_t sig_scenes_cluster_enhanced_view_scene_response_command = sl_zcl_scenes_cluster_enhanced_view_scene_response_command_signature;
// Command parser for EnhancedViewSceneResponse command
EmberAfStatus zcl_decode_scenes_cluster_enhanced_view_scene_response_command (EmberAfClusterCommand * cmd, sl_zcl_scenes_cluster_enhanced_view_scene_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_scenes_cluster_enhanced_view_scene_response_command, (uint8_t*)cmd_struct);
} 


// Signature for RequestPreferenceResponse command
static const sl_signature_t sig_information_cluster_request_preference_response_command = sl_zcl_information_cluster_request_preference_response_command_signature;
// Command parser for RequestPreferenceResponse command
EmberAfStatus zcl_decode_information_cluster_request_preference_response_command (EmberAfClusterCommand * cmd, sl_zcl_information_cluster_request_preference_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_information_cluster_request_preference_response_command, (uint8_t*)cmd_struct);
} 


// Signature for JoinChatResponse command
static const sl_signature_t sig_chatting_cluster_join_chat_response_command = sl_zcl_chatting_cluster_join_chat_response_command_signature;
// Command parser for JoinChatResponse command
EmberAfStatus zcl_decode_chatting_cluster_join_chat_response_command (EmberAfClusterCommand * cmd, sl_zcl_chatting_cluster_join_chat_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_chatting_cluster_join_chat_response_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishEvent command
static const sl_signature_t sig_events_cluster_publish_event_command = sl_zcl_events_cluster_publish_event_command_signature;
// Command parser for PublishEvent command
EmberAfStatus zcl_decode_events_cluster_publish_event_command (EmberAfClusterCommand * cmd, sl_zcl_events_cluster_publish_event_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_events_cluster_publish_event_command, (uint8_t*)cmd_struct);
} 


// Signature for ConsumerTopUpResponse command
static const sl_signature_t sig_prepayment_cluster_consumer_top_up_response_command = sl_zcl_prepayment_cluster_consumer_top_up_response_command_signature;
// Command parser for ConsumerTopUpResponse command
EmberAfStatus zcl_decode_prepayment_cluster_consumer_top_up_response_command (EmberAfClusterCommand * cmd, sl_zcl_prepayment_cluster_consumer_top_up_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_prepayment_cluster_consumer_top_up_response_command, (uint8_t*)cmd_struct);
} 


// Signature for SetpointRaiseLower command
static const sl_signature_t sig_thermostat_cluster_setpoint_raise_lower_command = sl_zcl_thermostat_cluster_setpoint_raise_lower_command_signature;
// Command parser for SetpointRaiseLower command
EmberAfStatus zcl_decode_thermostat_cluster_setpoint_raise_lower_command (EmberAfClusterCommand * cmd, sl_zcl_thermostat_cluster_setpoint_raise_lower_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_thermostat_cluster_setpoint_raise_lower_command, (uint8_t*)cmd_struct);
} 


// Signature for MoveWithOnOff command
static const sl_signature_t sig_level_control_cluster_move_with_on_off_command = sl_zcl_level_control_cluster_move_with_on_off_command_signature;
// Command parser for MoveWithOnOff command
EmberAfStatus zcl_decode_level_control_cluster_move_with_on_off_command (EmberAfClusterCommand * cmd, sl_zcl_level_control_cluster_move_with_on_off_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_level_control_cluster_move_with_on_off_command, (uint8_t*)cmd_struct);
} 


// Signature for ZoneEnrollResponse command
static const sl_signature_t sig_ias_zone_cluster_zone_enroll_response_command = sl_zcl_ias_zone_cluster_zone_enroll_response_command_signature;
// Command parser for ZoneEnrollResponse command
EmberAfStatus zcl_decode_ias_zone_cluster_zone_enroll_response_command (EmberAfClusterCommand * cmd, sl_zcl_ias_zone_cluster_zone_enroll_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_ias_zone_cluster_zone_enroll_response_command, (uint8_t*)cmd_struct);
} 


// Signature for TerminateKeyEstablishment command
static const sl_signature_t sig_key_establishment_cluster_terminate_key_establishment_command = sl_zcl_key_establishment_cluster_terminate_key_establishment_command_signature;
// Command parser for TerminateKeyEstablishment command
EmberAfStatus zcl_decode_key_establishment_cluster_terminate_key_establishment_command (EmberAfClusterCommand * cmd, sl_zcl_key_establishment_cluster_terminate_key_establishment_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_key_establishment_cluster_terminate_key_establishment_command, (uint8_t*)cmd_struct);
} 


// Signature for Move command
static const sl_signature_t sig_level_control_cluster_move_command = sl_zcl_level_control_cluster_move_command_signature;
// Command parser for Move command
EmberAfStatus zcl_decode_level_control_cluster_move_command (EmberAfClusterCommand * cmd, sl_zcl_level_control_cluster_move_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_level_control_cluster_move_command, (uint8_t*)cmd_struct);
} 


// Signature for MoveHue command
static const sl_signature_t sig_color_control_cluster_move_hue_command = sl_zcl_color_control_cluster_move_hue_command_signature;
// Command parser for MoveHue command
EmberAfStatus zcl_decode_color_control_cluster_move_hue_command (EmberAfClusterCommand * cmd, sl_zcl_color_control_cluster_move_hue_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_color_control_cluster_move_hue_command, (uint8_t*)cmd_struct);
} 


// Signature for MoveSaturation command
static const sl_signature_t sig_color_control_cluster_move_saturation_command = sl_zcl_color_control_cluster_move_saturation_command_signature;
// Command parser for MoveSaturation command
EmberAfStatus zcl_decode_color_control_cluster_move_saturation_command (EmberAfClusterCommand * cmd, sl_zcl_color_control_cluster_move_saturation_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_color_control_cluster_move_saturation_command, (uint8_t*)cmd_struct);
} 


