stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for GetPanelStatusResponse command
static const sl_signature_t sig_ias_ace_cluster_get_panel_status_response_command = sl_zcl_ias_ace_cluster_get_panel_status_response_command_signature;
// Command parser for GetPanelStatusResponse command
EmberAfStatus zcl_decode_ias_ace_cluster_get_panel_status_response_command (EmberAfClusterCommand * cmd, sl_zcl_ias_ace_cluster_get_panel_status_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_ias_ace_cluster_get_panel_status_response_command, (uint8_t*)cmd_struct);
} 


// Signature for PanelStatusChanged command
static const sl_signature_t sig_ias_ace_cluster_panel_status_changed_command = sl_zcl_ias_ace_cluster_panel_status_changed_command_signature;
// Command parser for PanelStatusChanged command
EmberAfStatus zcl_decode_ias_ace_cluster_panel_status_changed_command (EmberAfClusterCommand * cmd, sl_zcl_ias_ace_cluster_panel_status_changed_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_ias_ace_cluster_panel_status_changed_command, (uint8_t*)cmd_struct);
} 


// Signature for StepWithOnOff command
static const sl_signature_t sig_level_control_cluster_step_with_on_off_command = sl_zcl_level_control_cluster_step_with_on_off_command_signature;
// Command parser for StepWithOnOff command
EmberAfStatus zcl_decode_level_control_cluster_step_with_on_off_command (EmberAfClusterCommand * cmd, sl_zcl_level_control_cluster_step_with_on_off_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_level_control_cluster_step_with_on_off_command, (uint8_t*)cmd_struct);
} 


// Signature for Step command
static const sl_signature_t sig_level_control_cluster_step_command = sl_zcl_level_control_cluster_step_command_signature;
// Command parser for Step command
EmberAfStatus zcl_decode_level_control_cluster_step_command (EmberAfClusterCommand * cmd, sl_zcl_level_control_cluster_step_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_level_control_cluster_step_command, (uint8_t*)cmd_struct);
} 


// Signature for ImageNotify command
static const sl_signature_t sig_over_the_air_bootloading_cluster_image_notify_command = sl_zcl_over_the_air_bootloading_cluster_image_notify_command_signature;
// Command parser for ImageNotify command
EmberAfStatus zcl_decode_over_the_air_bootloading_cluster_image_notify_command (EmberAfClusterCommand * cmd, sl_zcl_over_the_air_bootloading_cluster_image_notify_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_over_the_air_bootloading_cluster_image_notify_command, (uint8_t*)cmd_struct);
} 


// Signature for StepHue command
static const sl_signature_t sig_color_control_cluster_step_hue_command = sl_zcl_color_control_cluster_step_hue_command_signature;
// Command parser for StepHue command
EmberAfStatus zcl_decode_color_control_cluster_step_hue_command (EmberAfClusterCommand * cmd, sl_zcl_color_control_cluster_step_hue_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_color_control_cluster_step_hue_command, (uint8_t*)cmd_struct);
} 


// Signature for StepSaturation command
static const sl_signature_t sig_color_control_cluster_step_saturation_command = sl_zcl_color_control_cluster_step_saturation_command_signature;
// Command parser for StepSaturation command
EmberAfStatus zcl_decode_color_control_cluster_step_saturation_command (EmberAfClusterCommand * cmd, sl_zcl_color_control_cluster_step_saturation_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_color_control_cluster_step_saturation_command, (uint8_t*)cmd_struct);
} 


// Signature for GpProxyTableResponse command
static const sl_signature_t sig_green_power_cluster_gp_proxy_table_response_command = sl_zcl_green_power_cluster_gp_proxy_table_response_command_signature;
// Command parser for GpProxyTableResponse command
EmberAfStatus zcl_decode_green_power_cluster_gp_proxy_table_response_command (EmberAfClusterCommand * cmd, sl_zcl_green_power_cluster_gp_proxy_table_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_green_power_cluster_gp_proxy_table_response_command, (uint8_t*)cmd_struct);
} 


// Signature for GpSinkTableResponse command
static const sl_signature_t sig_green_power_cluster_gp_sink_table_response_command = sl_zcl_green_power_cluster_gp_sink_table_response_command_signature;
// Command parser for GpSinkTableResponse command
EmberAfStatus zcl_decode_green_power_cluster_gp_sink_table_response_command (EmberAfClusterCommand * cmd, sl_zcl_green_power_cluster_gp_sink_table_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_green_power_cluster_gp_sink_table_response_command, (uint8_t*)cmd_struct);
} 


// Signature for WriteFileResponse command
static const sl_signature_t sig_data_sharing_cluster_write_file_response_command = sl_zcl_data_sharing_cluster_write_file_response_command_signature;
// Command parser for WriteFileResponse command
EmberAfStatus zcl_decode_data_sharing_cluster_write_file_response_command (EmberAfClusterCommand * cmd, sl_zcl_data_sharing_cluster_write_file_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_data_sharing_cluster_write_file_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ConsumerTopUp command
static const sl_signature_t sig_prepayment_cluster_consumer_top_up_command = sl_zcl_prepayment_cluster_consumer_top_up_command_signature;
// Command parser for ConsumerTopUp command
EmberAfStatus zcl_decode_prepayment_cluster_consumer_top_up_command (EmberAfClusterCommand * cmd, sl_zcl_prepayment_cluster_consumer_top_up_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_prepayment_cluster_consumer_top_up_command, (uint8_t*)cmd_struct);
} 


// Signature for GetProfile command
static const sl_signature_t sig_simple_metering_cluster_get_profile_command = sl_zcl_simple_metering_cluster_get_profile_command_signature;
// Command parser for GetProfile command
EmberAfStatus zcl_decode_simple_metering_cluster_get_profile_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_get_profile_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_get_profile_command, (uint8_t*)cmd_struct);
} 


// Signature for GpTranslationTableResponse command
static const sl_signature_t sig_green_power_cluster_gp_translation_table_response_command = sl_zcl_green_power_cluster_gp_translation_table_response_command_signature;
// Command parser for GpTranslationTableResponse command
EmberAfStatus zcl_decode_green_power_cluster_gp_translation_table_response_command (EmberAfClusterCommand * cmd, sl_zcl_green_power_cluster_gp_translation_table_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_green_power_cluster_gp_translation_table_response_command, (uint8_t*)cmd_struct);
} 


// Signature for SendPreferenceResponse command
static const sl_signature_t sig_information_cluster_send_preference_response_command = sl_zcl_information_cluster_send_preference_response_command_signature;
// Command parser for SendPreferenceResponse command
EmberAfStatus zcl_decode_information_cluster_send_preference_response_command (EmberAfClusterCommand * cmd, sl_zcl_information_cluster_send_preference_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_information_cluster_send_preference_response_command, (uint8_t*)cmd_struct);
} 


