stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for RequestPreferenceConfirmation command
static const sl_signature_t sig_information_cluster_request_preference_confirmation_command = sl_zcl_information_cluster_request_preference_confirmation_command_signature;
// Command parser for RequestPreferenceConfirmation command
EmberAfStatus zcl_decode_information_cluster_request_preference_confirmation_command (EmberAfClusterCommand * cmd, sl_zcl_information_cluster_request_preference_confirmation_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_information_cluster_request_preference_confirmation_command, (uint8_t*)cmd_struct);
} 


// Signature for GetDeviceConfiguration command
static const sl_signature_t sig_rssi_location_cluster_get_device_configuration_command = sl_zcl_rssi_location_cluster_get_device_configuration_command_signature;
// Command parser for GetDeviceConfiguration command
EmberAfStatus zcl_decode_rssi_location_cluster_get_device_configuration_command (EmberAfClusterCommand * cmd, sl_zcl_rssi_location_cluster_get_device_configuration_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_rssi_location_cluster_get_device_configuration_command, (uint8_t*)cmd_struct);
} 


// Signature for RequestOwnLocation command
static const sl_signature_t sig_rssi_location_cluster_request_own_location_command = sl_zcl_rssi_location_cluster_request_own_location_command_signature;
// Command parser for RequestOwnLocation command
EmberAfStatus zcl_decode_rssi_location_cluster_request_own_location_command (EmberAfClusterCommand * cmd, sl_zcl_rssi_location_cluster_request_own_location_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_rssi_location_cluster_request_own_location_command, (uint8_t*)cmd_struct);
} 


// Signature for DisconnectRequest command
static const sl_signature_t sig_11073_protocol_tunnel_cluster_disconnect_request_command = sl_zcl_11073_protocol_tunnel_cluster_disconnect_request_command_signature;
// Command parser for DisconnectRequest command
EmberAfStatus zcl_decode_11073_protocol_tunnel_cluster_disconnect_request_command (EmberAfClusterCommand * cmd, sl_zcl_11073_protocol_tunnel_cluster_disconnect_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_11073_protocol_tunnel_cluster_disconnect_request_command, (uint8_t*)cmd_struct);
} 


// Signature for AnchorNodeAnnounce command
static const sl_signature_t sig_rssi_location_cluster_anchor_node_announce_command = sl_zcl_rssi_location_cluster_anchor_node_announce_command_signature;
// Command parser for AnchorNodeAnnounce command
EmberAfStatus zcl_decode_rssi_location_cluster_anchor_node_announce_command (EmberAfClusterCommand * cmd, sl_zcl_rssi_location_cluster_anchor_node_announce_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_rssi_location_cluster_anchor_node_announce_command, (uint8_t*)cmd_struct);
} 


// Signature for RssiResponse command
static const sl_signature_t sig_rssi_location_cluster_rssi_response_command = sl_zcl_rssi_location_cluster_rssi_response_command_signature;
// Command parser for RssiResponse command
EmberAfStatus zcl_decode_rssi_location_cluster_rssi_response_command (EmberAfClusterCommand * cmd, sl_zcl_rssi_location_cluster_rssi_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_rssi_location_cluster_rssi_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ShortAddressChange command
static const sl_signature_t sig_sl_works_with_all_hubs_cluster_short_address_change_command = sl_zcl_sl_works_with_all_hubs_cluster_short_address_change_command_signature;
// Command parser for ShortAddressChange command
EmberAfStatus zcl_decode_sl_works_with_all_hubs_cluster_short_address_change_command (EmberAfClusterCommand * cmd, sl_zcl_sl_works_with_all_hubs_cluster_short_address_change_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_sl_works_with_all_hubs_cluster_short_address_change_command, (uint8_t*)cmd_struct);
} 


// Signature for QuerySpecificFileRequest command
static const sl_signature_t sig_over_the_air_bootloading_cluster_query_specific_file_request_command = sl_zcl_over_the_air_bootloading_cluster_query_specific_file_request_command_signature;
// Command parser for QuerySpecificFileRequest command
EmberAfStatus zcl_decode_over_the_air_bootloading_cluster_query_specific_file_request_command (EmberAfClusterCommand * cmd, sl_zcl_over_the_air_bootloading_cluster_query_specific_file_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_over_the_air_bootloading_cluster_query_specific_file_request_command, (uint8_t*)cmd_struct);
} 


// Signature for EndpointInformation command
static const sl_signature_t sig_zll_commissioning_cluster_endpoint_information_command = sl_zcl_zll_commissioning_cluster_endpoint_information_command_signature;
// Command parser for EndpointInformation command
EmberAfStatus zcl_decode_zll_commissioning_cluster_endpoint_information_command (EmberAfClusterCommand * cmd, sl_zcl_zll_commissioning_cluster_endpoint_information_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_zll_commissioning_cluster_endpoint_information_command, (uint8_t*)cmd_struct);
} 


// Signature for SendPings command
static const sl_signature_t sig_rssi_location_cluster_send_pings_command = sl_zcl_rssi_location_cluster_send_pings_command_signature;
// Command parser for SendPings command
EmberAfStatus zcl_decode_rssi_location_cluster_send_pings_command (EmberAfClusterCommand * cmd, sl_zcl_rssi_location_cluster_send_pings_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_rssi_location_cluster_send_pings_command, (uint8_t*)cmd_struct);
} 


// Signature for ReportRssiMeasurements command
static const sl_signature_t sig_rssi_location_cluster_report_rssi_measurements_command = sl_zcl_rssi_location_cluster_report_rssi_measurements_command_signature;
// Command parser for ReportRssiMeasurements command
EmberAfStatus zcl_decode_rssi_location_cluster_report_rssi_measurements_command (EmberAfClusterCommand * cmd, sl_zcl_rssi_location_cluster_report_rssi_measurements_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_rssi_location_cluster_report_rssi_measurements_command, (uint8_t*)cmd_struct);
} 


