stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for MatchProtocolAddressResponse command
static const sl_signature_t sig_generic_tunnel_cluster_match_protocol_address_response_command = sl_zcl_generic_tunnel_cluster_match_protocol_address_response_command_signature;
// Command parser for MatchProtocolAddressResponse command
EmberAfStatus zcl_decode_generic_tunnel_cluster_match_protocol_address_response_command (EmberAfClusterCommand * cmd, sl_zcl_generic_tunnel_cluster_match_protocol_address_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_generic_tunnel_cluster_match_protocol_address_response_command, (uint8_t*)cmd_struct);
} 


// Signature for MoveColor command
static const sl_signature_t sig_color_control_cluster_move_color_command = sl_zcl_color_control_cluster_move_color_command_signature;
// Command parser for MoveColor command
EmberAfStatus zcl_decode_color_control_cluster_move_color_command (EmberAfClusterCommand * cmd, sl_zcl_color_control_cluster_move_color_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_color_control_cluster_move_color_command, (uint8_t*)cmd_struct);
} 


// Signature for SetAbsoluteLocation command
static const sl_signature_t sig_rssi_location_cluster_set_absolute_location_command = sl_zcl_rssi_location_cluster_set_absolute_location_command_signature;
// Command parser for SetAbsoluteLocation command
EmberAfStatus zcl_decode_rssi_location_cluster_set_absolute_location_command (EmberAfClusterCommand * cmd, sl_zcl_rssi_location_cluster_set_absolute_location_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_rssi_location_cluster_set_absolute_location_command, (uint8_t*)cmd_struct);
} 


// Signature for StepColor command
static const sl_signature_t sig_color_control_cluster_step_color_command = sl_zcl_color_control_cluster_step_color_command_signature;
// Command parser for StepColor command
EmberAfStatus zcl_decode_color_control_cluster_step_color_command (EmberAfClusterCommand * cmd, sl_zcl_color_control_cluster_step_color_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_color_control_cluster_step_color_command, (uint8_t*)cmd_struct);
} 


// Signature for SetDeviceConfiguration command
static const sl_signature_t sig_rssi_location_cluster_set_device_configuration_command = sl_zcl_rssi_location_cluster_set_device_configuration_command_signature;
// Command parser for SetDeviceConfiguration command
EmberAfStatus zcl_decode_rssi_location_cluster_set_device_configuration_command (EmberAfClusterCommand * cmd, sl_zcl_rssi_location_cluster_set_device_configuration_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_rssi_location_cluster_set_device_configuration_command, (uint8_t*)cmd_struct);
} 


// Signature for Identify command
static const sl_signature_t sig_identify_cluster_identify_command = sl_zcl_identify_cluster_identify_command_signature;
// Command parser for Identify command
EmberAfStatus zcl_decode_identify_cluster_identify_command (EmberAfClusterCommand * cmd, sl_zcl_identify_cluster_identify_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_identify_cluster_identify_command, (uint8_t*)cmd_struct);
} 


// Signature for IdentifyQueryResponse command
static const sl_signature_t sig_identify_cluster_identify_query_response_command = sl_zcl_identify_cluster_identify_query_response_command_signature;
// Command parser for IdentifyQueryResponse command
EmberAfStatus zcl_decode_identify_cluster_identify_query_response_command (EmberAfClusterCommand * cmd, sl_zcl_identify_cluster_identify_query_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_identify_cluster_identify_query_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ViewGroup command
static const sl_signature_t sig_groups_cluster_view_group_command = sl_zcl_groups_cluster_view_group_command_signature;
// Command parser for ViewGroup command
EmberAfStatus zcl_decode_groups_cluster_view_group_command (EmberAfClusterCommand * cmd, sl_zcl_groups_cluster_view_group_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_groups_cluster_view_group_command, (uint8_t*)cmd_struct);
} 


// Signature for RemoveGroup command
static const sl_signature_t sig_groups_cluster_remove_group_command = sl_zcl_groups_cluster_remove_group_command_signature;
// Command parser for RemoveGroup command
EmberAfStatus zcl_decode_groups_cluster_remove_group_command (EmberAfClusterCommand * cmd, sl_zcl_groups_cluster_remove_group_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_groups_cluster_remove_group_command, (uint8_t*)cmd_struct);
} 


// Signature for RemoveAllScenes command
static const sl_signature_t sig_scenes_cluster_remove_all_scenes_command = sl_zcl_scenes_cluster_remove_all_scenes_command_signature;
// Command parser for RemoveAllScenes command
EmberAfStatus zcl_decode_scenes_cluster_remove_all_scenes_command (EmberAfClusterCommand * cmd, sl_zcl_scenes_cluster_remove_all_scenes_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_scenes_cluster_remove_all_scenes_command, (uint8_t*)cmd_struct);
} 


// Signature for GetSceneMembership command
static const sl_signature_t sig_scenes_cluster_get_scene_membership_command = sl_zcl_scenes_cluster_get_scene_membership_command_signature;
// Command parser for GetSceneMembership command
EmberAfStatus zcl_decode_scenes_cluster_get_scene_membership_command (EmberAfClusterCommand * cmd, sl_zcl_scenes_cluster_get_scene_membership_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_scenes_cluster_get_scene_membership_command, (uint8_t*)cmd_struct);
} 


