stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for SetShortPollInterval command
static const sl_signature_t sig_poll_control_cluster_set_short_poll_interval_command = sl_zcl_poll_control_cluster_set_short_poll_interval_command_signature;
// Command parser for SetShortPollInterval command
EmberAfStatus zcl_decode_poll_control_cluster_set_short_poll_interval_command (EmberAfClusterCommand * cmd, sl_zcl_poll_control_cluster_set_short_poll_interval_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_poll_control_cluster_set_short_poll_interval_command, (uint8_t*)cmd_struct);
} 


// Signature for GetLogRecord command
static const sl_signature_t sig_door_lock_cluster_get_log_record_command = sl_zcl_door_lock_cluster_get_log_record_command_signature;
// Command parser for GetLogRecord command
EmberAfStatus zcl_decode_door_lock_cluster_get_log_record_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_get_log_record_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_get_log_record_command, (uint8_t*)cmd_struct);
} 


// Signature for GetPin command
static const sl_signature_t sig_door_lock_cluster_get_pin_command = sl_zcl_door_lock_cluster_get_pin_command_signature;
// Command parser for GetPin command
EmberAfStatus zcl_decode_door_lock_cluster_get_pin_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_get_pin_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_get_pin_command, (uint8_t*)cmd_struct);
} 


// Signature for ClearPin command
static const sl_signature_t sig_door_lock_cluster_clear_pin_command = sl_zcl_door_lock_cluster_clear_pin_command_signature;
// Command parser for ClearPin command
EmberAfStatus zcl_decode_door_lock_cluster_clear_pin_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_clear_pin_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_clear_pin_command, (uint8_t*)cmd_struct);
} 


// Signature for GetUserStatus command
static const sl_signature_t sig_door_lock_cluster_get_user_status_command = sl_zcl_door_lock_cluster_get_user_status_command_signature;
// Command parser for GetUserStatus command
EmberAfStatus zcl_decode_door_lock_cluster_get_user_status_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_get_user_status_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_get_user_status_command, (uint8_t*)cmd_struct);
} 


// Signature for GetUserType command
static const sl_signature_t sig_door_lock_cluster_get_user_type_command = sl_zcl_door_lock_cluster_get_user_type_command_signature;
// Command parser for GetUserType command
EmberAfStatus zcl_decode_door_lock_cluster_get_user_type_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_get_user_type_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_get_user_type_command, (uint8_t*)cmd_struct);
} 


// Signature for GetRfid command
static const sl_signature_t sig_door_lock_cluster_get_rfid_command = sl_zcl_door_lock_cluster_get_rfid_command_signature;
// Command parser for GetRfid command
EmberAfStatus zcl_decode_door_lock_cluster_get_rfid_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_get_rfid_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_get_rfid_command, (uint8_t*)cmd_struct);
} 


// Signature for ClearRfid command
static const sl_signature_t sig_door_lock_cluster_clear_rfid_command = sl_zcl_door_lock_cluster_clear_rfid_command_signature;
// Command parser for ClearRfid command
EmberAfStatus zcl_decode_door_lock_cluster_clear_rfid_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_clear_rfid_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_clear_rfid_command, (uint8_t*)cmd_struct);
} 


// Signature for WindowCoveringGoToLiftValue command
static const sl_signature_t sig_window_covering_cluster_window_covering_go_to_lift_value_command = sl_zcl_window_covering_cluster_window_covering_go_to_lift_value_command_signature;
// Command parser for WindowCoveringGoToLiftValue command
EmberAfStatus zcl_decode_window_covering_cluster_window_covering_go_to_lift_value_command (EmberAfClusterCommand * cmd, sl_zcl_window_covering_cluster_window_covering_go_to_lift_value_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_window_covering_cluster_window_covering_go_to_lift_value_command, (uint8_t*)cmd_struct);
} 


// Signature for WindowCoveringGoToTiltValue command
static const sl_signature_t sig_window_covering_cluster_window_covering_go_to_tilt_value_command = sl_zcl_window_covering_cluster_window_covering_go_to_tilt_value_command_signature;
// Command parser for WindowCoveringGoToTiltValue command
EmberAfStatus zcl_decode_window_covering_cluster_window_covering_go_to_tilt_value_command (EmberAfClusterCommand * cmd, sl_zcl_window_covering_cluster_window_covering_go_to_tilt_value_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_window_covering_cluster_window_covering_go_to_tilt_value_command, (uint8_t*)cmd_struct);
} 


// Signature for RequestMirrorResponse command
static const sl_signature_t sig_simple_metering_cluster_request_mirror_response_command = sl_zcl_simple_metering_cluster_request_mirror_response_command_signature;
// Command parser for RequestMirrorResponse command
EmberAfStatus zcl_decode_simple_metering_cluster_request_mirror_response_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_request_mirror_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_request_mirror_response_command, (uint8_t*)cmd_struct);
} 


// Signature for MirrorRemoved command
static const sl_signature_t sig_simple_metering_cluster_mirror_removed_command = sl_zcl_simple_metering_cluster_mirror_removed_command_signature;
// Command parser for MirrorRemoved command
EmberAfStatus zcl_decode_simple_metering_cluster_mirror_removed_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_mirror_removed_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_mirror_removed_command, (uint8_t*)cmd_struct);
} 


// Signature for StartSamplingResponse command
static const sl_signature_t sig_simple_metering_cluster_start_sampling_response_command = sl_zcl_simple_metering_cluster_start_sampling_response_command_signature;
// Command parser for StartSamplingResponse command
EmberAfStatus zcl_decode_simple_metering_cluster_start_sampling_response_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_start_sampling_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_start_sampling_response_command, (uint8_t*)cmd_struct);
} 


// Signature for CloseTunnel command
static const sl_signature_t sig_tunneling_cluster_close_tunnel_command = sl_zcl_tunneling_cluster_close_tunnel_command_signature;
// Command parser for CloseTunnel command
EmberAfStatus zcl_decode_tunneling_cluster_close_tunnel_command (EmberAfClusterCommand * cmd, sl_zcl_tunneling_cluster_close_tunnel_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_tunneling_cluster_close_tunnel_command, (uint8_t*)cmd_struct);
} 


// Signature for TunnelClosureNotification command
static const sl_signature_t sig_tunneling_cluster_tunnel_closure_notification_command = sl_zcl_tunneling_cluster_tunnel_closure_notification_command_signature;
// Command parser for TunnelClosureNotification command
EmberAfStatus zcl_decode_tunneling_cluster_tunnel_closure_notification_command (EmberAfClusterCommand * cmd, sl_zcl_tunneling_cluster_tunnel_closure_notification_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_tunneling_cluster_tunnel_closure_notification_command, (uint8_t*)cmd_struct);
} 


// Signature for GetEventConfiguration command
static const sl_signature_t sig_device_management_cluster_get_event_configuration_command = sl_zcl_device_management_cluster_get_event_configuration_command_signature;
// Command parser for GetEventConfiguration command
EmberAfStatus zcl_decode_device_management_cluster_get_event_configuration_command (EmberAfClusterCommand * cmd, sl_zcl_device_management_cluster_get_event_configuration_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_device_management_cluster_get_event_configuration_command, (uint8_t*)cmd_struct);
} 


