stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for ConfigureSetRootId command
static const sl_signature_t sig_information_cluster_configure_set_root_id_command = sl_zcl_information_cluster_configure_set_root_id_command_signature;
// Command parser for ConfigureSetRootId command
EmberAfStatus zcl_decode_information_cluster_configure_set_root_id_command (EmberAfClusterCommand * cmd, sl_zcl_information_cluster_configure_set_root_id_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_information_cluster_configure_set_root_id_command, (uint8_t*)cmd_struct);
} 


// Signature for SwitchChairmanRequest command
static const sl_signature_t sig_chatting_cluster_switch_chairman_request_command = sl_zcl_chatting_cluster_switch_chairman_request_command_signature;
// Command parser for SwitchChairmanRequest command
EmberAfStatus zcl_decode_chatting_cluster_switch_chairman_request_command (EmberAfClusterCommand * cmd, sl_zcl_chatting_cluster_switch_chairman_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_chatting_cluster_switch_chairman_request_command, (uint8_t*)cmd_struct);
} 


// Signature for ReadTokens command
static const sl_signature_t sig_configuration_cluster_cluster_read_tokens_command = sl_zcl_configuration_cluster_cluster_read_tokens_command_signature;
// Command parser for ReadTokens command
EmberAfStatus zcl_decode_configuration_cluster_cluster_read_tokens_command (EmberAfClusterCommand * cmd, sl_zcl_configuration_cluster_cluster_read_tokens_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_configuration_cluster_cluster_read_tokens_command, (uint8_t*)cmd_struct);
} 


// Signature for EnablePeriodicRouterCheckIns command
static const sl_signature_t sig_sl_works_with_all_hubs_cluster_enable_periodic_router_check_ins_command = sl_zcl_sl_works_with_all_hubs_cluster_enable_periodic_router_check_ins_command_signature;
// Command parser for EnablePeriodicRouterCheckIns command
EmberAfStatus zcl_decode_sl_works_with_all_hubs_cluster_enable_periodic_router_check_ins_command (EmberAfClusterCommand * cmd, sl_zcl_sl_works_with_all_hubs_cluster_enable_periodic_router_check_ins_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_sl_works_with_all_hubs_cluster_enable_periodic_router_check_ins_command, (uint8_t*)cmd_struct);
} 


// Signature for RelayStatusLog command
static const sl_signature_t sig_thermostat_cluster_relay_status_log_command = sl_zcl_thermostat_cluster_relay_status_log_command_signature;
// Command parser for RelayStatusLog command
EmberAfStatus zcl_decode_thermostat_cluster_relay_status_log_command (EmberAfClusterCommand * cmd, sl_zcl_thermostat_cluster_relay_status_log_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_thermostat_cluster_relay_status_log_command, (uint8_t*)cmd_struct);
} 


// Signature for JoinGame command
static const sl_signature_t sig_gaming_cluster_join_game_command = sl_zcl_gaming_cluster_join_game_command_signature;
// Command parser for JoinGame command
EmberAfStatus zcl_decode_gaming_cluster_join_game_command (EmberAfClusterCommand * cmd, sl_zcl_gaming_cluster_join_game_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_gaming_cluster_join_game_command, (uint8_t*)cmd_struct);
} 


// Signature for GameAnnouncement command
static const sl_signature_t sig_gaming_cluster_game_announcement_command = sl_zcl_gaming_cluster_game_announcement_command_signature;
// Command parser for GameAnnouncement command
EmberAfStatus zcl_decode_gaming_cluster_game_announcement_command (EmberAfClusterCommand * cmd, sl_zcl_gaming_cluster_game_announcement_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_gaming_cluster_game_announcement_command, (uint8_t*)cmd_struct);
} 


// Signature for AddGroup command
static const sl_signature_t sig_groups_cluster_add_group_command = sl_zcl_groups_cluster_add_group_command_signature;
// Command parser for AddGroup command
EmberAfStatus zcl_decode_groups_cluster_add_group_command (EmberAfClusterCommand * cmd, sl_zcl_groups_cluster_add_group_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_groups_cluster_add_group_command, (uint8_t*)cmd_struct);
} 


// Signature for AddGroupIfIdentifying command
static const sl_signature_t sig_groups_cluster_add_group_if_identifying_command = sl_zcl_groups_cluster_add_group_if_identifying_command_signature;
// Command parser for AddGroupIfIdentifying command
EmberAfStatus zcl_decode_groups_cluster_add_group_if_identifying_command (EmberAfClusterCommand * cmd, sl_zcl_groups_cluster_add_group_if_identifying_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_groups_cluster_add_group_if_identifying_command, (uint8_t*)cmd_struct);
} 


// Signature for JoinChatRequest command
static const sl_signature_t sig_chatting_cluster_join_chat_request_command = sl_zcl_chatting_cluster_join_chat_request_command_signature;
// Command parser for JoinChatRequest command
EmberAfStatus zcl_decode_chatting_cluster_join_chat_request_command (EmberAfClusterCommand * cmd, sl_zcl_chatting_cluster_join_chat_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_chatting_cluster_join_chat_request_command, (uint8_t*)cmd_struct);
} 


// Signature for UnlockWithTimeout command
static const sl_signature_t sig_door_lock_cluster_unlock_with_timeout_command = sl_zcl_door_lock_cluster_unlock_with_timeout_command_signature;
// Command parser for UnlockWithTimeout command
EmberAfStatus zcl_decode_door_lock_cluster_unlock_with_timeout_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_unlock_with_timeout_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_unlock_with_timeout_command, (uint8_t*)cmd_struct);
} 


// Signature for SetUserType command
static const sl_signature_t sig_door_lock_cluster_set_user_type_command = sl_zcl_door_lock_cluster_set_user_type_command_signature;
// Command parser for SetUserType command
EmberAfStatus zcl_decode_door_lock_cluster_set_user_type_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_set_user_type_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_set_user_type_command, (uint8_t*)cmd_struct);
} 


// Signature for GetUserTypeResponse command
static const sl_signature_t sig_door_lock_cluster_get_user_type_response_command = sl_zcl_door_lock_cluster_get_user_type_response_command_signature;
// Command parser for GetUserTypeResponse command
EmberAfStatus zcl_decode_door_lock_cluster_get_user_type_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_get_user_type_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_get_user_type_response_command, (uint8_t*)cmd_struct);
} 


// Signature for TransferDataErrorClientToServer command
static const sl_signature_t sig_tunneling_cluster_transfer_data_error_client_to_server_command = sl_zcl_tunneling_cluster_transfer_data_error_client_to_server_command_signature;
// Command parser for TransferDataErrorClientToServer command
EmberAfStatus zcl_decode_tunneling_cluster_transfer_data_error_client_to_server_command (EmberAfClusterCommand * cmd, sl_zcl_tunneling_cluster_transfer_data_error_client_to_server_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_tunneling_cluster_transfer_data_error_client_to_server_command, (uint8_t*)cmd_struct);
} 


// Signature for TransferDataErrorServerToClient command
static const sl_signature_t sig_tunneling_cluster_transfer_data_error_server_to_client_command = sl_zcl_tunneling_cluster_transfer_data_error_server_to_client_command_signature;
// Command parser for TransferDataErrorServerToClient command
EmberAfStatus zcl_decode_tunneling_cluster_transfer_data_error_server_to_client_command (EmberAfClusterCommand * cmd, sl_zcl_tunneling_cluster_transfer_data_error_server_to_client_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_tunneling_cluster_transfer_data_error_server_to_client_command, (uint8_t*)cmd_struct);
} 


// Signature for SetPin command
static const sl_signature_t sig_door_lock_cluster_set_pin_command = sl_zcl_door_lock_cluster_set_pin_command_signature;
// Command parser for SetPin command
EmberAfStatus zcl_decode_door_lock_cluster_set_pin_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_set_pin_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_set_pin_command, (uint8_t*)cmd_struct);
} 


// Signature for SetRfid command
static const sl_signature_t sig_door_lock_cluster_set_rfid_command = sl_zcl_door_lock_cluster_set_rfid_command_signature;
// Command parser for SetRfid command
EmberAfStatus zcl_decode_door_lock_cluster_set_rfid_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_set_rfid_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_set_rfid_command, (uint8_t*)cmd_struct);
} 


// Signature for GetPinResponse command
static const sl_signature_t sig_door_lock_cluster_get_pin_response_command = sl_zcl_door_lock_cluster_get_pin_response_command_signature;
// Command parser for GetPinResponse command
EmberAfStatus zcl_decode_door_lock_cluster_get_pin_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_get_pin_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_get_pin_response_command, (uint8_t*)cmd_struct);
} 


// Signature for GetRfidResponse command
static const sl_signature_t sig_door_lock_cluster_get_rfid_response_command = sl_zcl_door_lock_cluster_get_rfid_response_command_signature;
// Command parser for GetRfidResponse command
EmberAfStatus zcl_decode_door_lock_cluster_get_rfid_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_get_rfid_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_get_rfid_response_command, (uint8_t*)cmd_struct);
} 


// Signature for EnhancedMoveToHue command
static const sl_signature_t sig_color_control_cluster_enhanced_move_to_hue_command = sl_zcl_color_control_cluster_enhanced_move_to_hue_command_signature;
// Command parser for EnhancedMoveToHue command
EmberAfStatus zcl_decode_color_control_cluster_enhanced_move_to_hue_command (EmberAfClusterCommand * cmd, sl_zcl_color_control_cluster_enhanced_move_to_hue_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_color_control_cluster_enhanced_move_to_hue_command, (uint8_t*)cmd_struct);
} 


// Signature for RequestTunnelResponse command
static const sl_signature_t sig_tunneling_cluster_request_tunnel_response_command = sl_zcl_tunneling_cluster_request_tunnel_response_command_signature;
// Command parser for RequestTunnelResponse command
EmberAfStatus zcl_decode_tunneling_cluster_request_tunnel_response_command (EmberAfClusterCommand * cmd, sl_zcl_tunneling_cluster_request_tunnel_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_tunneling_cluster_request_tunnel_response_command, (uint8_t*)cmd_struct);
} 


// Signature for WriteFunctions command
static const sl_signature_t sig_appliance_control_cluster_write_functions_command = sl_zcl_appliance_control_cluster_write_functions_command_signature;
// Command parser for WriteFunctions command
EmberAfStatus zcl_decode_appliance_control_cluster_write_functions_command (EmberAfClusterCommand * cmd, sl_zcl_appliance_control_cluster_write_functions_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_appliance_control_cluster_write_functions_command, (uint8_t*)cmd_struct);
} 


