stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for AckTransferDataClientToServer command
static const sl_signature_t sig_tunneling_cluster_ack_transfer_data_client_to_server_command = sl_zcl_tunneling_cluster_ack_transfer_data_client_to_server_command_signature;
// Command parser for AckTransferDataClientToServer command
EmberAfStatus zcl_decode_tunneling_cluster_ack_transfer_data_client_to_server_command (EmberAfClusterCommand * cmd, sl_zcl_tunneling_cluster_ack_transfer_data_client_to_server_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_tunneling_cluster_ack_transfer_data_client_to_server_command, (uint8_t*)cmd_struct);
} 


// Signature for ReadyDataClientToServer command
static const sl_signature_t sig_tunneling_cluster_ready_data_client_to_server_command = sl_zcl_tunneling_cluster_ready_data_client_to_server_command_signature;
// Command parser for ReadyDataClientToServer command
EmberAfStatus zcl_decode_tunneling_cluster_ready_data_client_to_server_command (EmberAfClusterCommand * cmd, sl_zcl_tunneling_cluster_ready_data_client_to_server_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_tunneling_cluster_ready_data_client_to_server_command, (uint8_t*)cmd_struct);
} 


// Signature for AckTransferDataServerToClient command
static const sl_signature_t sig_tunneling_cluster_ack_transfer_data_server_to_client_command = sl_zcl_tunneling_cluster_ack_transfer_data_server_to_client_command_signature;
// Command parser for AckTransferDataServerToClient command
EmberAfStatus zcl_decode_tunneling_cluster_ack_transfer_data_server_to_client_command (EmberAfClusterCommand * cmd, sl_zcl_tunneling_cluster_ack_transfer_data_server_to_client_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_tunneling_cluster_ack_transfer_data_server_to_client_command, (uint8_t*)cmd_struct);
} 


// Signature for ReadyDataServerToClient command
static const sl_signature_t sig_tunneling_cluster_ready_data_server_to_client_command = sl_zcl_tunneling_cluster_ready_data_server_to_client_command_signature;
// Command parser for ReadyDataServerToClient command
EmberAfStatus zcl_decode_tunneling_cluster_ready_data_server_to_client_command (EmberAfClusterCommand * cmd, sl_zcl_tunneling_cluster_ready_data_server_to_client_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_tunneling_cluster_ready_data_server_to_client_command, (uint8_t*)cmd_struct);
} 


// Signature for LeaveChatRequest command
static const sl_signature_t sig_chatting_cluster_leave_chat_request_command = sl_zcl_chatting_cluster_leave_chat_request_command_signature;
// Command parser for LeaveChatRequest command
EmberAfStatus zcl_decode_chatting_cluster_leave_chat_request_command (EmberAfClusterCommand * cmd, sl_zcl_chatting_cluster_leave_chat_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_chatting_cluster_leave_chat_request_command, (uint8_t*)cmd_struct);
} 


// Signature for SwitchChairmanResponse command
static const sl_signature_t sig_chatting_cluster_switch_chairman_response_command = sl_zcl_chatting_cluster_switch_chairman_response_command_signature;
// Command parser for SwitchChairmanResponse command
EmberAfStatus zcl_decode_chatting_cluster_switch_chairman_response_command (EmberAfClusterCommand * cmd, sl_zcl_chatting_cluster_switch_chairman_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_chatting_cluster_switch_chairman_response_command, (uint8_t*)cmd_struct);
} 


// Signature for GetNodeInformationRequest command
static const sl_signature_t sig_chatting_cluster_get_node_information_request_command = sl_zcl_chatting_cluster_get_node_information_request_command_signature;
// Command parser for GetNodeInformationRequest command
EmberAfStatus zcl_decode_chatting_cluster_get_node_information_request_command (EmberAfClusterCommand * cmd, sl_zcl_chatting_cluster_get_node_information_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_chatting_cluster_get_node_information_request_command, (uint8_t*)cmd_struct);
} 


// Signature for MoveToColorTemperature command
static const sl_signature_t sig_color_control_cluster_move_to_color_temperature_command = sl_zcl_color_control_cluster_move_to_color_temperature_command_signature;
// Command parser for MoveToColorTemperature command
EmberAfStatus zcl_decode_color_control_cluster_move_to_color_temperature_command (EmberAfClusterCommand * cmd, sl_zcl_color_control_cluster_move_to_color_temperature_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_color_control_cluster_move_to_color_temperature_command, (uint8_t*)cmd_struct);
} 


// Signature for UserLeft command
static const sl_signature_t sig_chatting_cluster_user_left_command = sl_zcl_chatting_cluster_user_left_command_signature;
// Command parser for UserLeft command
EmberAfStatus zcl_decode_chatting_cluster_user_left_command (EmberAfClusterCommand * cmd, sl_zcl_chatting_cluster_user_left_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_chatting_cluster_user_left_command, (uint8_t*)cmd_struct);
} 


// Signature for UserJoined command
static const sl_signature_t sig_chatting_cluster_user_joined_command = sl_zcl_chatting_cluster_user_joined_command_signature;
// Command parser for UserJoined command
EmberAfStatus zcl_decode_chatting_cluster_user_joined_command (EmberAfClusterCommand * cmd, sl_zcl_chatting_cluster_user_joined_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_chatting_cluster_user_joined_command, (uint8_t*)cmd_struct);
} 


