stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for SwitchChairmanNotification command
static const sl_signature_t sig_chatting_cluster_switch_chairman_notification_command = sl_zcl_chatting_cluster_switch_chairman_notification_command_signature;
// Command parser for SwitchChairmanNotification command
EmberAfStatus zcl_decode_chatting_cluster_switch_chairman_notification_command (EmberAfClusterCommand * cmd, sl_zcl_chatting_cluster_switch_chairman_notification_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_chatting_cluster_switch_chairman_notification_command, (uint8_t*)cmd_struct);
} 


// Signature for ModifyRecordRequest command
static const sl_signature_t sig_data_sharing_cluster_modify_record_request_command = sl_zcl_data_sharing_cluster_modify_record_request_command_signature;
// Command parser for ModifyRecordRequest command
EmberAfStatus zcl_decode_data_sharing_cluster_modify_record_request_command (EmberAfClusterCommand * cmd, sl_zcl_data_sharing_cluster_modify_record_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_data_sharing_cluster_modify_record_request_command, (uint8_t*)cmd_struct);
} 


// Signature for MoveToColor command
static const sl_signature_t sig_color_control_cluster_move_to_color_command = sl_zcl_color_control_cluster_move_to_color_command_signature;
// Command parser for MoveToColor command
EmberAfStatus zcl_decode_color_control_cluster_move_to_color_command (EmberAfClusterCommand * cmd, sl_zcl_color_control_cluster_move_to_color_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_color_control_cluster_move_to_color_command, (uint8_t*)cmd_struct);
} 


// Signature for ChatMessage command
static const sl_signature_t sig_chatting_cluster_chat_message_command = sl_zcl_chatting_cluster_chat_message_command_signature;
// Command parser for ChatMessage command
EmberAfStatus zcl_decode_chatting_cluster_chat_message_command (EmberAfClusterCommand * cmd, sl_zcl_chatting_cluster_chat_message_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_chatting_cluster_chat_message_command, (uint8_t*)cmd_struct);
} 


// Signature for EnableWwahRejoinAlgorithm command
static const sl_signature_t sig_sl_works_with_all_hubs_cluster_enable_wwah_rejoin_algorithm_command = sl_zcl_sl_works_with_all_hubs_cluster_enable_wwah_rejoin_algorithm_command_signature;
// Command parser for EnableWwahRejoinAlgorithm command
EmberAfStatus zcl_decode_sl_works_with_all_hubs_cluster_enable_wwah_rejoin_algorithm_command (EmberAfClusterCommand * cmd, sl_zcl_sl_works_with_all_hubs_cluster_enable_wwah_rejoin_algorithm_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_sl_works_with_all_hubs_cluster_enable_wwah_rejoin_algorithm_command, (uint8_t*)cmd_struct);
} 


// Signature for UpgradeEndResponse command
static const sl_signature_t sig_over_the_air_bootloading_cluster_upgrade_end_response_command = sl_zcl_over_the_air_bootloading_cluster_upgrade_end_response_command_signature;
// Command parser for UpgradeEndResponse command
EmberAfStatus zcl_decode_over_the_air_bootloading_cluster_upgrade_end_response_command (EmberAfClusterCommand * cmd, sl_zcl_over_the_air_bootloading_cluster_upgrade_end_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_over_the_air_bootloading_cluster_upgrade_end_response_command, (uint8_t*)cmd_struct);
} 


// Signature for GetMeasurementProfileCommand command
static const sl_signature_t sig_electrical_measurement_cluster_get_measurement_profile_command_command = sl_zcl_electrical_measurement_cluster_get_measurement_profile_command_command_signature;
// Command parser for GetMeasurementProfileCommand command
EmberAfStatus zcl_decode_electrical_measurement_cluster_get_measurement_profile_command_command (EmberAfClusterCommand * cmd, sl_zcl_electrical_measurement_cluster_get_measurement_profile_command_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_electrical_measurement_cluster_get_measurement_profile_command_command, (uint8_t*)cmd_struct);
} 


// Signature for GetLogRecordResponse command
static const sl_signature_t sig_door_lock_cluster_get_log_record_response_command = sl_zcl_door_lock_cluster_get_log_record_response_command_signature;
// Command parser for GetLogRecordResponse command
EmberAfStatus zcl_decode_door_lock_cluster_get_log_record_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_get_log_record_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_get_log_record_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ModifyFileRequest command
static const sl_signature_t sig_data_sharing_cluster_modify_file_request_command = sl_zcl_data_sharing_cluster_modify_file_request_command_signature;
// Command parser for ModifyFileRequest command
EmberAfStatus zcl_decode_data_sharing_cluster_modify_file_request_command (EmberAfClusterCommand * cmd, sl_zcl_data_sharing_cluster_modify_file_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_data_sharing_cluster_modify_file_request_command, (uint8_t*)cmd_struct);
} 


// Signature for GetOverallSchedulePriceResponse command
static const sl_signature_t sig_power_profile_cluster_get_overall_schedule_price_response_command = sl_zcl_power_profile_cluster_get_overall_schedule_price_response_command_signature;
// Command parser for GetOverallSchedulePriceResponse command
EmberAfStatus zcl_decode_power_profile_cluster_get_overall_schedule_price_response_command (EmberAfClusterCommand * cmd, sl_zcl_power_profile_cluster_get_overall_schedule_price_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_power_profile_cluster_get_overall_schedule_price_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ViewScene command
static const sl_signature_t sig_scenes_cluster_view_scene_command = sl_zcl_scenes_cluster_view_scene_command_signature;
// Command parser for ViewScene command
EmberAfStatus zcl_decode_scenes_cluster_view_scene_command (EmberAfClusterCommand * cmd, sl_zcl_scenes_cluster_view_scene_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_scenes_cluster_view_scene_command, (uint8_t*)cmd_struct);
} 


// Signature for RemoveScene command
static const sl_signature_t sig_scenes_cluster_remove_scene_command = sl_zcl_scenes_cluster_remove_scene_command_signature;
// Command parser for RemoveScene command
EmberAfStatus zcl_decode_scenes_cluster_remove_scene_command (EmberAfClusterCommand * cmd, sl_zcl_scenes_cluster_remove_scene_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_scenes_cluster_remove_scene_command, (uint8_t*)cmd_struct);
} 


// Signature for StoreScene command
static const sl_signature_t sig_scenes_cluster_store_scene_command = sl_zcl_scenes_cluster_store_scene_command_signature;
// Command parser for StoreScene command
EmberAfStatus zcl_decode_scenes_cluster_store_scene_command (EmberAfClusterCommand * cmd, sl_zcl_scenes_cluster_store_scene_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_scenes_cluster_store_scene_command, (uint8_t*)cmd_struct);
} 


// Signature for EnhancedViewScene command
static const sl_signature_t sig_scenes_cluster_enhanced_view_scene_command = sl_zcl_scenes_cluster_enhanced_view_scene_command_signature;
// Command parser for EnhancedViewScene command
EmberAfStatus zcl_decode_scenes_cluster_enhanced_view_scene_command (EmberAfClusterCommand * cmd, sl_zcl_scenes_cluster_enhanced_view_scene_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_scenes_cluster_enhanced_view_scene_command, (uint8_t*)cmd_struct);
} 


// Signature for SetUserStatus command
static const sl_signature_t sig_door_lock_cluster_set_user_status_command = sl_zcl_door_lock_cluster_set_user_status_command_signature;
// Command parser for SetUserStatus command
EmberAfStatus zcl_decode_door_lock_cluster_set_user_status_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_set_user_status_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_set_user_status_command, (uint8_t*)cmd_struct);
} 


// Signature for GetUserStatusResponse command
static const sl_signature_t sig_door_lock_cluster_get_user_status_response_command = sl_zcl_door_lock_cluster_get_user_status_response_command_signature;
// Command parser for GetUserStatusResponse command
EmberAfStatus zcl_decode_door_lock_cluster_get_user_status_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_get_user_status_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_get_user_status_response_command, (uint8_t*)cmd_struct);
} 


// Signature for EnhancedMoveToHueAndSaturation command
static const sl_signature_t sig_color_control_cluster_enhanced_move_to_hue_and_saturation_command = sl_zcl_color_control_cluster_enhanced_move_to_hue_and_saturation_command_signature;
// Command parser for EnhancedMoveToHueAndSaturation command
EmberAfStatus zcl_decode_color_control_cluster_enhanced_move_to_hue_and_saturation_command (EmberAfClusterCommand * cmd, sl_zcl_color_control_cluster_enhanced_move_to_hue_and_saturation_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_color_control_cluster_enhanced_move_to_hue_and_saturation_command, (uint8_t*)cmd_struct);
} 


// Signature for AddScene command
static const sl_signature_t sig_scenes_cluster_add_scene_command = sl_zcl_scenes_cluster_add_scene_command_signature;
// Command parser for AddScene command
EmberAfStatus zcl_decode_scenes_cluster_add_scene_command (EmberAfClusterCommand * cmd, sl_zcl_scenes_cluster_add_scene_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_scenes_cluster_add_scene_command, (uint8_t*)cmd_struct);
} 


// Signature for EnhancedAddScene command
static const sl_signature_t sig_scenes_cluster_enhanced_add_scene_command = sl_zcl_scenes_cluster_enhanced_add_scene_command_signature;
// Command parser for EnhancedAddScene command
EmberAfStatus zcl_decode_scenes_cluster_enhanced_add_scene_command (EmberAfClusterCommand * cmd, sl_zcl_scenes_cluster_enhanced_add_scene_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_scenes_cluster_enhanced_add_scene_command, (uint8_t*)cmd_struct);
} 


// Signature for RecallScene command
static const sl_signature_t sig_scenes_cluster_recall_scene_command = sl_zcl_scenes_cluster_recall_scene_command_signature;
// Command parser for RecallScene command
EmberAfStatus zcl_decode_scenes_cluster_recall_scene_command (EmberAfClusterCommand * cmd, sl_zcl_scenes_cluster_recall_scene_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_scenes_cluster_recall_scene_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishEventLog command
static const sl_signature_t sig_events_cluster_publish_event_log_command = sl_zcl_events_cluster_publish_event_log_command_signature;
// Command parser for PublishEventLog command
EmberAfStatus zcl_decode_events_cluster_publish_event_log_command (EmberAfClusterCommand * cmd, sl_zcl_events_cluster_publish_event_log_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_events_cluster_publish_event_log_command, (uint8_t*)cmd_struct);
} 


