stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for TransferDataClientToServer command
static const sl_signature_t sig_tunneling_cluster_transfer_data_client_to_server_command = sl_zcl_tunneling_cluster_transfer_data_client_to_server_command_signature;
// Command parser for TransferDataClientToServer command
EmberAfStatus zcl_decode_tunneling_cluster_transfer_data_client_to_server_command (EmberAfClusterCommand * cmd, sl_zcl_tunneling_cluster_transfer_data_client_to_server_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_tunneling_cluster_transfer_data_client_to_server_command, (uint8_t*)cmd_struct);
} 


// Signature for TransferDataServerToClient command
static const sl_signature_t sig_tunneling_cluster_transfer_data_server_to_client_command = sl_zcl_tunneling_cluster_transfer_data_server_to_client_command_signature;
// Command parser for TransferDataServerToClient command
EmberAfStatus zcl_decode_tunneling_cluster_transfer_data_server_to_client_command (EmberAfClusterCommand * cmd, sl_zcl_tunneling_cluster_transfer_data_server_to_client_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_tunneling_cluster_transfer_data_server_to_client_command, (uint8_t*)cmd_struct);
} 


// Signature for SendPreference command
static const sl_signature_t sig_information_cluster_send_preference_command = sl_zcl_information_cluster_send_preference_command_signature;
// Command parser for SendPreference command
EmberAfStatus zcl_decode_information_cluster_send_preference_command (EmberAfClusterCommand * cmd, sl_zcl_information_cluster_send_preference_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_information_cluster_send_preference_command, (uint8_t*)cmd_struct);
} 


// Signature for ReadFileRequest command
static const sl_signature_t sig_data_sharing_cluster_read_file_request_command = sl_zcl_data_sharing_cluster_read_file_request_command_signature;
// Command parser for ReadFileRequest command
EmberAfStatus zcl_decode_data_sharing_cluster_read_file_request_command (EmberAfClusterCommand * cmd, sl_zcl_data_sharing_cluster_read_file_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_data_sharing_cluster_read_file_request_command, (uint8_t*)cmd_struct);
} 


// Signature for ReadRecordRequest command
static const sl_signature_t sig_data_sharing_cluster_read_record_request_command = sl_zcl_data_sharing_cluster_read_record_request_command_signature;
// Command parser for ReadRecordRequest command
EmberAfStatus zcl_decode_data_sharing_cluster_read_record_request_command (EmberAfClusterCommand * cmd, sl_zcl_data_sharing_cluster_read_record_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_data_sharing_cluster_read_record_request_command, (uint8_t*)cmd_struct);
} 


// Signature for SetToken command
static const sl_signature_t sig_configuration_cluster_cluster_set_token_command = sl_zcl_configuration_cluster_cluster_set_token_command_signature;
// Command parser for SetToken command
EmberAfStatus zcl_decode_configuration_cluster_cluster_set_token_command (EmberAfClusterCommand * cmd, sl_zcl_configuration_cluster_cluster_set_token_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_configuration_cluster_cluster_set_token_command, (uint8_t*)cmd_struct);
} 


// Signature for ReturnToken command
static const sl_signature_t sig_configuration_cluster_cluster_return_token_command = sl_zcl_configuration_cluster_cluster_return_token_command_signature;
// Command parser for ReturnToken command
EmberAfStatus zcl_decode_configuration_cluster_cluster_return_token_command (EmberAfClusterCommand * cmd, sl_zcl_configuration_cluster_cluster_return_token_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_configuration_cluster_cluster_return_token_command, (uint8_t*)cmd_struct);
} 


// Signature for SwitchChairmanConfirm command
static const sl_signature_t sig_chatting_cluster_switch_chairman_confirm_command = sl_zcl_chatting_cluster_switch_chairman_confirm_command_signature;
// Command parser for SwitchChairmanConfirm command
EmberAfStatus zcl_decode_chatting_cluster_switch_chairman_confirm_command (EmberAfClusterCommand * cmd, sl_zcl_chatting_cluster_switch_chairman_confirm_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_chatting_cluster_switch_chairman_confirm_command, (uint8_t*)cmd_struct);
} 


// Signature for GetSampledData command
static const sl_signature_t sig_simple_metering_cluster_get_sampled_data_command = sl_zcl_simple_metering_cluster_get_sampled_data_command_signature;
// Command parser for GetSampledData command
EmberAfStatus zcl_decode_simple_metering_cluster_get_sampled_data_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_get_sampled_data_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_get_sampled_data_command, (uint8_t*)cmd_struct);
} 


// Signature for GetSampledDataResponse command
static const sl_signature_t sig_simple_metering_cluster_get_sampled_data_response_command = sl_zcl_simple_metering_cluster_get_sampled_data_response_command_signature;
// Command parser for GetSampledDataResponse command
EmberAfStatus zcl_decode_simple_metering_cluster_get_sampled_data_response_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_get_sampled_data_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_get_sampled_data_response_command, (uint8_t*)cmd_struct);
} 


// Signature for SetLongPollInterval command
static const sl_signature_t sig_poll_control_cluster_set_long_poll_interval_command = sl_zcl_poll_control_cluster_set_long_poll_interval_command_signature;
// Command parser for SetLongPollInterval command
EmberAfStatus zcl_decode_poll_control_cluster_set_long_poll_interval_command (EmberAfClusterCommand * cmd, sl_zcl_poll_control_cluster_set_long_poll_interval_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_poll_control_cluster_set_long_poll_interval_command, (uint8_t*)cmd_struct);
} 


