stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for GetPriceMatrix command
static const sl_signature_t sig_price_cluster_get_price_matrix_command = sl_zcl_price_cluster_get_price_matrix_command_signature;
// Command parser for GetPriceMatrix command
EmberAfStatus zcl_decode_price_cluster_get_price_matrix_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_get_price_matrix_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_get_price_matrix_command, (uint8_t*)cmd_struct);
} 


// Signature for GetBlockThresholds command
static const sl_signature_t sig_price_cluster_get_block_thresholds_command = sl_zcl_price_cluster_get_block_thresholds_command_signature;
// Command parser for GetBlockThresholds command
EmberAfStatus zcl_decode_price_cluster_get_block_thresholds_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_get_block_thresholds_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_get_block_thresholds_command, (uint8_t*)cmd_struct);
} 


// Signature for GetTierLabels command
static const sl_signature_t sig_price_cluster_get_tier_labels_command = sl_zcl_price_cluster_get_tier_labels_command_signature;
// Command parser for GetTierLabels command
EmberAfStatus zcl_decode_price_cluster_get_tier_labels_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_get_tier_labels_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_get_tier_labels_command, (uint8_t*)cmd_struct);
} 


// Signature for SetLowCreditWarningLevel command
static const sl_signature_t sig_prepayment_cluster_set_low_credit_warning_level_command = sl_zcl_prepayment_cluster_set_low_credit_warning_level_command_signature;
// Command parser for SetLowCreditWarningLevel command
EmberAfStatus zcl_decode_prepayment_cluster_set_low_credit_warning_level_command (EmberAfClusterCommand * cmd, sl_zcl_prepayment_cluster_set_low_credit_warning_level_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_prepayment_cluster_set_low_credit_warning_level_command, (uint8_t*)cmd_struct);
} 


// Signature for ConfigurePushInformationTimer command
static const sl_signature_t sig_information_cluster_configure_push_information_timer_command = sl_zcl_information_cluster_configure_push_information_timer_command_signature;
// Command parser for ConfigurePushInformationTimer command
EmberAfStatus zcl_decode_information_cluster_configure_push_information_timer_command (EmberAfClusterCommand * cmd, sl_zcl_information_cluster_configure_push_information_timer_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_information_cluster_configure_push_information_timer_command, (uint8_t*)cmd_struct);
} 


// Signature for LogRequest command
static const sl_signature_t sig_appliance_statistics_cluster_log_request_command = sl_zcl_appliance_statistics_cluster_log_request_command_signature;
// Command parser for LogRequest command
EmberAfStatus zcl_decode_appliance_statistics_cluster_log_request_command (EmberAfClusterCommand * cmd, sl_zcl_appliance_statistics_cluster_log_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_appliance_statistics_cluster_log_request_command, (uint8_t*)cmd_struct);
} 


// Signature for ResetToFactoryNewRequest command
static const sl_signature_t sig_zll_commissioning_cluster_reset_to_factory_new_request_command = sl_zcl_zll_commissioning_cluster_reset_to_factory_new_request_command_signature;
// Command parser for ResetToFactoryNewRequest command
EmberAfStatus zcl_decode_zll_commissioning_cluster_reset_to_factory_new_request_command (EmberAfClusterCommand * cmd, sl_zcl_zll_commissioning_cluster_reset_to_factory_new_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_zll_commissioning_cluster_reset_to_factory_new_request_command, (uint8_t*)cmd_struct);
} 


// Signature for GetLastNetworkProvisioningResult command
static const sl_signature_t sig_network_provisioning_cluster_get_last_network_provisioning_result_command = sl_zcl_network_provisioning_cluster_get_last_network_provisioning_result_command_signature;
// Command parser for GetLastNetworkProvisioningResult command
EmberAfStatus zcl_decode_network_provisioning_cluster_get_last_network_provisioning_result_command (EmberAfClusterCommand * cmd, sl_zcl_network_provisioning_cluster_get_last_network_provisioning_result_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_network_provisioning_cluster_get_last_network_provisioning_result_command, (uint8_t*)cmd_struct);
} 


// Signature for CancelLoadControlEvent command
static const sl_signature_t sig_demand_response_and_load_control_cluster_cancel_load_control_event_command = sl_zcl_demand_response_and_load_control_cluster_cancel_load_control_event_command_signature;
// Command parser for CancelLoadControlEvent command
EmberAfStatus zcl_decode_demand_response_and_load_control_cluster_cancel_load_control_event_command (EmberAfClusterCommand * cmd, sl_zcl_demand_response_and_load_control_cluster_cancel_load_control_event_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_demand_response_and_load_control_cluster_cancel_load_control_event_command, (uint8_t*)cmd_struct);
} 


// Signature for ManageEvent command
static const sl_signature_t sig_energy_management_cluster_manage_event_command = sl_zcl_energy_management_cluster_manage_event_command_signature;
// Command parser for ManageEvent command
EmberAfStatus zcl_decode_energy_management_cluster_manage_event_command (EmberAfClusterCommand * cmd, sl_zcl_energy_management_cluster_manage_event_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_energy_management_cluster_manage_event_command, (uint8_t*)cmd_struct);
} 


// Signature for LoadControlEvent command
static const sl_signature_t sig_demand_response_and_load_control_cluster_load_control_event_command = sl_zcl_demand_response_and_load_control_cluster_load_control_event_command_signature;
// Command parser for LoadControlEvent command
EmberAfStatus zcl_decode_demand_response_and_load_control_cluster_load_control_event_command (EmberAfClusterCommand * cmd, sl_zcl_demand_response_and_load_control_cluster_load_control_event_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_demand_response_and_load_control_cluster_load_control_event_command, (uint8_t*)cmd_struct);
} 


// Signature for CancelMessage command
static const sl_signature_t sig_messaging_cluster_cancel_message_command = sl_zcl_messaging_cluster_cancel_message_command_signature;
// Command parser for CancelMessage command
EmberAfStatus zcl_decode_messaging_cluster_cancel_message_command (EmberAfClusterCommand * cmd, sl_zcl_messaging_cluster_cancel_message_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_messaging_cluster_cancel_message_command, (uint8_t*)cmd_struct);
} 


// Signature for ScanRequest command
static const sl_signature_t sig_zll_commissioning_cluster_scan_request_command = sl_zcl_zll_commissioning_cluster_scan_request_command_signature;
// Command parser for ScanRequest command
EmberAfStatus zcl_decode_zll_commissioning_cluster_scan_request_command (EmberAfClusterCommand * cmd, sl_zcl_zll_commissioning_cluster_scan_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_zll_commissioning_cluster_scan_request_command, (uint8_t*)cmd_struct);
} 


// Signature for DisplayProtectedMessage command
static const sl_signature_t sig_messaging_cluster_display_protected_message_command = sl_zcl_messaging_cluster_display_protected_message_command_signature;
// Command parser for DisplayProtectedMessage command
EmberAfStatus zcl_decode_messaging_cluster_display_protected_message_command (EmberAfClusterCommand * cmd, sl_zcl_messaging_cluster_display_protected_message_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_messaging_cluster_display_protected_message_command, (uint8_t*)cmd_struct);
} 


// Signature for DisplayMessage command
static const sl_signature_t sig_messaging_cluster_display_message_command = sl_zcl_messaging_cluster_display_message_command_signature;
// Command parser for DisplayMessage command
EmberAfStatus zcl_decode_messaging_cluster_display_message_command (EmberAfClusterCommand * cmd, sl_zcl_messaging_cluster_display_message_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_messaging_cluster_display_message_command, (uint8_t*)cmd_struct);
} 


// Signature for CppEventResponse command
static const sl_signature_t sig_price_cluster_cpp_event_response_command = sl_zcl_price_cluster_cpp_event_response_command_signature;
// Command parser for CppEventResponse command
EmberAfStatus zcl_decode_price_cluster_cpp_event_response_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_cpp_event_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_cpp_event_response_command, (uint8_t*)cmd_struct);
} 


// Signature for TakeSnapshotResponse command
static const sl_signature_t sig_simple_metering_cluster_take_snapshot_response_command = sl_zcl_simple_metering_cluster_take_snapshot_response_command_signature;
// Command parser for TakeSnapshotResponse command
EmberAfStatus zcl_decode_simple_metering_cluster_take_snapshot_response_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_take_snapshot_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_take_snapshot_response_command, (uint8_t*)cmd_struct);
} 


// Signature for NetworkJoinRouterResponse command
static const sl_signature_t sig_zll_commissioning_cluster_network_join_router_response_command = sl_zcl_zll_commissioning_cluster_network_join_router_response_command_signature;
// Command parser for NetworkJoinRouterResponse command
EmberAfStatus zcl_decode_zll_commissioning_cluster_network_join_router_response_command (EmberAfClusterCommand * cmd, sl_zcl_zll_commissioning_cluster_network_join_router_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_zll_commissioning_cluster_network_join_router_response_command, (uint8_t*)cmd_struct);
} 


