stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for NetworkJoinEndDeviceResponse command
static const sl_signature_t sig_zll_commissioning_cluster_network_join_end_device_response_command = sl_zcl_zll_commissioning_cluster_network_join_end_device_response_command_signature;
// Command parser for NetworkJoinEndDeviceResponse command
EmberAfStatus zcl_decode_zll_commissioning_cluster_network_join_end_device_response_command (EmberAfClusterCommand * cmd, sl_zcl_zll_commissioning_cluster_network_join_end_device_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_zll_commissioning_cluster_network_join_end_device_response_command, (uint8_t*)cmd_struct);
} 


// Signature for SetSupplyStatus command
static const sl_signature_t sig_simple_metering_cluster_set_supply_status_command = sl_zcl_simple_metering_cluster_set_supply_status_command_signature;
// Command parser for SetSupplyStatus command
EmberAfStatus zcl_decode_simple_metering_cluster_set_supply_status_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_set_supply_status_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_set_supply_status_command, (uint8_t*)cmd_struct);
} 


// Signature for GetMeasurementProfileResponseCommand command
static const sl_signature_t sig_electrical_measurement_cluster_get_measurement_profile_response_command_command = sl_zcl_electrical_measurement_cluster_get_measurement_profile_response_command_command_signature;
// Command parser for GetMeasurementProfileResponseCommand command
EmberAfStatus zcl_decode_electrical_measurement_cluster_get_measurement_profile_response_command_command (EmberAfClusterCommand * cmd, sl_zcl_electrical_measurement_cluster_get_measurement_profile_response_command_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_electrical_measurement_cluster_get_measurement_profile_response_command_command, (uint8_t*)cmd_struct);
} 


// Signature for NetworkStartResponse command
static const sl_signature_t sig_zll_commissioning_cluster_network_start_response_command = sl_zcl_zll_commissioning_cluster_network_start_response_command_signature;
// Command parser for NetworkStartResponse command
EmberAfStatus zcl_decode_zll_commissioning_cluster_network_start_response_command (EmberAfClusterCommand * cmd, sl_zcl_zll_commissioning_cluster_network_start_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_zll_commissioning_cluster_network_start_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ReportEventStatus command
static const sl_signature_t sig_energy_management_cluster_report_event_status_command = sl_zcl_energy_management_cluster_report_event_status_command_signature;
// Command parser for ReportEventStatus command
EmberAfStatus zcl_decode_energy_management_cluster_report_event_status_command (EmberAfClusterCommand * cmd, sl_zcl_energy_management_cluster_report_event_status_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_energy_management_cluster_report_event_status_command, (uint8_t*)cmd_struct);
} 


// Signature for ReportEventStatus command
static const sl_signature_t sig_demand_response_and_load_control_cluster_report_event_status_command = sl_zcl_demand_response_and_load_control_cluster_report_event_status_command_signature;
// Command parser for ReportEventStatus command
EmberAfStatus zcl_decode_demand_response_and_load_control_cluster_report_event_status_command (EmberAfClusterCommand * cmd, sl_zcl_demand_response_and_load_control_cluster_report_event_status_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_demand_response_and_load_control_cluster_report_event_status_command, (uint8_t*)cmd_struct);
} 


// Signature for PairingRequest command
static const sl_signature_t sig_mdu_pairing_cluster_pairing_request_command = sl_zcl_mdu_pairing_cluster_pairing_request_command_signature;
// Command parser for PairingRequest command
EmberAfStatus zcl_decode_mdu_pairing_cluster_pairing_request_command (EmberAfClusterCommand * cmd, sl_zcl_mdu_pairing_cluster_pairing_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_mdu_pairing_cluster_pairing_request_command, (uint8_t*)cmd_struct);
} 


// Signature for NetworkStartRequest command
static const sl_signature_t sig_zll_commissioning_cluster_network_start_request_command = sl_zcl_zll_commissioning_cluster_network_start_request_command_signature;
// Command parser for NetworkStartRequest command
EmberAfStatus zcl_decode_zll_commissioning_cluster_network_start_request_command (EmberAfClusterCommand * cmd, sl_zcl_zll_commissioning_cluster_network_start_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_zll_commissioning_cluster_network_start_request_command, (uint8_t*)cmd_struct);
} 


// Signature for NetworkJoinRouterRequest command
static const sl_signature_t sig_zll_commissioning_cluster_network_join_router_request_command = sl_zcl_zll_commissioning_cluster_network_join_router_request_command_signature;
// Command parser for NetworkJoinRouterRequest command
EmberAfStatus zcl_decode_zll_commissioning_cluster_network_join_router_request_command (EmberAfClusterCommand * cmd, sl_zcl_zll_commissioning_cluster_network_join_router_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_zll_commissioning_cluster_network_join_router_request_command, (uint8_t*)cmd_struct);
} 


// Signature for NetworkJoinEndDeviceRequest command
static const sl_signature_t sig_zll_commissioning_cluster_network_join_end_device_request_command = sl_zcl_zll_commissioning_cluster_network_join_end_device_request_command_signature;
// Command parser for NetworkJoinEndDeviceRequest command
EmberAfStatus zcl_decode_zll_commissioning_cluster_network_join_end_device_request_command (EmberAfClusterCommand * cmd, sl_zcl_zll_commissioning_cluster_network_join_end_device_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_zll_commissioning_cluster_network_join_end_device_request_command, (uint8_t*)cmd_struct);
} 


// Signature for NetworkUpdateRequest command
static const sl_signature_t sig_zll_commissioning_cluster_network_update_request_command = sl_zcl_zll_commissioning_cluster_network_update_request_command_signature;
// Command parser for NetworkUpdateRequest command
EmberAfStatus zcl_decode_zll_commissioning_cluster_network_update_request_command (EmberAfClusterCommand * cmd, sl_zcl_zll_commissioning_cluster_network_update_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_zll_commissioning_cluster_network_update_request_command, (uint8_t*)cmd_struct);
} 


// Signature for IdentifyRequest command
static const sl_signature_t sig_zll_commissioning_cluster_identify_request_command = sl_zcl_zll_commissioning_cluster_identify_request_command_signature;
// Command parser for IdentifyRequest command
EmberAfStatus zcl_decode_zll_commissioning_cluster_identify_request_command (EmberAfClusterCommand * cmd, sl_zcl_zll_commissioning_cluster_identify_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_zll_commissioning_cluster_identify_request_command, (uint8_t*)cmd_struct);
} 


// Signature for ConfigureMirror command
static const sl_signature_t sig_simple_metering_cluster_configure_mirror_command = sl_zcl_simple_metering_cluster_configure_mirror_command_signature;
// Command parser for ConfigureMirror command
EmberAfStatus zcl_decode_simple_metering_cluster_configure_mirror_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_configure_mirror_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_configure_mirror_command, (uint8_t*)cmd_struct);
} 


// Signature for ResetLoadLimitCounter command
static const sl_signature_t sig_simple_metering_cluster_reset_load_limit_counter_command = sl_zcl_simple_metering_cluster_reset_load_limit_counter_command_signature;
// Command parser for ResetLoadLimitCounter command
EmberAfStatus zcl_decode_simple_metering_cluster_reset_load_limit_counter_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_reset_load_limit_counter_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_reset_load_limit_counter_command, (uint8_t*)cmd_struct);
} 


// Signature for GetSeasons command
static const sl_signature_t sig_calendar_cluster_get_seasons_command = sl_zcl_calendar_cluster_get_seasons_command_signature;
// Command parser for GetSeasons command
EmberAfStatus zcl_decode_calendar_cluster_get_seasons_command (EmberAfClusterCommand * cmd, sl_zcl_calendar_cluster_get_seasons_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_calendar_cluster_get_seasons_command, (uint8_t*)cmd_struct);
} 


// Signature for CancelTariff command
static const sl_signature_t sig_price_cluster_cancel_tariff_command = sl_zcl_price_cluster_cancel_tariff_command_signature;
// Command parser for CancelTariff command
EmberAfStatus zcl_decode_price_cluster_cancel_tariff_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_cancel_tariff_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_cancel_tariff_command, (uint8_t*)cmd_struct);
} 


// Signature for CancelCalendar command
static const sl_signature_t sig_calendar_cluster_cancel_calendar_command = sl_zcl_calendar_cluster_cancel_calendar_command_signature;
// Command parser for CancelCalendar command
EmberAfStatus zcl_decode_calendar_cluster_cancel_calendar_command (EmberAfClusterCommand * cmd, sl_zcl_calendar_cluster_cancel_calendar_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_calendar_cluster_cancel_calendar_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishChangeOfSupplier command
static const sl_signature_t sig_device_management_cluster_publish_change_of_supplier_command = sl_zcl_device_management_cluster_publish_change_of_supplier_command_signature;
// Command parser for PublishChangeOfSupplier command
EmberAfStatus zcl_decode_device_management_cluster_publish_change_of_supplier_command (EmberAfClusterCommand * cmd, sl_zcl_device_management_cluster_publish_change_of_supplier_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_device_management_cluster_publish_change_of_supplier_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishChangeOfTenancy command
static const sl_signature_t sig_device_management_cluster_publish_change_of_tenancy_command = sl_zcl_device_management_cluster_publish_change_of_tenancy_command_signature;
// Command parser for PublishChangeOfTenancy command
EmberAfStatus zcl_decode_device_management_cluster_publish_change_of_tenancy_command (EmberAfClusterCommand * cmd, sl_zcl_device_management_cluster_publish_change_of_tenancy_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_device_management_cluster_publish_change_of_tenancy_command, (uint8_t*)cmd_struct);
} 


// Signature for SetUncontrolledFlowThreshold command
static const sl_signature_t sig_simple_metering_cluster_set_uncontrolled_flow_threshold_command = sl_zcl_simple_metering_cluster_set_uncontrolled_flow_threshold_command_signature;
// Command parser for SetUncontrolledFlowThreshold command
EmberAfStatus zcl_decode_simple_metering_cluster_set_uncontrolled_flow_threshold_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_set_uncontrolled_flow_threshold_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_set_uncontrolled_flow_threshold_command, (uint8_t*)cmd_struct);
} 


// Signature for PowerDescriptorChange command
static const sl_signature_t sig_sl_works_with_all_hubs_cluster_power_descriptor_change_command = sl_zcl_sl_works_with_all_hubs_cluster_power_descriptor_change_command_signature;
// Command parser for PowerDescriptorChange command
EmberAfStatus zcl_decode_sl_works_with_all_hubs_cluster_power_descriptor_change_command (EmberAfClusterCommand * cmd, sl_zcl_sl_works_with_all_hubs_cluster_power_descriptor_change_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_sl_works_with_all_hubs_cluster_power_descriptor_change_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishDayProfile command
static const sl_signature_t sig_calendar_cluster_publish_day_profile_command = sl_zcl_calendar_cluster_publish_day_profile_command_signature;
// Command parser for PublishDayProfile command
EmberAfStatus zcl_decode_calendar_cluster_publish_day_profile_command (EmberAfClusterCommand * cmd, sl_zcl_calendar_cluster_publish_day_profile_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_calendar_cluster_publish_day_profile_command, (uint8_t*)cmd_struct);
} 


