stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for PublishWeekProfile command
static const sl_signature_t sig_calendar_cluster_publish_week_profile_command = sl_zcl_calendar_cluster_publish_week_profile_command_signature;
// Command parser for PublishWeekProfile command
EmberAfStatus zcl_decode_calendar_cluster_publish_week_profile_command (EmberAfClusterCommand * cmd, sl_zcl_calendar_cluster_publish_week_profile_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_calendar_cluster_publish_week_profile_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishTierLabels command
static const sl_signature_t sig_price_cluster_publish_tier_labels_command = sl_zcl_price_cluster_publish_tier_labels_command_signature;
// Command parser for PublishTierLabels command
EmberAfStatus zcl_decode_price_cluster_publish_tier_labels_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_publish_tier_labels_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_publish_tier_labels_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishSeasons command
static const sl_signature_t sig_calendar_cluster_publish_seasons_command = sl_zcl_calendar_cluster_publish_seasons_command_signature;
// Command parser for PublishSeasons command
EmberAfStatus zcl_decode_calendar_cluster_publish_seasons_command (EmberAfClusterCommand * cmd, sl_zcl_calendar_cluster_publish_seasons_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_calendar_cluster_publish_seasons_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishTariffInformation command
static const sl_signature_t sig_price_cluster_publish_tariff_information_command = sl_zcl_price_cluster_publish_tariff_information_command_signature;
// Command parser for PublishTariffInformation command
EmberAfStatus zcl_decode_price_cluster_publish_tariff_information_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_publish_tariff_information_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_publish_tariff_information_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishCalendar command
static const sl_signature_t sig_calendar_cluster_publish_calendar_command = sl_zcl_calendar_cluster_publish_calendar_command_signature;
// Command parser for PublishCalendar command
EmberAfStatus zcl_decode_calendar_cluster_publish_calendar_command (EmberAfClusterCommand * cmd, sl_zcl_calendar_cluster_publish_calendar_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_calendar_cluster_publish_calendar_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishSpecialDays command
static const sl_signature_t sig_calendar_cluster_publish_special_days_command = sl_zcl_calendar_cluster_publish_special_days_command_signature;
// Command parser for PublishSpecialDays command
EmberAfStatus zcl_decode_calendar_cluster_publish_special_days_command (EmberAfClusterCommand * cmd, sl_zcl_calendar_cluster_publish_special_days_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_calendar_cluster_publish_special_days_command, (uint8_t*)cmd_struct);
} 


// Signature for GetDayProfiles command
static const sl_signature_t sig_calendar_cluster_get_day_profiles_command = sl_zcl_calendar_cluster_get_day_profiles_command_signature;
// Command parser for GetDayProfiles command
EmberAfStatus zcl_decode_calendar_cluster_get_day_profiles_command (EmberAfClusterCommand * cmd, sl_zcl_calendar_cluster_get_day_profiles_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_calendar_cluster_get_day_profiles_command, (uint8_t*)cmd_struct);
} 


// Signature for GetWeekProfiles command
static const sl_signature_t sig_calendar_cluster_get_week_profiles_command = sl_zcl_calendar_cluster_get_week_profiles_command_signature;
// Command parser for GetWeekProfiles command
EmberAfStatus zcl_decode_calendar_cluster_get_week_profiles_command (EmberAfClusterCommand * cmd, sl_zcl_calendar_cluster_get_week_profiles_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_calendar_cluster_get_week_profiles_command, (uint8_t*)cmd_struct);
} 


// Signature for ChangePaymentMode command
static const sl_signature_t sig_prepayment_cluster_change_payment_mode_command = sl_zcl_prepayment_cluster_change_payment_mode_command_signature;
// Command parser for ChangePaymentMode command
EmberAfStatus zcl_decode_prepayment_cluster_change_payment_mode_command (EmberAfClusterCommand * cmd, sl_zcl_prepayment_cluster_change_payment_mode_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_prepayment_cluster_change_payment_mode_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishBillingPeriod command
static const sl_signature_t sig_price_cluster_publish_billing_period_command = sl_zcl_price_cluster_publish_billing_period_command_signature;
// Command parser for PublishBillingPeriod command
EmberAfStatus zcl_decode_price_cluster_publish_billing_period_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_publish_billing_period_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_publish_billing_period_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishConsolidatedBill command
static const sl_signature_t sig_price_cluster_publish_consolidated_bill_command = sl_zcl_price_cluster_publish_consolidated_bill_command_signature;
// Command parser for PublishConsolidatedBill command
EmberAfStatus zcl_decode_price_cluster_publish_consolidated_bill_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_publish_consolidated_bill_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_publish_consolidated_bill_command, (uint8_t*)cmd_struct);
} 


// Signature for PriceAcknowledgement command
static const sl_signature_t sig_price_cluster_price_acknowledgement_command = sl_zcl_price_cluster_price_acknowledgement_command_signature;
// Command parser for PriceAcknowledgement command
EmberAfStatus zcl_decode_price_cluster_price_acknowledgement_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_price_acknowledgement_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_price_acknowledgement_command, (uint8_t*)cmd_struct);
} 


// Signature for SupplyStatusResponse command
static const sl_signature_t sig_simple_metering_cluster_supply_status_response_command = sl_zcl_simple_metering_cluster_supply_status_response_command_signature;
// Command parser for SupplyStatusResponse command
EmberAfStatus zcl_decode_simple_metering_cluster_supply_status_response_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_supply_status_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_supply_status_response_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishCO2Value command
static const sl_signature_t sig_price_cluster_publish_co2_value_command = sl_zcl_price_cluster_publish_co2_value_command_signature;
// Command parser for PublishCO2Value command
EmberAfStatus zcl_decode_price_cluster_publish_co2_value_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_publish_co2_value_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_publish_co2_value_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishCppEvent command
static const sl_signature_t sig_price_cluster_publish_cpp_event_command = sl_zcl_price_cluster_publish_cpp_event_command_signature;
// Command parser for PublishCppEvent command
EmberAfStatus zcl_decode_price_cluster_publish_cpp_event_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_publish_cpp_event_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_publish_cpp_event_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishCurrencyConversion command
static const sl_signature_t sig_price_cluster_publish_currency_conversion_command = sl_zcl_price_cluster_publish_currency_conversion_command_signature;
// Command parser for PublishCurrencyConversion command
EmberAfStatus zcl_decode_price_cluster_publish_currency_conversion_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_publish_currency_conversion_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_publish_currency_conversion_command, (uint8_t*)cmd_struct);
} 


