stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for PublishBlockPeriod command
static const sl_signature_t sig_price_cluster_publish_block_period_command = sl_zcl_price_cluster_publish_block_period_command_signature;
// Command parser for PublishBlockPeriod command
EmberAfStatus zcl_decode_price_cluster_publish_block_period_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_publish_block_period_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_publish_block_period_command, (uint8_t*)cmd_struct);
} 


// Signature for SetOverallDebtCap command
static const sl_signature_t sig_prepayment_cluster_set_overall_debt_cap_command = sl_zcl_prepayment_cluster_set_overall_debt_cap_command_signature;
// Command parser for SetOverallDebtCap command
EmberAfStatus zcl_decode_prepayment_cluster_set_overall_debt_cap_command (EmberAfClusterCommand * cmd, sl_zcl_prepayment_cluster_set_overall_debt_cap_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_prepayment_cluster_set_overall_debt_cap_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishCreditPayment command
static const sl_signature_t sig_price_cluster_publish_credit_payment_command = sl_zcl_price_cluster_publish_credit_payment_command_signature;
// Command parser for PublishCreditPayment command
EmberAfStatus zcl_decode_price_cluster_publish_credit_payment_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_publish_credit_payment_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_publish_credit_payment_command, (uint8_t*)cmd_struct);
} 


// Signature for SetMaximumCreditLimit command
static const sl_signature_t sig_prepayment_cluster_set_maximum_credit_limit_command = sl_zcl_prepayment_cluster_set_maximum_credit_limit_command_signature;
// Command parser for SetMaximumCreditLimit command
EmberAfStatus zcl_decode_prepayment_cluster_set_maximum_credit_limit_command (EmberAfClusterCommand * cmd, sl_zcl_prepayment_cluster_set_maximum_credit_limit_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_prepayment_cluster_set_maximum_credit_limit_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishPriceMatrix command
static const sl_signature_t sig_price_cluster_publish_price_matrix_command = sl_zcl_price_cluster_publish_price_matrix_command_signature;
// Command parser for PublishPriceMatrix command
EmberAfStatus zcl_decode_price_cluster_publish_price_matrix_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_publish_price_matrix_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_publish_price_matrix_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishBlockThresholds command
static const sl_signature_t sig_price_cluster_publish_block_thresholds_command = sl_zcl_price_cluster_publish_block_thresholds_command_signature;
// Command parser for PublishBlockThresholds command
EmberAfStatus zcl_decode_price_cluster_publish_block_thresholds_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_publish_block_thresholds_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_publish_block_thresholds_command, (uint8_t*)cmd_struct);
} 


// Signature for ChangeSupply command
static const sl_signature_t sig_simple_metering_cluster_change_supply_command = sl_zcl_simple_metering_cluster_change_supply_command_signature;
// Command parser for ChangeSupply command
EmberAfStatus zcl_decode_simple_metering_cluster_change_supply_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_change_supply_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_change_supply_command, (uint8_t*)cmd_struct);
} 


// Signature for DeviceInformationRequest command
static const sl_signature_t sig_zll_commissioning_cluster_device_information_request_command = sl_zcl_zll_commissioning_cluster_device_information_request_command_signature;
// Command parser for DeviceInformationRequest command
EmberAfStatus zcl_decode_zll_commissioning_cluster_device_information_request_command (EmberAfClusterCommand * cmd, sl_zcl_zll_commissioning_cluster_device_information_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_zll_commissioning_cluster_device_information_request_command, (uint8_t*)cmd_struct);
} 


// Signature for ConfigureNotificationScheme command
static const sl_signature_t sig_simple_metering_cluster_configure_notification_scheme_command = sl_zcl_simple_metering_cluster_configure_notification_scheme_command_signature;
// Command parser for ConfigureNotificationScheme command
EmberAfStatus zcl_decode_simple_metering_cluster_configure_notification_scheme_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_configure_notification_scheme_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_configure_notification_scheme_command, (uint8_t*)cmd_struct);
} 


// Signature for ScanResponse command
static const sl_signature_t sig_zll_commissioning_cluster_scan_response_command = sl_zcl_zll_commissioning_cluster_scan_response_command_signature;
// Command parser for ScanResponse command
EmberAfStatus zcl_decode_zll_commissioning_cluster_scan_response_command (EmberAfClusterCommand * cmd, sl_zcl_zll_commissioning_cluster_scan_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_zll_commissioning_cluster_scan_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ConfigureNotificationFlags command
static const sl_signature_t sig_simple_metering_cluster_configure_notification_flags_command = sl_zcl_simple_metering_cluster_configure_notification_flags_command_signature;
// Command parser for ConfigureNotificationFlags command
EmberAfStatus zcl_decode_simple_metering_cluster_configure_notification_flags_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_configure_notification_flags_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_configure_notification_flags_command, (uint8_t*)cmd_struct);
} 


// Signature for PairingResponse command
static const sl_signature_t sig_mdu_pairing_cluster_pairing_response_command = sl_zcl_mdu_pairing_cluster_pairing_response_command_signature;
// Command parser for PairingResponse command
EmberAfStatus zcl_decode_mdu_pairing_cluster_pairing_response_command (EmberAfClusterCommand * cmd, sl_zcl_mdu_pairing_cluster_pairing_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_mdu_pairing_cluster_pairing_response_command, (uint8_t*)cmd_struct);
} 


// Signature for DeviceInformationResponse command
static const sl_signature_t sig_zll_commissioning_cluster_device_information_response_command = sl_zcl_zll_commissioning_cluster_device_information_response_command_signature;
// Command parser for DeviceInformationResponse command
EmberAfStatus zcl_decode_zll_commissioning_cluster_device_information_response_command (EmberAfClusterCommand * cmd, sl_zcl_zll_commissioning_cluster_device_information_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_zll_commissioning_cluster_device_information_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ScheduleSnapshot command
static const sl_signature_t sig_simple_metering_cluster_schedule_snapshot_command = sl_zcl_simple_metering_cluster_schedule_snapshot_command_signature;
// Command parser for ScheduleSnapshot command
EmberAfStatus zcl_decode_simple_metering_cluster_schedule_snapshot_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_schedule_snapshot_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_schedule_snapshot_command, (uint8_t*)cmd_struct);
} 


// Signature for ChangeDebt command
static const sl_signature_t sig_prepayment_cluster_change_debt_command = sl_zcl_prepayment_cluster_change_debt_command_signature;
// Command parser for ChangeDebt command
EmberAfStatus zcl_decode_prepayment_cluster_change_debt_command (EmberAfClusterCommand * cmd, sl_zcl_prepayment_cluster_change_debt_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_prepayment_cluster_change_debt_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishPrice command
static const sl_signature_t sig_price_cluster_publish_price_command = sl_zcl_price_cluster_publish_price_command_signature;
// Command parser for PublishPrice command
EmberAfStatus zcl_decode_price_cluster_publish_price_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_publish_price_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_publish_price_command, (uint8_t*)cmd_struct);
} 


