stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for ScheduleSnapshotResponse command
static const sl_signature_t sig_simple_metering_cluster_schedule_snapshot_response_command = sl_zcl_simple_metering_cluster_schedule_snapshot_response_command_signature;
// Command parser for ScheduleSnapshotResponse command
EmberAfStatus zcl_decode_simple_metering_cluster_schedule_snapshot_response_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_schedule_snapshot_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_schedule_snapshot_response_command, (uint8_t*)cmd_struct);
} 


// Signature for SetEventConfiguration command
static const sl_signature_t sig_device_management_cluster_set_event_configuration_command = sl_zcl_device_management_cluster_set_event_configuration_command_signature;
// Command parser for SetEventConfiguration command
EmberAfStatus zcl_decode_device_management_cluster_set_event_configuration_command (EmberAfClusterCommand * cmd, sl_zcl_device_management_cluster_set_event_configuration_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_device_management_cluster_set_event_configuration_command, (uint8_t*)cmd_struct);
} 


// Signature for MessageConfirmation command
static const sl_signature_t sig_messaging_cluster_message_confirmation_command = sl_zcl_messaging_cluster_message_confirmation_command_signature;
// Command parser for MessageConfirmation command
EmberAfStatus zcl_decode_messaging_cluster_message_confirmation_command (EmberAfClusterCommand * cmd, sl_zcl_messaging_cluster_message_confirmation_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_messaging_cluster_message_confirmation_command, (uint8_t*)cmd_struct);
} 


// Signature for StartSampling command
static const sl_signature_t sig_simple_metering_cluster_start_sampling_command = sl_zcl_simple_metering_cluster_start_sampling_command_signature;
// Command parser for StartSampling command
EmberAfStatus zcl_decode_simple_metering_cluster_start_sampling_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_start_sampling_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_start_sampling_command, (uint8_t*)cmd_struct);
} 


// Signature for CreditAdjustment command
static const sl_signature_t sig_prepayment_cluster_credit_adjustment_command = sl_zcl_prepayment_cluster_credit_adjustment_command_signature;
// Command parser for CreditAdjustment command
EmberAfStatus zcl_decode_prepayment_cluster_credit_adjustment_command (EmberAfClusterCommand * cmd, sl_zcl_prepayment_cluster_credit_adjustment_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_prepayment_cluster_credit_adjustment_command, (uint8_t*)cmd_struct);
} 


// Signature for RequestNewPasswordResponse command
static const sl_signature_t sig_device_management_cluster_request_new_password_response_command = sl_zcl_device_management_cluster_request_new_password_response_command_signature;
// Command parser for RequestNewPasswordResponse command
EmberAfStatus zcl_decode_device_management_cluster_request_new_password_response_command (EmberAfClusterCommand * cmd, sl_zcl_device_management_cluster_request_new_password_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_device_management_cluster_request_new_password_response_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishConversionFactor command
static const sl_signature_t sig_price_cluster_publish_conversion_factor_command = sl_zcl_price_cluster_publish_conversion_factor_command_signature;
// Command parser for PublishConversionFactor command
EmberAfStatus zcl_decode_price_cluster_publish_conversion_factor_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_publish_conversion_factor_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_publish_conversion_factor_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishCalorificValue command
static const sl_signature_t sig_price_cluster_publish_calorific_value_command = sl_zcl_price_cluster_publish_calorific_value_command_signature;
// Command parser for PublishCalorificValue command
EmberAfStatus zcl_decode_price_cluster_publish_calorific_value_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_publish_calorific_value_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_publish_calorific_value_command, (uint8_t*)cmd_struct);
} 


// Signature for EmergencyCreditSetup command
static const sl_signature_t sig_prepayment_cluster_emergency_credit_setup_command = sl_zcl_prepayment_cluster_emergency_credit_setup_command_signature;
// Command parser for EmergencyCreditSetup command
EmberAfStatus zcl_decode_prepayment_cluster_emergency_credit_setup_command (EmberAfClusterCommand * cmd, sl_zcl_prepayment_cluster_emergency_credit_setup_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_prepayment_cluster_emergency_credit_setup_command, (uint8_t*)cmd_struct);
} 


// Signature for UpdateSiteId command
static const sl_signature_t sig_device_management_cluster_update_site_id_command = sl_zcl_device_management_cluster_update_site_id_command_signature;
// Command parser for UpdateSiteId command
EmberAfStatus zcl_decode_device_management_cluster_update_site_id_command (EmberAfClusterCommand * cmd, sl_zcl_device_management_cluster_update_site_id_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_device_management_cluster_update_site_id_command, (uint8_t*)cmd_struct);
} 


// Signature for UpdateCIN command
static const sl_signature_t sig_device_management_cluster_update_cin_command = sl_zcl_device_management_cluster_update_cin_command_signature;
// Command parser for UpdateCIN command
EmberAfStatus zcl_decode_device_management_cluster_update_cin_command (EmberAfClusterCommand * cmd, sl_zcl_device_management_cluster_update_cin_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_device_management_cluster_update_cin_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishSnapshot command
static const sl_signature_t sig_simple_metering_cluster_publish_snapshot_command = sl_zcl_simple_metering_cluster_publish_snapshot_command_signature;
// Command parser for PublishSnapshot command
EmberAfStatus zcl_decode_simple_metering_cluster_publish_snapshot_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_publish_snapshot_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_publish_snapshot_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishPrepaySnapshot command
static const sl_signature_t sig_prepayment_cluster_publish_prepay_snapshot_command = sl_zcl_prepayment_cluster_publish_prepay_snapshot_command_signature;
// Command parser for PublishPrepaySnapshot command
EmberAfStatus zcl_decode_prepayment_cluster_publish_prepay_snapshot_command (EmberAfClusterCommand * cmd, sl_zcl_prepayment_cluster_publish_prepay_snapshot_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_prepayment_cluster_publish_prepay_snapshot_command, (uint8_t*)cmd_struct);
} 


