stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for PowerProfileRequest command
static const sl_signature_t sig_power_profile_cluster_power_profile_request_command = sl_zcl_power_profile_cluster_power_profile_request_command_signature;
// Command parser for PowerProfileRequest command
EmberAfStatus zcl_decode_power_profile_cluster_power_profile_request_command (EmberAfClusterCommand * cmd, sl_zcl_power_profile_cluster_power_profile_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_power_profile_cluster_power_profile_request_command, (uint8_t*)cmd_struct);
} 


// Signature for PowerProfileScheduleConstraintsRequest command
static const sl_signature_t sig_power_profile_cluster_power_profile_schedule_constraints_request_command = sl_zcl_power_profile_cluster_power_profile_schedule_constraints_request_command_signature;
// Command parser for PowerProfileScheduleConstraintsRequest command
EmberAfStatus zcl_decode_power_profile_cluster_power_profile_schedule_constraints_request_command (EmberAfClusterCommand * cmd, sl_zcl_power_profile_cluster_power_profile_schedule_constraints_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_power_profile_cluster_power_profile_schedule_constraints_request_command, (uint8_t*)cmd_struct);
} 


// Signature for EnergyPhasesScheduleStateRequest command
static const sl_signature_t sig_power_profile_cluster_energy_phases_schedule_state_request_command = sl_zcl_power_profile_cluster_energy_phases_schedule_state_request_command_signature;
// Command parser for EnergyPhasesScheduleStateRequest command
EmberAfStatus zcl_decode_power_profile_cluster_energy_phases_schedule_state_request_command (EmberAfClusterCommand * cmd, sl_zcl_power_profile_cluster_energy_phases_schedule_state_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_power_profile_cluster_energy_phases_schedule_state_request_command, (uint8_t*)cmd_struct);
} 


// Signature for GetPowerProfilePrice command
static const sl_signature_t sig_power_profile_cluster_get_power_profile_price_command = sl_zcl_power_profile_cluster_get_power_profile_price_command_signature;
// Command parser for GetPowerProfilePrice command
EmberAfStatus zcl_decode_power_profile_cluster_get_power_profile_price_command (EmberAfClusterCommand * cmd, sl_zcl_power_profile_cluster_get_power_profile_price_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_power_profile_cluster_get_power_profile_price_command, (uint8_t*)cmd_struct);
} 


// Signature for EnergyPhasesScheduleRequest command
static const sl_signature_t sig_power_profile_cluster_energy_phases_schedule_request_command = sl_zcl_power_profile_cluster_energy_phases_schedule_request_command_signature;
// Command parser for EnergyPhasesScheduleRequest command
EmberAfStatus zcl_decode_power_profile_cluster_energy_phases_schedule_request_command (EmberAfClusterCommand * cmd, sl_zcl_power_profile_cluster_energy_phases_schedule_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_power_profile_cluster_energy_phases_schedule_request_command, (uint8_t*)cmd_struct);
} 


// Signature for GetHolidaySchedule command
static const sl_signature_t sig_door_lock_cluster_get_holiday_schedule_command = sl_zcl_door_lock_cluster_get_holiday_schedule_command_signature;
// Command parser for GetHolidaySchedule command
EmberAfStatus zcl_decode_door_lock_cluster_get_holiday_schedule_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_get_holiday_schedule_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_get_holiday_schedule_command, (uint8_t*)cmd_struct);
} 


// Signature for ClearHolidaySchedule command
static const sl_signature_t sig_door_lock_cluster_clear_holiday_schedule_command = sl_zcl_door_lock_cluster_clear_holiday_schedule_command_signature;
// Command parser for ClearHolidaySchedule command
EmberAfStatus zcl_decode_door_lock_cluster_clear_holiday_schedule_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_clear_holiday_schedule_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_clear_holiday_schedule_command, (uint8_t*)cmd_struct);
} 


// Signature for LockDoorResponse command
static const sl_signature_t sig_door_lock_cluster_lock_door_response_command = sl_zcl_door_lock_cluster_lock_door_response_command_signature;
// Command parser for LockDoorResponse command
EmberAfStatus zcl_decode_door_lock_cluster_lock_door_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_lock_door_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_lock_door_response_command, (uint8_t*)cmd_struct);
} 


// Signature for UnlockDoorResponse command
static const sl_signature_t sig_door_lock_cluster_unlock_door_response_command = sl_zcl_door_lock_cluster_unlock_door_response_command_signature;
// Command parser for UnlockDoorResponse command
EmberAfStatus zcl_decode_door_lock_cluster_unlock_door_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_unlock_door_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_unlock_door_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ToggleResponse command
static const sl_signature_t sig_door_lock_cluster_toggle_response_command = sl_zcl_door_lock_cluster_toggle_response_command_signature;
// Command parser for ToggleResponse command
EmberAfStatus zcl_decode_door_lock_cluster_toggle_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_toggle_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_toggle_response_command, (uint8_t*)cmd_struct);
} 


// Signature for UnlockWithTimeoutResponse command
static const sl_signature_t sig_door_lock_cluster_unlock_with_timeout_response_command = sl_zcl_door_lock_cluster_unlock_with_timeout_response_command_signature;
// Command parser for UnlockWithTimeoutResponse command
EmberAfStatus zcl_decode_door_lock_cluster_unlock_with_timeout_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_unlock_with_timeout_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_unlock_with_timeout_response_command, (uint8_t*)cmd_struct);
} 


