stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for ClearPinResponse command
static const sl_signature_t sig_door_lock_cluster_clear_pin_response_command = sl_zcl_door_lock_cluster_clear_pin_response_command_signature;
// Command parser for ClearPinResponse command
EmberAfStatus zcl_decode_door_lock_cluster_clear_pin_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_clear_pin_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_clear_pin_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ClearAllPinsResponse command
static const sl_signature_t sig_door_lock_cluster_clear_all_pins_response_command = sl_zcl_door_lock_cluster_clear_all_pins_response_command_signature;
// Command parser for ClearAllPinsResponse command
EmberAfStatus zcl_decode_door_lock_cluster_clear_all_pins_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_clear_all_pins_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_clear_all_pins_response_command, (uint8_t*)cmd_struct);
} 


// Signature for SetUserStatusResponse command
static const sl_signature_t sig_door_lock_cluster_set_user_status_response_command = sl_zcl_door_lock_cluster_set_user_status_response_command_signature;
// Command parser for SetUserStatusResponse command
EmberAfStatus zcl_decode_door_lock_cluster_set_user_status_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_set_user_status_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_set_user_status_response_command, (uint8_t*)cmd_struct);
} 


// Signature for SetWeekdayScheduleResponse command
static const sl_signature_t sig_door_lock_cluster_set_weekday_schedule_response_command = sl_zcl_door_lock_cluster_set_weekday_schedule_response_command_signature;
// Command parser for SetWeekdayScheduleResponse command
EmberAfStatus zcl_decode_door_lock_cluster_set_weekday_schedule_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_set_weekday_schedule_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_set_weekday_schedule_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ClearWeekdayScheduleResponse command
static const sl_signature_t sig_door_lock_cluster_clear_weekday_schedule_response_command = sl_zcl_door_lock_cluster_clear_weekday_schedule_response_command_signature;
// Command parser for ClearWeekdayScheduleResponse command
EmberAfStatus zcl_decode_door_lock_cluster_clear_weekday_schedule_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_clear_weekday_schedule_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_clear_weekday_schedule_response_command, (uint8_t*)cmd_struct);
} 


// Signature for SetYeardayScheduleResponse command
static const sl_signature_t sig_door_lock_cluster_set_yearday_schedule_response_command = sl_zcl_door_lock_cluster_set_yearday_schedule_response_command_signature;
// Command parser for SetYeardayScheduleResponse command
EmberAfStatus zcl_decode_door_lock_cluster_set_yearday_schedule_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_set_yearday_schedule_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_set_yearday_schedule_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ClearYeardayScheduleResponse command
static const sl_signature_t sig_door_lock_cluster_clear_yearday_schedule_response_command = sl_zcl_door_lock_cluster_clear_yearday_schedule_response_command_signature;
// Command parser for ClearYeardayScheduleResponse command
EmberAfStatus zcl_decode_door_lock_cluster_clear_yearday_schedule_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_clear_yearday_schedule_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_clear_yearday_schedule_response_command, (uint8_t*)cmd_struct);
} 


// Signature for SetHolidayScheduleResponse command
static const sl_signature_t sig_door_lock_cluster_set_holiday_schedule_response_command = sl_zcl_door_lock_cluster_set_holiday_schedule_response_command_signature;
// Command parser for SetHolidayScheduleResponse command
EmberAfStatus zcl_decode_door_lock_cluster_set_holiday_schedule_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_set_holiday_schedule_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_set_holiday_schedule_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ClearHolidayScheduleResponse command
static const sl_signature_t sig_door_lock_cluster_clear_holiday_schedule_response_command = sl_zcl_door_lock_cluster_clear_holiday_schedule_response_command_signature;
// Command parser for ClearHolidayScheduleResponse command
EmberAfStatus zcl_decode_door_lock_cluster_clear_holiday_schedule_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_clear_holiday_schedule_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_clear_holiday_schedule_response_command, (uint8_t*)cmd_struct);
} 


// Signature for SetUserTypeResponse command
static const sl_signature_t sig_door_lock_cluster_set_user_type_response_command = sl_zcl_door_lock_cluster_set_user_type_response_command_signature;
// Command parser for SetUserTypeResponse command
EmberAfStatus zcl_decode_door_lock_cluster_set_user_type_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_set_user_type_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_set_user_type_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ClearRfidResponse command
static const sl_signature_t sig_door_lock_cluster_clear_rfid_response_command = sl_zcl_door_lock_cluster_clear_rfid_response_command_signature;
// Command parser for ClearRfidResponse command
EmberAfStatus zcl_decode_door_lock_cluster_clear_rfid_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_clear_rfid_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_clear_rfid_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ClearAllRfidsResponse command
static const sl_signature_t sig_door_lock_cluster_clear_all_rfids_response_command = sl_zcl_door_lock_cluster_clear_all_rfids_response_command_signature;
// Command parser for ClearAllRfidsResponse command
EmberAfStatus zcl_decode_door_lock_cluster_clear_all_rfids_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_clear_all_rfids_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_clear_all_rfids_response_command, (uint8_t*)cmd_struct);
} 


// Signature for WindowCoveringGoToLiftPercentage command
static const sl_signature_t sig_window_covering_cluster_window_covering_go_to_lift_percentage_command = sl_zcl_window_covering_cluster_window_covering_go_to_lift_percentage_command_signature;
// Command parser for WindowCoveringGoToLiftPercentage command
EmberAfStatus zcl_decode_window_covering_cluster_window_covering_go_to_lift_percentage_command (EmberAfClusterCommand * cmd, sl_zcl_window_covering_cluster_window_covering_go_to_lift_percentage_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_window_covering_cluster_window_covering_go_to_lift_percentage_command, (uint8_t*)cmd_struct);
} 


// Signature for WindowCoveringGoToTiltPercentage command
static const sl_signature_t sig_window_covering_cluster_window_covering_go_to_tilt_percentage_command = sl_zcl_window_covering_cluster_window_covering_go_to_tilt_percentage_command_signature;
// Command parser for WindowCoveringGoToTiltPercentage command
EmberAfStatus zcl_decode_window_covering_cluster_window_covering_go_to_tilt_percentage_command (EmberAfClusterCommand * cmd, sl_zcl_window_covering_cluster_window_covering_go_to_tilt_percentage_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_window_covering_cluster_window_covering_go_to_tilt_percentage_command, (uint8_t*)cmd_struct);
} 


// Signature for BarrierControlGoToPercent command
static const sl_signature_t sig_barrier_control_cluster_barrier_control_go_to_percent_command = sl_zcl_barrier_control_cluster_barrier_control_go_to_percent_command_signature;
// Command parser for BarrierControlGoToPercent command
EmberAfStatus zcl_decode_barrier_control_cluster_barrier_control_go_to_percent_command (EmberAfClusterCommand * cmd, sl_zcl_barrier_control_cluster_barrier_control_go_to_percent_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_barrier_control_cluster_barrier_control_go_to_percent_command, (uint8_t*)cmd_struct);
} 


