stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for GetZoneInformation command
static const sl_signature_t sig_ias_ace_cluster_get_zone_information_command = sl_zcl_ias_ace_cluster_get_zone_information_command_signature;
// Command parser for GetZoneInformation command
EmberAfStatus zcl_decode_ias_ace_cluster_get_zone_information_command (EmberAfClusterCommand * cmd, sl_zcl_ias_ace_cluster_get_zone_information_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_ias_ace_cluster_get_zone_information_command, (uint8_t*)cmd_struct);
} 


// Signature for GetSupportedTunnelProtocols command
static const sl_signature_t sig_tunneling_cluster_get_supported_tunnel_protocols_command = sl_zcl_tunneling_cluster_get_supported_tunnel_protocols_command_signature;
// Command parser for GetSupportedTunnelProtocols command
EmberAfStatus zcl_decode_tunneling_cluster_get_supported_tunnel_protocols_command (EmberAfClusterCommand * cmd, sl_zcl_tunneling_cluster_get_supported_tunnel_protocols_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_tunneling_cluster_get_supported_tunnel_protocols_command, (uint8_t*)cmd_struct);
} 


// Signature for SuspendZclMessages command
static const sl_signature_t sig_sub_g_hz_cluster_suspend_zcl_messages_command = sl_zcl_sub_g_hz_cluster_suspend_zcl_messages_command_signature;
// Command parser for SuspendZclMessages command
EmberAfStatus zcl_decode_sub_g_hz_cluster_suspend_zcl_messages_command (EmberAfClusterCommand * cmd, sl_zcl_sub_g_hz_cluster_suspend_zcl_messages_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_sub_g_hz_cluster_suspend_zcl_messages_command, (uint8_t*)cmd_struct);
} 


// Signature for GetGroupIdentifiersRequest command
static const sl_signature_t sig_zll_commissioning_cluster_get_group_identifiers_request_command = sl_zcl_zll_commissioning_cluster_get_group_identifiers_request_command_signature;
// Command parser for GetGroupIdentifiersRequest command
EmberAfStatus zcl_decode_zll_commissioning_cluster_get_group_identifiers_request_command (EmberAfClusterCommand * cmd, sl_zcl_zll_commissioning_cluster_get_group_identifiers_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_zll_commissioning_cluster_get_group_identifiers_request_command, (uint8_t*)cmd_struct);
} 


// Signature for GetEndpointListRequest command
static const sl_signature_t sig_zll_commissioning_cluster_get_endpoint_list_request_command = sl_zcl_zll_commissioning_cluster_get_endpoint_list_request_command_signature;
// Command parser for GetEndpointListRequest command
EmberAfStatus zcl_decode_zll_commissioning_cluster_get_endpoint_list_request_command (EmberAfClusterCommand * cmd, sl_zcl_zll_commissioning_cluster_get_endpoint_list_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_zll_commissioning_cluster_get_endpoint_list_request_command, (uint8_t*)cmd_struct);
} 


// Signature for SayHelloFromClient command
static const sl_signature_t sig_demo_cluster_say_hello_from_client_command = sl_zcl_demo_cluster_say_hello_from_client_command_signature;
// Command parser for SayHelloFromClient command
EmberAfStatus zcl_decode_demo_cluster_say_hello_from_client_command (EmberAfClusterCommand * cmd, sl_zcl_demo_cluster_say_hello_from_client_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_demo_cluster_say_hello_from_client_command, (uint8_t*)cmd_struct);
} 


// Signature for CommandOne command
static const sl_signature_t sig_sample_mfg_specific_cluster_cluster_command_one_command = sl_zcl_sample_mfg_specific_cluster_cluster_command_one_command_signature;
// Command parser for CommandOne command
EmberAfStatus zcl_decode_sample_mfg_specific_cluster_cluster_command_one_command (EmberAfClusterCommand * cmd, sl_zcl_sample_mfg_specific_cluster_cluster_command_one_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_sample_mfg_specific_cluster_cluster_command_one_command, (uint8_t*)cmd_struct);
} 


// Signature for CommandTwo command
static const sl_signature_t sig_sample_mfg_specific_cluster_2_cluster_command_two_command = sl_zcl_sample_mfg_specific_cluster_2_cluster_command_two_command_signature;
// Command parser for CommandTwo command
EmberAfStatus zcl_decode_sample_mfg_specific_cluster_2_cluster_command_two_command (EmberAfClusterCommand * cmd, sl_zcl_sample_mfg_specific_cluster_2_cluster_command_two_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_sample_mfg_specific_cluster_2_cluster_command_two_command, (uint8_t*)cmd_struct);
} 


// Signature for SetMacPollFailureWaitTime command
static const sl_signature_t sig_sl_works_with_all_hubs_cluster_set_mac_poll_failure_wait_time_command = sl_zcl_sl_works_with_all_hubs_cluster_set_mac_poll_failure_wait_time_command_signature;
// Command parser for SetMacPollFailureWaitTime command
EmberAfStatus zcl_decode_sl_works_with_all_hubs_cluster_set_mac_poll_failure_wait_time_command (EmberAfClusterCommand * cmd, sl_zcl_sl_works_with_all_hubs_cluster_set_mac_poll_failure_wait_time_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_sl_works_with_all_hubs_cluster_set_mac_poll_failure_wait_time_command, (uint8_t*)cmd_struct);
} 


// Signature for DebugReportQuery command
static const sl_signature_t sig_sl_works_with_all_hubs_cluster_debug_report_query_command = sl_zcl_sl_works_with_all_hubs_cluster_debug_report_query_command_signature;
// Command parser for DebugReportQuery command
EmberAfStatus zcl_decode_sl_works_with_all_hubs_cluster_debug_report_query_command (EmberAfClusterCommand * cmd, sl_zcl_sl_works_with_all_hubs_cluster_debug_report_query_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_sl_works_with_all_hubs_cluster_debug_report_query_command, (uint8_t*)cmd_struct);
} 


// Signature for MirrorReportAttributeResponse command
static const sl_signature_t sig_simple_metering_cluster_mirror_report_attribute_response_command = sl_zcl_simple_metering_cluster_mirror_report_attribute_response_command_signature;
// Command parser for MirrorReportAttributeResponse command
EmberAfStatus zcl_decode_simple_metering_cluster_mirror_report_attribute_response_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_mirror_report_attribute_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_mirror_report_attribute_response_command, (uint8_t*)cmd_struct);
} 


// Signature for GeneralResponse command
static const sl_signature_t sig_gaming_cluster_general_response_command = sl_zcl_gaming_cluster_general_response_command_signature;
// Command parser for GeneralResponse command
EmberAfStatus zcl_decode_gaming_cluster_general_response_command (EmberAfClusterCommand * cmd, sl_zcl_gaming_cluster_general_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_gaming_cluster_general_response_command, (uint8_t*)cmd_struct);
} 


// Signature for AddWiFiNetworkResp command
static const sl_signature_t sig_network_provisioning_cluster_add_wi_fi_network_resp_command = sl_zcl_network_provisioning_cluster_add_wi_fi_network_resp_command_signature;
// Command parser for AddWiFiNetworkResp command
EmberAfStatus zcl_decode_network_provisioning_cluster_add_wi_fi_network_resp_command (EmberAfClusterCommand * cmd, sl_zcl_network_provisioning_cluster_add_wi_fi_network_resp_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_network_provisioning_cluster_add_wi_fi_network_resp_command, (uint8_t*)cmd_struct);
} 


// Signature for UpdateWiFiNetworkResp command
static const sl_signature_t sig_network_provisioning_cluster_update_wi_fi_network_resp_command = sl_zcl_network_provisioning_cluster_update_wi_fi_network_resp_command_signature;
// Command parser for UpdateWiFiNetworkResp command
EmberAfStatus zcl_decode_network_provisioning_cluster_update_wi_fi_network_resp_command (EmberAfClusterCommand * cmd, sl_zcl_network_provisioning_cluster_update_wi_fi_network_resp_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_network_provisioning_cluster_update_wi_fi_network_resp_command, (uint8_t*)cmd_struct);
} 


// Signature for AddThreadNetworkResp command
static const sl_signature_t sig_network_provisioning_cluster_add_thread_network_resp_command = sl_zcl_network_provisioning_cluster_add_thread_network_resp_command_signature;
// Command parser for AddThreadNetworkResp command
EmberAfStatus zcl_decode_network_provisioning_cluster_add_thread_network_resp_command (EmberAfClusterCommand * cmd, sl_zcl_network_provisioning_cluster_add_thread_network_resp_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_network_provisioning_cluster_add_thread_network_resp_command, (uint8_t*)cmd_struct);
} 


// Signature for UpdateThreadNetworkResp command
static const sl_signature_t sig_network_provisioning_cluster_update_thread_network_resp_command = sl_zcl_network_provisioning_cluster_update_thread_network_resp_command_signature;
// Command parser for UpdateThreadNetworkResp command
EmberAfStatus zcl_decode_network_provisioning_cluster_update_thread_network_resp_command (EmberAfClusterCommand * cmd, sl_zcl_network_provisioning_cluster_update_thread_network_resp_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_network_provisioning_cluster_update_thread_network_resp_command, (uint8_t*)cmd_struct);
} 


// Signature for RemoveNetworkResp command
static const sl_signature_t sig_network_provisioning_cluster_remove_network_resp_command = sl_zcl_network_provisioning_cluster_remove_network_resp_command_signature;
// Command parser for RemoveNetworkResp command
EmberAfStatus zcl_decode_network_provisioning_cluster_remove_network_resp_command (EmberAfClusterCommand * cmd, sl_zcl_network_provisioning_cluster_remove_network_resp_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_network_provisioning_cluster_remove_network_resp_command, (uint8_t*)cmd_struct);
} 


