stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for EnableNetworkResp command
static const sl_signature_t sig_network_provisioning_cluster_enable_network_resp_command = sl_zcl_network_provisioning_cluster_enable_network_resp_command_signature;
// Command parser for EnableNetworkResp command
EmberAfStatus zcl_decode_network_provisioning_cluster_enable_network_resp_command (EmberAfClusterCommand * cmd, sl_zcl_network_provisioning_cluster_enable_network_resp_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_network_provisioning_cluster_enable_network_resp_command, (uint8_t*)cmd_struct);
} 


// Signature for DisableNetworkResp command
static const sl_signature_t sig_network_provisioning_cluster_disable_network_resp_command = sl_zcl_network_provisioning_cluster_disable_network_resp_command_signature;
// Command parser for DisableNetworkResp command
EmberAfStatus zcl_decode_network_provisioning_cluster_disable_network_resp_command (EmberAfClusterCommand * cmd, sl_zcl_network_provisioning_cluster_disable_network_resp_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_network_provisioning_cluster_disable_network_resp_command, (uint8_t*)cmd_struct);
} 


// Signature for TestNetworkResp command
static const sl_signature_t sig_network_provisioning_cluster_test_network_resp_command = sl_zcl_network_provisioning_cluster_test_network_resp_command_signature;
// Command parser for TestNetworkResp command
EmberAfStatus zcl_decode_network_provisioning_cluster_test_network_resp_command (EmberAfClusterCommand * cmd, sl_zcl_network_provisioning_cluster_test_network_resp_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_network_provisioning_cluster_test_network_resp_command, (uint8_t*)cmd_struct);
} 


// Signature for ZoneStatusChanged command
static const sl_signature_t sig_ias_ace_cluster_zone_status_changed_command = sl_zcl_ias_ace_cluster_zone_status_changed_command_signature;
// Command parser for ZoneStatusChanged command
EmberAfStatus zcl_decode_ias_ace_cluster_zone_status_changed_command (EmberAfClusterCommand * cmd, sl_zcl_ias_ace_cluster_zone_status_changed_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_ias_ace_cluster_zone_status_changed_command, (uint8_t*)cmd_struct);
} 


// Signature for GetZoneInformationResponse command
static const sl_signature_t sig_ias_ace_cluster_get_zone_information_response_command = sl_zcl_ias_ace_cluster_get_zone_information_response_command_signature;
// Command parser for GetZoneInformationResponse command
EmberAfStatus zcl_decode_ias_ace_cluster_get_zone_information_response_command (EmberAfClusterCommand * cmd, sl_zcl_ias_ace_cluster_get_zone_information_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_ias_ace_cluster_get_zone_information_response_command, (uint8_t*)cmd_struct);
} 


// Signature for VoiceTransmissionResponse command
static const sl_signature_t sig_voice_over_zig_bee_cluster_voice_transmission_response_command = sl_zcl_voice_over_zig_bee_cluster_voice_transmission_response_command_signature;
// Command parser for VoiceTransmissionResponse command
EmberAfStatus zcl_decode_voice_over_zig_bee_cluster_voice_transmission_response_command (EmberAfClusterCommand * cmd, sl_zcl_voice_over_zig_bee_cluster_voice_transmission_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_voice_over_zig_bee_cluster_voice_transmission_response_command, (uint8_t*)cmd_struct);
} 


// Signature for EventsNotification command
static const sl_signature_t sig_appliance_events_and_alert_cluster_events_notification_command = sl_zcl_appliance_events_and_alert_cluster_events_notification_command_signature;
// Command parser for EventsNotification command
EmberAfStatus zcl_decode_appliance_events_and_alert_cluster_events_notification_command (EmberAfClusterCommand * cmd, sl_zcl_appliance_events_and_alert_cluster_events_notification_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_appliance_events_and_alert_cluster_events_notification_command, (uint8_t*)cmd_struct);
} 


// Signature for MoveToHue command
static const sl_signature_t sig_color_control_cluster_move_to_hue_command = sl_zcl_color_control_cluster_move_to_hue_command_signature;
// Command parser for MoveToHue command
EmberAfStatus zcl_decode_color_control_cluster_move_to_hue_command (EmberAfClusterCommand * cmd, sl_zcl_color_control_cluster_move_to_hue_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_color_control_cluster_move_to_hue_command, (uint8_t*)cmd_struct);
} 


// Signature for ProgrammingEventNotification command
static const sl_signature_t sig_door_lock_cluster_programming_event_notification_command = sl_zcl_door_lock_cluster_programming_event_notification_command_signature;
// Command parser for ProgrammingEventNotification command
EmberAfStatus zcl_decode_door_lock_cluster_programming_event_notification_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_programming_event_notification_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_programming_event_notification_command, (uint8_t*)cmd_struct);
} 


// Signature for OperationEventNotification command
static const sl_signature_t sig_door_lock_cluster_operation_event_notification_command = sl_zcl_door_lock_cluster_operation_event_notification_command_signature;
// Command parser for OperationEventNotification command
EmberAfStatus zcl_decode_door_lock_cluster_operation_event_notification_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_operation_event_notification_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_operation_event_notification_command, (uint8_t*)cmd_struct);
} 


// Signature for GetProfileInfoResponseCommand command
static const sl_signature_t sig_electrical_measurement_cluster_get_profile_info_response_command_command = sl_zcl_electrical_measurement_cluster_get_profile_info_response_command_command_signature;
// Command parser for GetProfileInfoResponseCommand command
EmberAfStatus zcl_decode_electrical_measurement_cluster_get_profile_info_response_command_command (EmberAfClusterCommand * cmd, sl_zcl_electrical_measurement_cluster_get_profile_info_response_command_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_electrical_measurement_cluster_get_profile_info_response_command_command, (uint8_t*)cmd_struct);
} 


// Signature for BypassResponse command
static const sl_signature_t sig_ias_ace_cluster_bypass_response_command = sl_zcl_ias_ace_cluster_bypass_response_command_signature;
// Command parser for BypassResponse command
EmberAfStatus zcl_decode_ias_ace_cluster_bypass_response_command (EmberAfClusterCommand * cmd, sl_zcl_ias_ace_cluster_bypass_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_ias_ace_cluster_bypass_response_command, (uint8_t*)cmd_struct);
} 


// Signature for MoveToLevelWithOnOff command
static const sl_signature_t sig_level_control_cluster_move_to_level_with_on_off_command = sl_zcl_level_control_cluster_move_to_level_with_on_off_command_signature;
// Command parser for MoveToLevelWithOnOff command
EmberAfStatus zcl_decode_level_control_cluster_move_to_level_with_on_off_command (EmberAfClusterCommand * cmd, sl_zcl_level_control_cluster_move_to_level_with_on_off_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_level_control_cluster_move_to_level_with_on_off_command, (uint8_t*)cmd_struct);
} 


// Signature for GetWeekdaySchedule command
static const sl_signature_t sig_door_lock_cluster_get_weekday_schedule_command = sl_zcl_door_lock_cluster_get_weekday_schedule_command_signature;
// Command parser for GetWeekdaySchedule command
EmberAfStatus zcl_decode_door_lock_cluster_get_weekday_schedule_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_get_weekday_schedule_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_get_weekday_schedule_command, (uint8_t*)cmd_struct);
} 


// Signature for ClearWeekdaySchedule command
static const sl_signature_t sig_door_lock_cluster_clear_weekday_schedule_command = sl_zcl_door_lock_cluster_clear_weekday_schedule_command_signature;
// Command parser for ClearWeekdaySchedule command
EmberAfStatus zcl_decode_door_lock_cluster_clear_weekday_schedule_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_clear_weekday_schedule_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_clear_weekday_schedule_command, (uint8_t*)cmd_struct);
} 


// Signature for GetYeardaySchedule command
static const sl_signature_t sig_door_lock_cluster_get_yearday_schedule_command = sl_zcl_door_lock_cluster_get_yearday_schedule_command_signature;
// Command parser for GetYeardaySchedule command
EmberAfStatus zcl_decode_door_lock_cluster_get_yearday_schedule_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_get_yearday_schedule_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_get_yearday_schedule_command, (uint8_t*)cmd_struct);
} 


// Signature for ClearYeardaySchedule command
static const sl_signature_t sig_door_lock_cluster_clear_yearday_schedule_command = sl_zcl_door_lock_cluster_clear_yearday_schedule_command_signature;
// Command parser for ClearYeardaySchedule command
EmberAfStatus zcl_decode_door_lock_cluster_clear_yearday_schedule_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_clear_yearday_schedule_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_clear_yearday_schedule_command, (uint8_t*)cmd_struct);
} 


// Signature for SetPendingNetworkUpdate command
static const sl_signature_t sig_sl_works_with_all_hubs_cluster_set_pending_network_update_command = sl_zcl_sl_works_with_all_hubs_cluster_set_pending_network_update_command_signature;
// Command parser for SetPendingNetworkUpdate command
EmberAfStatus zcl_decode_sl_works_with_all_hubs_cluster_set_pending_network_update_command (EmberAfClusterCommand * cmd, sl_zcl_sl_works_with_all_hubs_cluster_set_pending_network_update_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_sl_works_with_all_hubs_cluster_set_pending_network_update_command, (uint8_t*)cmd_struct);
} 


