stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for GetNotifiedMessage command
static const sl_signature_t sig_simple_metering_cluster_get_notified_message_command = sl_zcl_simple_metering_cluster_get_notified_message_command_signature;
// Command parser for GetNotifiedMessage command
EmberAfStatus zcl_decode_simple_metering_cluster_get_notified_message_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_get_notified_message_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_get_notified_message_command, (uint8_t*)cmd_struct);
} 


// Signature for SetWeekdaySchedule command
static const sl_signature_t sig_door_lock_cluster_set_weekday_schedule_command = sl_zcl_door_lock_cluster_set_weekday_schedule_command_signature;
// Command parser for SetWeekdaySchedule command
EmberAfStatus zcl_decode_door_lock_cluster_set_weekday_schedule_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_set_weekday_schedule_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_set_weekday_schedule_command, (uint8_t*)cmd_struct);
} 


// Signature for MoveToLevel command
static const sl_signature_t sig_level_control_cluster_move_to_level_command = sl_zcl_level_control_cluster_move_to_level_command_signature;
// Command parser for MoveToLevel command
EmberAfStatus zcl_decode_level_control_cluster_move_to_level_command (EmberAfClusterCommand * cmd, sl_zcl_level_control_cluster_move_to_level_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_level_control_cluster_move_to_level_command, (uint8_t*)cmd_struct);
} 


// Signature for MoveToSaturation command
static const sl_signature_t sig_color_control_cluster_move_to_saturation_command = sl_zcl_color_control_cluster_move_to_saturation_command_signature;
// Command parser for MoveToSaturation command
EmberAfStatus zcl_decode_color_control_cluster_move_to_saturation_command (EmberAfClusterCommand * cmd, sl_zcl_color_control_cluster_move_to_saturation_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_color_control_cluster_move_to_saturation_command, (uint8_t*)cmd_struct);
} 


// Signature for RequestTunnel command
static const sl_signature_t sig_tunneling_cluster_request_tunnel_command = sl_zcl_tunneling_cluster_request_tunnel_command_signature;
// Command parser for RequestTunnel command
EmberAfStatus zcl_decode_tunneling_cluster_request_tunnel_command (EmberAfClusterCommand * cmd, sl_zcl_tunneling_cluster_request_tunnel_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_tunneling_cluster_request_tunnel_command, (uint8_t*)cmd_struct);
} 


// Signature for PowerProfileScheduleConstraintsNotification command
static const sl_signature_t sig_power_profile_cluster_power_profile_schedule_constraints_notification_command = sl_zcl_power_profile_cluster_power_profile_schedule_constraints_notification_command_signature;
// Command parser for PowerProfileScheduleConstraintsNotification command
EmberAfStatus zcl_decode_power_profile_cluster_power_profile_schedule_constraints_notification_command (EmberAfClusterCommand * cmd, sl_zcl_power_profile_cluster_power_profile_schedule_constraints_notification_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_power_profile_cluster_power_profile_schedule_constraints_notification_command, (uint8_t*)cmd_struct);
} 


// Signature for PowerProfileScheduleConstraintsResponse command
static const sl_signature_t sig_power_profile_cluster_power_profile_schedule_constraints_response_command = sl_zcl_power_profile_cluster_power_profile_schedule_constraints_response_command_signature;
// Command parser for PowerProfileScheduleConstraintsResponse command
EmberAfStatus zcl_decode_power_profile_cluster_power_profile_schedule_constraints_response_command (EmberAfClusterCommand * cmd, sl_zcl_power_profile_cluster_power_profile_schedule_constraints_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_power_profile_cluster_power_profile_schedule_constraints_response_command, (uint8_t*)cmd_struct);
} 


// Signature for QueryNextImageRequest command
static const sl_signature_t sig_over_the_air_bootloading_cluster_query_next_image_request_command = sl_zcl_over_the_air_bootloading_cluster_query_next_image_request_command_signature;
// Command parser for QueryNextImageRequest command
EmberAfStatus zcl_decode_over_the_air_bootloading_cluster_query_next_image_request_command (EmberAfClusterCommand * cmd, sl_zcl_over_the_air_bootloading_cluster_query_next_image_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_over_the_air_bootloading_cluster_query_next_image_request_command, (uint8_t*)cmd_struct);
} 


// Signature for ImageBlockRequest command
static const sl_signature_t sig_over_the_air_bootloading_cluster_image_block_request_command = sl_zcl_over_the_air_bootloading_cluster_image_block_request_command_signature;
// Command parser for ImageBlockRequest command
EmberAfStatus zcl_decode_over_the_air_bootloading_cluster_image_block_request_command (EmberAfClusterCommand * cmd, sl_zcl_over_the_air_bootloading_cluster_image_block_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_over_the_air_bootloading_cluster_image_block_request_command, (uint8_t*)cmd_struct);
} 


// Signature for ImagePageRequest command
static const sl_signature_t sig_over_the_air_bootloading_cluster_image_page_request_command = sl_zcl_over_the_air_bootloading_cluster_image_page_request_command_signature;
// Command parser for ImagePageRequest command
EmberAfStatus zcl_decode_over_the_air_bootloading_cluster_image_page_request_command (EmberAfClusterCommand * cmd, sl_zcl_over_the_air_bootloading_cluster_image_page_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_over_the_air_bootloading_cluster_image_page_request_command, (uint8_t*)cmd_struct);
} 


// Signature for SetYeardaySchedule command
static const sl_signature_t sig_door_lock_cluster_set_yearday_schedule_command = sl_zcl_door_lock_cluster_set_yearday_schedule_command_signature;
// Command parser for SetYeardaySchedule command
EmberAfStatus zcl_decode_door_lock_cluster_set_yearday_schedule_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_set_yearday_schedule_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_set_yearday_schedule_command, (uint8_t*)cmd_struct);
} 


// Signature for GetPowerProfilePriceResponse command
static const sl_signature_t sig_power_profile_cluster_get_power_profile_price_response_command = sl_zcl_power_profile_cluster_get_power_profile_price_response_command_signature;
// Command parser for GetPowerProfilePriceResponse command
EmberAfStatus zcl_decode_power_profile_cluster_get_power_profile_price_response_command (EmberAfClusterCommand * cmd, sl_zcl_power_profile_cluster_get_power_profile_price_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_power_profile_cluster_get_power_profile_price_response_command, (uint8_t*)cmd_struct);
} 


