stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for GetPowerProfilePriceExtendedResponse command
static const sl_signature_t sig_power_profile_cluster_get_power_profile_price_extended_response_command = sl_zcl_power_profile_cluster_get_power_profile_price_extended_response_command_signature;
// Command parser for GetPowerProfilePriceExtendedResponse command
EmberAfStatus zcl_decode_power_profile_cluster_get_power_profile_price_extended_response_command (EmberAfClusterCommand * cmd, sl_zcl_power_profile_cluster_get_power_profile_price_extended_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_power_profile_cluster_get_power_profile_price_extended_response_command, (uint8_t*)cmd_struct);
} 


// Signature for GetYeardayScheduleResponse command
static const sl_signature_t sig_door_lock_cluster_get_yearday_schedule_response_command = sl_zcl_door_lock_cluster_get_yearday_schedule_response_command_signature;
// Command parser for GetYeardayScheduleResponse command
EmberAfStatus zcl_decode_door_lock_cluster_get_yearday_schedule_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_get_yearday_schedule_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_get_yearday_schedule_response_command, (uint8_t*)cmd_struct);
} 


// Signature for GetWeekdayScheduleResponse command
static const sl_signature_t sig_door_lock_cluster_get_weekday_schedule_response_command = sl_zcl_door_lock_cluster_get_weekday_schedule_response_command_signature;
// Command parser for GetWeekdayScheduleResponse command
EmberAfStatus zcl_decode_door_lock_cluster_get_weekday_schedule_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_get_weekday_schedule_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_get_weekday_schedule_response_command, (uint8_t*)cmd_struct);
} 


// Signature for GetGroupMembership command
static const sl_signature_t sig_groups_cluster_get_group_membership_command = sl_zcl_groups_cluster_get_group_membership_command_signature;
// Command parser for GetGroupMembership command
EmberAfStatus zcl_decode_groups_cluster_get_group_membership_command (EmberAfClusterCommand * cmd, sl_zcl_groups_cluster_get_group_membership_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_groups_cluster_get_group_membership_command, (uint8_t*)cmd_struct);
} 


// Signature for NewDebugReportNotification command
static const sl_signature_t sig_sl_works_with_all_hubs_cluster_new_debug_report_notification_command = sl_zcl_sl_works_with_all_hubs_cluster_new_debug_report_notification_command_signature;
// Command parser for NewDebugReportNotification command
EmberAfStatus zcl_decode_sl_works_with_all_hubs_cluster_new_debug_report_notification_command (EmberAfClusterCommand * cmd, sl_zcl_sl_works_with_all_hubs_cluster_new_debug_report_notification_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_sl_works_with_all_hubs_cluster_new_debug_report_notification_command, (uint8_t*)cmd_struct);
} 


// Signature for SetHolidaySchedule command
static const sl_signature_t sig_door_lock_cluster_set_holiday_schedule_command = sl_zcl_door_lock_cluster_set_holiday_schedule_command_signature;
// Command parser for SetHolidaySchedule command
EmberAfStatus zcl_decode_door_lock_cluster_set_holiday_schedule_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_set_holiday_schedule_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_set_holiday_schedule_command, (uint8_t*)cmd_struct);
} 


// Signature for LogQueueResponse command
static const sl_signature_t sig_appliance_statistics_cluster_log_queue_response_command = sl_zcl_appliance_statistics_cluster_log_queue_response_command_signature;
// Command parser for LogQueueResponse command
EmberAfStatus zcl_decode_appliance_statistics_cluster_log_queue_response_command (EmberAfClusterCommand * cmd, sl_zcl_appliance_statistics_cluster_log_queue_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_appliance_statistics_cluster_log_queue_response_command, (uint8_t*)cmd_struct);
} 


// Signature for StatisticsAvailable command
static const sl_signature_t sig_appliance_statistics_cluster_statistics_available_command = sl_zcl_appliance_statistics_cluster_statistics_available_command_signature;
// Command parser for StatisticsAvailable command
EmberAfStatus zcl_decode_appliance_statistics_cluster_statistics_available_command (EmberAfClusterCommand * cmd, sl_zcl_appliance_statistics_cluster_statistics_available_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_appliance_statistics_cluster_statistics_available_command, (uint8_t*)cmd_struct);
} 


// Signature for stream command
static const sl_signature_t sig_mfglib_cluster_cluster_stream_command = sl_zcl_mfglib_cluster_cluster_stream_command_signature;
// Command parser for stream command
EmberAfStatus zcl_decode_mfglib_cluster_cluster_stream_command (EmberAfClusterCommand * cmd, sl_zcl_mfglib_cluster_cluster_stream_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_mfglib_cluster_cluster_stream_command, (uint8_t*)cmd_struct);
} 


// Signature for tone command
static const sl_signature_t sig_mfglib_cluster_cluster_tone_command = sl_zcl_mfglib_cluster_cluster_tone_command_signature;
// Command parser for tone command
EmberAfStatus zcl_decode_mfglib_cluster_cluster_tone_command (EmberAfClusterCommand * cmd, sl_zcl_mfglib_cluster_cluster_tone_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_mfglib_cluster_cluster_tone_command, (uint8_t*)cmd_struct);
} 


// Signature for rxMode command
static const sl_signature_t sig_mfglib_cluster_cluster_rx_mode_command = sl_zcl_mfglib_cluster_cluster_rx_mode_command_signature;
// Command parser for rxMode command
EmberAfStatus zcl_decode_mfglib_cluster_cluster_rx_mode_command (EmberAfClusterCommand * cmd, sl_zcl_mfglib_cluster_cluster_rx_mode_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_mfglib_cluster_cluster_rx_mode_command, (uint8_t*)cmd_struct);
} 


// Signature for InitiateTestMode command
static const sl_signature_t sig_ias_zone_cluster_initiate_test_mode_command = sl_zcl_ias_zone_cluster_initiate_test_mode_command_signature;
// Command parser for InitiateTestMode command
EmberAfStatus zcl_decode_ias_zone_cluster_initiate_test_mode_command (EmberAfClusterCommand * cmd, sl_zcl_ias_zone_cluster_initiate_test_mode_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_ias_zone_cluster_initiate_test_mode_command, (uint8_t*)cmd_struct);
} 


