stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for RequestFastPollMode command
static const sl_signature_t sig_simple_metering_cluster_request_fast_poll_mode_command = sl_zcl_simple_metering_cluster_request_fast_poll_mode_command_signature;
// Command parser for RequestFastPollMode command
EmberAfStatus zcl_decode_simple_metering_cluster_request_fast_poll_mode_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_request_fast_poll_mode_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_request_fast_poll_mode_command, (uint8_t*)cmd_struct);
} 


// Signature for GetZoneStatus command
static const sl_signature_t sig_ias_ace_cluster_get_zone_status_command = sl_zcl_ias_ace_cluster_get_zone_status_command_signature;
// Command parser for GetZoneStatus command
EmberAfStatus zcl_decode_ias_ace_cluster_get_zone_status_command (EmberAfClusterCommand * cmd, sl_zcl_ias_ace_cluster_get_zone_status_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_ias_ace_cluster_get_zone_status_command, (uint8_t*)cmd_struct);
} 


// Signature for MoveToHueAndSaturation command
static const sl_signature_t sig_color_control_cluster_move_to_hue_and_saturation_command = sl_zcl_color_control_cluster_move_to_hue_and_saturation_command_signature;
// Command parser for MoveToHueAndSaturation command
EmberAfStatus zcl_decode_color_control_cluster_move_to_hue_and_saturation_command (EmberAfClusterCommand * cmd, sl_zcl_color_control_cluster_move_to_hue_and_saturation_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_color_control_cluster_move_to_hue_and_saturation_command, (uint8_t*)cmd_struct);
} 


// Signature for GetGroupMembershipResponse command
static const sl_signature_t sig_groups_cluster_get_group_membership_response_command = sl_zcl_groups_cluster_get_group_membership_response_command_signature;
// Command parser for GetGroupMembershipResponse command
EmberAfStatus zcl_decode_groups_cluster_get_group_membership_response_command (EmberAfClusterCommand * cmd, sl_zcl_groups_cluster_get_group_membership_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_groups_cluster_get_group_membership_response_command, (uint8_t*)cmd_struct);
} 


// Signature for EnableWwahAppEventRetryAlgorithm command
static const sl_signature_t sig_sl_works_with_all_hubs_cluster_enable_wwah_app_event_retry_algorithm_command = sl_zcl_sl_works_with_all_hubs_cluster_enable_wwah_app_event_retry_algorithm_command_signature;
// Command parser for EnableWwahAppEventRetryAlgorithm command
EmberAfStatus zcl_decode_sl_works_with_all_hubs_cluster_enable_wwah_app_event_retry_algorithm_command (EmberAfClusterCommand * cmd, sl_zcl_sl_works_with_all_hubs_cluster_enable_wwah_app_event_retry_algorithm_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_sl_works_with_all_hubs_cluster_enable_wwah_app_event_retry_algorithm_command, (uint8_t*)cmd_struct);
} 


// Signature for GetHolidayScheduleResponse command
static const sl_signature_t sig_door_lock_cluster_get_holiday_schedule_response_command = sl_zcl_door_lock_cluster_get_holiday_schedule_response_command_signature;
// Command parser for GetHolidayScheduleResponse command
EmberAfStatus zcl_decode_door_lock_cluster_get_holiday_schedule_response_command (EmberAfClusterCommand * cmd, sl_zcl_door_lock_cluster_get_holiday_schedule_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_door_lock_cluster_get_holiday_schedule_response_command, (uint8_t*)cmd_struct);
} 


// Signature for PowerProfileNotification command
static const sl_signature_t sig_power_profile_cluster_power_profile_notification_command = sl_zcl_power_profile_cluster_power_profile_notification_command_signature;
// Command parser for PowerProfileNotification command
EmberAfStatus zcl_decode_power_profile_cluster_power_profile_notification_command (EmberAfClusterCommand * cmd, sl_zcl_power_profile_cluster_power_profile_notification_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_power_profile_cluster_power_profile_notification_command, (uint8_t*)cmd_struct);
} 


// Signature for PowerProfileResponse command
static const sl_signature_t sig_power_profile_cluster_power_profile_response_command = sl_zcl_power_profile_cluster_power_profile_response_command_signature;
// Command parser for PowerProfileResponse command
EmberAfStatus zcl_decode_power_profile_cluster_power_profile_response_command (EmberAfClusterCommand * cmd, sl_zcl_power_profile_cluster_power_profile_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_power_profile_cluster_power_profile_response_command, (uint8_t*)cmd_struct);
} 


// Signature for GetGroupIdentifiersResponse command
static const sl_signature_t sig_zll_commissioning_cluster_get_group_identifiers_response_command = sl_zcl_zll_commissioning_cluster_get_group_identifiers_response_command_signature;
// Command parser for GetGroupIdentifiersResponse command
EmberAfStatus zcl_decode_zll_commissioning_cluster_get_group_identifiers_response_command (EmberAfClusterCommand * cmd, sl_zcl_zll_commissioning_cluster_get_group_identifiers_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_zll_commissioning_cluster_get_group_identifiers_response_command, (uint8_t*)cmd_struct);
} 


// Signature for GetEndpointListResponse command
static const sl_signature_t sig_zll_commissioning_cluster_get_endpoint_list_response_command = sl_zcl_zll_commissioning_cluster_get_endpoint_list_response_command_signature;
// Command parser for GetEndpointListResponse command
EmberAfStatus zcl_decode_zll_commissioning_cluster_get_endpoint_list_response_command (EmberAfClusterCommand * cmd, sl_zcl_zll_commissioning_cluster_get_endpoint_list_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_zll_commissioning_cluster_get_endpoint_list_response_command, (uint8_t*)cmd_struct);
} 


// Signature for EnergyPhasesScheduleNotification command
static const sl_signature_t sig_power_profile_cluster_energy_phases_schedule_notification_command = sl_zcl_power_profile_cluster_energy_phases_schedule_notification_command_signature;
// Command parser for EnergyPhasesScheduleNotification command
EmberAfStatus zcl_decode_power_profile_cluster_energy_phases_schedule_notification_command (EmberAfClusterCommand * cmd, sl_zcl_power_profile_cluster_energy_phases_schedule_notification_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_power_profile_cluster_energy_phases_schedule_notification_command, (uint8_t*)cmd_struct);
} 


// Signature for EnergyPhasesScheduleResponse command
static const sl_signature_t sig_power_profile_cluster_energy_phases_schedule_response_command = sl_zcl_power_profile_cluster_energy_phases_schedule_response_command_signature;
// Command parser for EnergyPhasesScheduleResponse command
EmberAfStatus zcl_decode_power_profile_cluster_energy_phases_schedule_response_command (EmberAfClusterCommand * cmd, sl_zcl_power_profile_cluster_energy_phases_schedule_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_power_profile_cluster_energy_phases_schedule_response_command, (uint8_t*)cmd_struct);
} 


// Signature for EnergyPhasesScheduleStateResponse command
static const sl_signature_t sig_power_profile_cluster_energy_phases_schedule_state_response_command = sl_zcl_power_profile_cluster_energy_phases_schedule_state_response_command_signature;
// Command parser for EnergyPhasesScheduleStateResponse command
EmberAfStatus zcl_decode_power_profile_cluster_energy_phases_schedule_state_response_command (EmberAfClusterCommand * cmd, sl_zcl_power_profile_cluster_energy_phases_schedule_state_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_power_profile_cluster_energy_phases_schedule_state_response_command, (uint8_t*)cmd_struct);
} 


