stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for EnergyPhasesScheduleStateNotification command
static const sl_signature_t sig_power_profile_cluster_energy_phases_schedule_state_notification_command = sl_zcl_power_profile_cluster_energy_phases_schedule_state_notification_command_signature;
// Command parser for EnergyPhasesScheduleStateNotification command
EmberAfStatus zcl_decode_power_profile_cluster_energy_phases_schedule_state_notification_command (EmberAfClusterCommand * cmd, sl_zcl_power_profile_cluster_energy_phases_schedule_state_notification_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_power_profile_cluster_energy_phases_schedule_state_notification_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishTopUpLog command
static const sl_signature_t sig_prepayment_cluster_publish_top_up_log_command = sl_zcl_prepayment_cluster_publish_top_up_log_command_signature;
// Command parser for PublishTopUpLog command
EmberAfStatus zcl_decode_prepayment_cluster_publish_top_up_log_command (EmberAfClusterCommand * cmd, sl_zcl_prepayment_cluster_publish_top_up_log_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_prepayment_cluster_publish_top_up_log_command, (uint8_t*)cmd_struct);
} 


// Signature for PublishDebtLog command
static const sl_signature_t sig_prepayment_cluster_publish_debt_log_command = sl_zcl_prepayment_cluster_publish_debt_log_command_signature;
// Command parser for PublishDebtLog command
EmberAfStatus zcl_decode_prepayment_cluster_publish_debt_log_command (EmberAfClusterCommand * cmd, sl_zcl_prepayment_cluster_publish_debt_log_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_prepayment_cluster_publish_debt_log_command, (uint8_t*)cmd_struct);
} 


// Signature for ReportEventConfiguration command
static const sl_signature_t sig_device_management_cluster_report_event_configuration_command = sl_zcl_device_management_cluster_report_event_configuration_command_signature;
// Command parser for ReportEventConfiguration command
EmberAfStatus zcl_decode_device_management_cluster_report_event_configuration_command (EmberAfClusterCommand * cmd, sl_zcl_device_management_cluster_report_event_configuration_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_device_management_cluster_report_event_configuration_command, (uint8_t*)cmd_struct);
} 


// Signature for SetBypassedZoneList command
static const sl_signature_t sig_ias_ace_cluster_set_bypassed_zone_list_command = sl_zcl_ias_ace_cluster_set_bypassed_zone_list_command_signature;
// Command parser for SetBypassedZoneList command
EmberAfStatus zcl_decode_ias_ace_cluster_set_bypassed_zone_list_command (EmberAfClusterCommand * cmd, sl_zcl_ias_ace_cluster_set_bypassed_zone_list_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_ias_ace_cluster_set_bypassed_zone_list_command, (uint8_t*)cmd_struct);
} 


// Signature for RequestInformationResponse command
static const sl_signature_t sig_information_cluster_request_information_response_command = sl_zcl_information_cluster_request_information_response_command_signature;
// Command parser for RequestInformationResponse command
EmberAfStatus zcl_decode_information_cluster_request_information_response_command (EmberAfClusterCommand * cmd, sl_zcl_information_cluster_request_information_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_information_cluster_request_information_response_command, (uint8_t*)cmd_struct);
} 


// Signature for DebugReportQueryResponse command
static const sl_signature_t sig_sl_works_with_all_hubs_cluster_debug_report_query_response_command = sl_zcl_sl_works_with_all_hubs_cluster_debug_report_query_response_command_signature;
// Command parser for DebugReportQueryResponse command
EmberAfStatus zcl_decode_sl_works_with_all_hubs_cluster_debug_report_query_response_command (EmberAfClusterCommand * cmd, sl_zcl_sl_works_with_all_hubs_cluster_debug_report_query_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_sl_works_with_all_hubs_cluster_debug_report_query_response_command, (uint8_t*)cmd_struct);
} 


// Signature for PowerProfileStateResponse command
static const sl_signature_t sig_power_profile_cluster_power_profile_state_response_command = sl_zcl_power_profile_cluster_power_profile_state_response_command_signature;
// Command parser for PowerProfileStateResponse command
EmberAfStatus zcl_decode_power_profile_cluster_power_profile_state_response_command (EmberAfClusterCommand * cmd, sl_zcl_power_profile_cluster_power_profile_state_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_power_profile_cluster_power_profile_state_response_command, (uint8_t*)cmd_struct);
} 


// Signature for PowerProfilesStateNotification command
static const sl_signature_t sig_power_profile_cluster_power_profiles_state_notification_command = sl_zcl_power_profile_cluster_power_profiles_state_notification_command_signature;
// Command parser for PowerProfilesStateNotification command
EmberAfStatus zcl_decode_power_profile_cluster_power_profiles_state_notification_command (EmberAfClusterCommand * cmd, sl_zcl_power_profile_cluster_power_profiles_state_notification_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_power_profile_cluster_power_profiles_state_notification_command, (uint8_t*)cmd_struct);
} 


// Signature for RequestFastPollModeResponse command
static const sl_signature_t sig_simple_metering_cluster_request_fast_poll_mode_response_command = sl_zcl_simple_metering_cluster_request_fast_poll_mode_response_command_signature;
// Command parser for RequestFastPollModeResponse command
EmberAfStatus zcl_decode_simple_metering_cluster_request_fast_poll_mode_response_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_request_fast_poll_mode_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_request_fast_poll_mode_response_command, (uint8_t*)cmd_struct);
} 


// Signature for GpTranslationTableRequest command
static const sl_signature_t sig_green_power_cluster_gp_translation_table_request_command = sl_zcl_green_power_cluster_gp_translation_table_request_command_signature;
// Command parser for GpTranslationTableRequest command
EmberAfStatus zcl_decode_green_power_cluster_gp_translation_table_request_command (EmberAfClusterCommand * cmd, sl_zcl_green_power_cluster_gp_translation_table_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_green_power_cluster_gp_translation_table_request_command, (uint8_t*)cmd_struct);
} 


// Signature for PushInformation command
static const sl_signature_t sig_information_cluster_push_information_command = sl_zcl_information_cluster_push_information_command_signature;
// Command parser for PushInformation command
EmberAfStatus zcl_decode_information_cluster_push_information_command (EmberAfClusterCommand * cmd, sl_zcl_information_cluster_push_information_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_information_cluster_push_information_command, (uint8_t*)cmd_struct);
} 


// Signature for VoiceTransmission command
static const sl_signature_t sig_voice_over_zig_bee_cluster_voice_transmission_command = sl_zcl_voice_over_zig_bee_cluster_voice_transmission_command_signature;
// Command parser for VoiceTransmission command
EmberAfStatus zcl_decode_voice_over_zig_bee_cluster_voice_transmission_command (EmberAfClusterCommand * cmd, sl_zcl_voice_over_zig_bee_cluster_voice_transmission_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_voice_over_zig_bee_cluster_voice_transmission_command, (uint8_t*)cmd_struct);
} 


