stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for MatchProtocolAddress command
static const sl_signature_t sig_generic_tunnel_cluster_match_protocol_address_command = sl_zcl_generic_tunnel_cluster_match_protocol_address_command_signature;
// Command parser for MatchProtocolAddress command
EmberAfStatus zcl_decode_generic_tunnel_cluster_match_protocol_address_command (EmberAfClusterCommand * cmd, sl_zcl_generic_tunnel_cluster_match_protocol_address_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_generic_tunnel_cluster_match_protocol_address_command, (uint8_t*)cmd_struct);
} 


// Signature for AdvertiseProtocolAddress command
static const sl_signature_t sig_generic_tunnel_cluster_advertise_protocol_address_command = sl_zcl_generic_tunnel_cluster_advertise_protocol_address_command_signature;
// Command parser for AdvertiseProtocolAddress command
EmberAfStatus zcl_decode_generic_tunnel_cluster_advertise_protocol_address_command (EmberAfClusterCommand * cmd, sl_zcl_generic_tunnel_cluster_advertise_protocol_address_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_generic_tunnel_cluster_advertise_protocol_address_command, (uint8_t*)cmd_struct);
} 


// Signature for TransferAPDU command
static const sl_signature_t sig_11073_protocol_tunnel_cluster_transfer_apdu_command = sl_zcl_11073_protocol_tunnel_cluster_transfer_apdu_command_signature;
// Command parser for TransferAPDU command
EmberAfStatus zcl_decode_11073_protocol_tunnel_cluster_transfer_apdu_command (EmberAfClusterCommand * cmd, sl_zcl_11073_protocol_tunnel_cluster_transfer_apdu_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_11073_protocol_tunnel_cluster_transfer_apdu_command, (uint8_t*)cmd_struct);
} 


// Signature for TransferApdu command
static const sl_signature_t sig_iso_7816_protocol_tunnel_cluster_transfer_apdu_command = sl_zcl_iso_7816_protocol_tunnel_cluster_transfer_apdu_command_signature;
// Command parser for TransferApdu command
EmberAfStatus zcl_decode_iso_7816_protocol_tunnel_cluster_transfer_apdu_command (EmberAfClusterCommand * cmd, sl_zcl_iso_7816_protocol_tunnel_cluster_transfer_apdu_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_iso_7816_protocol_tunnel_cluster_transfer_apdu_command, (uint8_t*)cmd_struct);
} 


// Signature for UnlockTokens command
static const sl_signature_t sig_configuration_cluster_cluster_unlock_tokens_command = sl_zcl_configuration_cluster_cluster_unlock_tokens_command_signature;
// Command parser for UnlockTokens command
EmberAfStatus zcl_decode_configuration_cluster_cluster_unlock_tokens_command (EmberAfClusterCommand * cmd, sl_zcl_configuration_cluster_cluster_unlock_tokens_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_configuration_cluster_cluster_unlock_tokens_command, (uint8_t*)cmd_struct);
} 


// Signature for TransactionEnd command
static const sl_signature_t sig_payment_cluster_transaction_end_command = sl_zcl_payment_cluster_transaction_end_command_signature;
// Command parser for TransactionEnd command
EmberAfStatus zcl_decode_payment_cluster_transaction_end_command (EmberAfClusterCommand * cmd, sl_zcl_payment_cluster_transaction_end_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_payment_cluster_transaction_end_command, (uint8_t*)cmd_struct);
} 


// Signature for BillStatusNotification command
static const sl_signature_t sig_billing_cluster_bill_status_notification_command = sl_zcl_billing_cluster_bill_status_notification_command_signature;
// Command parser for BillStatusNotification command
EmberAfStatus zcl_decode_billing_cluster_bill_status_notification_command (EmberAfClusterCommand * cmd, sl_zcl_billing_cluster_bill_status_notification_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_billing_cluster_bill_status_notification_command, (uint8_t*)cmd_struct);
} 


// Signature for PaymentConfirm command
static const sl_signature_t sig_payment_cluster_payment_confirm_command = sl_zcl_payment_cluster_payment_confirm_command_signature;
// Command parser for PaymentConfirm command
EmberAfStatus zcl_decode_payment_cluster_payment_confirm_command (EmberAfClusterCommand * cmd, sl_zcl_payment_cluster_payment_confirm_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_payment_cluster_payment_confirm_command, (uint8_t*)cmd_struct);
} 


// Signature for Subscribe command
static const sl_signature_t sig_billing_cluster_subscribe_command = sl_zcl_billing_cluster_subscribe_command_signature;
// Command parser for Subscribe command
EmberAfStatus zcl_decode_billing_cluster_subscribe_command (EmberAfClusterCommand * cmd, sl_zcl_billing_cluster_subscribe_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_billing_cluster_subscribe_command, (uint8_t*)cmd_struct);
} 


// Signature for Unsubscribe command
static const sl_signature_t sig_billing_cluster_unsubscribe_command = sl_zcl_billing_cluster_unsubscribe_command_signature;
// Command parser for Unsubscribe command
EmberAfStatus zcl_decode_billing_cluster_unsubscribe_command (EmberAfClusterCommand * cmd, sl_zcl_billing_cluster_unsubscribe_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_billing_cluster_unsubscribe_command, (uint8_t*)cmd_struct);
} 


// Signature for StartBillingSession command
static const sl_signature_t sig_billing_cluster_start_billing_session_command = sl_zcl_billing_cluster_start_billing_session_command_signature;
// Command parser for StartBillingSession command
EmberAfStatus zcl_decode_billing_cluster_start_billing_session_command (EmberAfClusterCommand * cmd, sl_zcl_billing_cluster_start_billing_session_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_billing_cluster_start_billing_session_command, (uint8_t*)cmd_struct);
} 


