stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for StopBillingSession command
static const sl_signature_t sig_billing_cluster_stop_billing_session_command = sl_zcl_billing_cluster_stop_billing_session_command_signature;
// Command parser for StopBillingSession command
EmberAfStatus zcl_decode_billing_cluster_stop_billing_session_command (EmberAfClusterCommand * cmd, sl_zcl_billing_cluster_stop_billing_session_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_billing_cluster_stop_billing_session_command, (uint8_t*)cmd_struct);
} 


// Signature for SessionKeepAlive command
static const sl_signature_t sig_billing_cluster_session_keep_alive_command = sl_zcl_billing_cluster_session_keep_alive_command_signature;
// Command parser for SessionKeepAlive command
EmberAfStatus zcl_decode_billing_cluster_session_keep_alive_command (EmberAfClusterCommand * cmd, sl_zcl_billing_cluster_session_keep_alive_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_billing_cluster_session_keep_alive_command, (uint8_t*)cmd_struct);
} 


// Signature for CheckBillStatus command
static const sl_signature_t sig_billing_cluster_check_bill_status_command = sl_zcl_billing_cluster_check_bill_status_command_signature;
// Command parser for CheckBillStatus command
EmberAfStatus zcl_decode_billing_cluster_check_bill_status_command (EmberAfClusterCommand * cmd, sl_zcl_billing_cluster_check_bill_status_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_billing_cluster_check_bill_status_command, (uint8_t*)cmd_struct);
} 


// Signature for BuyRequest command
static const sl_signature_t sig_payment_cluster_buy_request_command = sl_zcl_payment_cluster_buy_request_command_signature;
// Command parser for BuyRequest command
EmberAfStatus zcl_decode_payment_cluster_buy_request_command (EmberAfClusterCommand * cmd, sl_zcl_payment_cluster_buy_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_payment_cluster_buy_request_command, (uint8_t*)cmd_struct);
} 


// Signature for AcceptPayment command
static const sl_signature_t sig_payment_cluster_accept_payment_command = sl_zcl_payment_cluster_accept_payment_command_signature;
// Command parser for AcceptPayment command
EmberAfStatus zcl_decode_payment_cluster_accept_payment_command (EmberAfClusterCommand * cmd, sl_zcl_payment_cluster_accept_payment_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_payment_cluster_accept_payment_command, (uint8_t*)cmd_struct);
} 


// Signature for SendBillRecord command
static const sl_signature_t sig_billing_cluster_send_bill_record_command = sl_zcl_billing_cluster_send_bill_record_command_signature;
// Command parser for SendBillRecord command
EmberAfStatus zcl_decode_billing_cluster_send_bill_record_command (EmberAfClusterCommand * cmd, sl_zcl_billing_cluster_send_bill_record_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_billing_cluster_send_bill_record_command, (uint8_t*)cmd_struct);
} 


// Signature for ReceiptDelivery command
static const sl_signature_t sig_payment_cluster_receipt_delivery_command = sl_zcl_payment_cluster_receipt_delivery_command_signature;
// Command parser for ReceiptDelivery command
EmberAfStatus zcl_decode_payment_cluster_receipt_delivery_command (EmberAfClusterCommand * cmd, sl_zcl_payment_cluster_receipt_delivery_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_payment_cluster_receipt_delivery_command, (uint8_t*)cmd_struct);
} 


// Signature for BuyConfirm command
static const sl_signature_t sig_payment_cluster_buy_confirm_command = sl_zcl_payment_cluster_buy_confirm_command_signature;
// Command parser for BuyConfirm command
EmberAfStatus zcl_decode_payment_cluster_buy_confirm_command (EmberAfClusterCommand * cmd, sl_zcl_payment_cluster_buy_confirm_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_payment_cluster_buy_confirm_command, (uint8_t*)cmd_struct);
} 


// Signature for ScanNetworks command
static const sl_signature_t sig_network_provisioning_cluster_scan_networks_command = sl_zcl_network_provisioning_cluster_scan_networks_command_signature;
// Command parser for ScanNetworks command
EmberAfStatus zcl_decode_network_provisioning_cluster_scan_networks_command (EmberAfClusterCommand * cmd, sl_zcl_network_provisioning_cluster_scan_networks_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_network_provisioning_cluster_scan_networks_command, (uint8_t*)cmd_struct);
} 


// Signature for AddThreadNetwork command
static const sl_signature_t sig_network_provisioning_cluster_add_thread_network_command = sl_zcl_network_provisioning_cluster_add_thread_network_command_signature;
// Command parser for AddThreadNetwork command
EmberAfStatus zcl_decode_network_provisioning_cluster_add_thread_network_command (EmberAfClusterCommand * cmd, sl_zcl_network_provisioning_cluster_add_thread_network_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_network_provisioning_cluster_add_thread_network_command, (uint8_t*)cmd_struct);
} 


// Signature for UpdateThreadNetwork command
static const sl_signature_t sig_network_provisioning_cluster_update_thread_network_command = sl_zcl_network_provisioning_cluster_update_thread_network_command_signature;
// Command parser for UpdateThreadNetwork command
EmberAfStatus zcl_decode_network_provisioning_cluster_update_thread_network_command (EmberAfClusterCommand * cmd, sl_zcl_network_provisioning_cluster_update_thread_network_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_network_provisioning_cluster_update_thread_network_command, (uint8_t*)cmd_struct);
} 


// Signature for RemoveNetwork command
static const sl_signature_t sig_network_provisioning_cluster_remove_network_command = sl_zcl_network_provisioning_cluster_remove_network_command_signature;
// Command parser for RemoveNetwork command
EmberAfStatus zcl_decode_network_provisioning_cluster_remove_network_command (EmberAfClusterCommand * cmd, sl_zcl_network_provisioning_cluster_remove_network_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_network_provisioning_cluster_remove_network_command, (uint8_t*)cmd_struct);
} 


// Signature for EnableNetwork command
static const sl_signature_t sig_network_provisioning_cluster_enable_network_command = sl_zcl_network_provisioning_cluster_enable_network_command_signature;
// Command parser for EnableNetwork command
EmberAfStatus zcl_decode_network_provisioning_cluster_enable_network_command (EmberAfClusterCommand * cmd, sl_zcl_network_provisioning_cluster_enable_network_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_network_provisioning_cluster_enable_network_command, (uint8_t*)cmd_struct);
} 


