stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for DisableNetwork command
static const sl_signature_t sig_network_provisioning_cluster_disable_network_command = sl_zcl_network_provisioning_cluster_disable_network_command_signature;
// Command parser for DisableNetwork command
EmberAfStatus zcl_decode_network_provisioning_cluster_disable_network_command (EmberAfClusterCommand * cmd, sl_zcl_network_provisioning_cluster_disable_network_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_network_provisioning_cluster_disable_network_command, (uint8_t*)cmd_struct);
} 


// Signature for TestNetwork command
static const sl_signature_t sig_network_provisioning_cluster_test_network_command = sl_zcl_network_provisioning_cluster_test_network_command_signature;
// Command parser for TestNetwork command
EmberAfStatus zcl_decode_network_provisioning_cluster_test_network_command (EmberAfClusterCommand * cmd, sl_zcl_network_provisioning_cluster_test_network_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_network_provisioning_cluster_test_network_command, (uint8_t*)cmd_struct);
} 


// Signature for AddWiFiNetwork command
static const sl_signature_t sig_network_provisioning_cluster_add_wi_fi_network_command = sl_zcl_network_provisioning_cluster_add_wi_fi_network_command_signature;
// Command parser for AddWiFiNetwork command
EmberAfStatus zcl_decode_network_provisioning_cluster_add_wi_fi_network_command (EmberAfClusterCommand * cmd, sl_zcl_network_provisioning_cluster_add_wi_fi_network_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_network_provisioning_cluster_add_wi_fi_network_command, (uint8_t*)cmd_struct);
} 


// Signature for UpdateWiFiNetwork command
static const sl_signature_t sig_network_provisioning_cluster_update_wi_fi_network_command = sl_zcl_network_provisioning_cluster_update_wi_fi_network_command_signature;
// Command parser for UpdateWiFiNetwork command
EmberAfStatus zcl_decode_network_provisioning_cluster_update_wi_fi_network_command (EmberAfClusterCommand * cmd, sl_zcl_network_provisioning_cluster_update_wi_fi_network_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_network_provisioning_cluster_update_wi_fi_network_command, (uint8_t*)cmd_struct);
} 


// Signature for EphemeralDataRequest command
static const sl_signature_t sig_key_establishment_cluster_ephemeral_data_request_command = sl_zcl_key_establishment_cluster_ephemeral_data_request_command_signature;
// Command parser for EphemeralDataRequest command
EmberAfStatus zcl_decode_key_establishment_cluster_ephemeral_data_request_command (EmberAfClusterCommand * cmd, sl_zcl_key_establishment_cluster_ephemeral_data_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_key_establishment_cluster_ephemeral_data_request_command, (uint8_t*)cmd_struct);
} 


// Signature for ConfirmKeyDataRequest command
static const sl_signature_t sig_key_establishment_cluster_confirm_key_data_request_command = sl_zcl_key_establishment_cluster_confirm_key_data_request_command_signature;
// Command parser for ConfirmKeyDataRequest command
EmberAfStatus zcl_decode_key_establishment_cluster_confirm_key_data_request_command (EmberAfClusterCommand * cmd, sl_zcl_key_establishment_cluster_confirm_key_data_request_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_key_establishment_cluster_confirm_key_data_request_command, (uint8_t*)cmd_struct);
} 


// Signature for EphemeralDataResponse command
static const sl_signature_t sig_key_establishment_cluster_ephemeral_data_response_command = sl_zcl_key_establishment_cluster_ephemeral_data_response_command_signature;
// Command parser for EphemeralDataResponse command
EmberAfStatus zcl_decode_key_establishment_cluster_ephemeral_data_response_command (EmberAfClusterCommand * cmd, sl_zcl_key_establishment_cluster_ephemeral_data_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_key_establishment_cluster_ephemeral_data_response_command, (uint8_t*)cmd_struct);
} 


// Signature for ConfirmKeyDataResponse command
static const sl_signature_t sig_key_establishment_cluster_confirm_key_data_response_command = sl_zcl_key_establishment_cluster_confirm_key_data_response_command_signature;
// Command parser for ConfirmKeyDataResponse command
EmberAfStatus zcl_decode_key_establishment_cluster_confirm_key_data_response_command (EmberAfClusterCommand * cmd, sl_zcl_key_establishment_cluster_confirm_key_data_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_key_establishment_cluster_confirm_key_data_response_command, (uint8_t*)cmd_struct);
} 


// Signature for PushInformationResponse command
static const sl_signature_t sig_information_cluster_push_information_response_command = sl_zcl_information_cluster_push_information_response_command_signature;
// Command parser for PushInformationResponse command
EmberAfStatus zcl_decode_information_cluster_push_information_response_command (EmberAfClusterCommand * cmd, sl_zcl_information_cluster_push_information_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_information_cluster_push_information_response_command, (uint8_t*)cmd_struct);
} 


// Signature for UpdateResponse command
static const sl_signature_t sig_information_cluster_update_response_command = sl_zcl_information_cluster_update_response_command_signature;
// Command parser for UpdateResponse command
EmberAfStatus zcl_decode_information_cluster_update_response_command (EmberAfClusterCommand * cmd, sl_zcl_information_cluster_update_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_information_cluster_update_response_command, (uint8_t*)cmd_struct);
} 


// Signature for DeleteResponse command
static const sl_signature_t sig_information_cluster_delete_response_command = sl_zcl_information_cluster_delete_response_command_signature;
// Command parser for DeleteResponse command
EmberAfStatus zcl_decode_information_cluster_delete_response_command (EmberAfClusterCommand * cmd, sl_zcl_information_cluster_delete_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_information_cluster_delete_response_command, (uint8_t*)cmd_struct);
} 


// Signature for LogNotification command
static const sl_signature_t sig_appliance_statistics_cluster_log_notification_command = sl_zcl_appliance_statistics_cluster_log_notification_command_signature;
// Command parser for LogNotification command
EmberAfStatus zcl_decode_appliance_statistics_cluster_log_notification_command (EmberAfClusterCommand * cmd, sl_zcl_appliance_statistics_cluster_log_notification_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_appliance_statistics_cluster_log_notification_command, (uint8_t*)cmd_struct);
} 


