stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for LogResponse command
static const sl_signature_t sig_appliance_statistics_cluster_log_response_command = sl_zcl_appliance_statistics_cluster_log_response_command_signature;
// Command parser for LogResponse command
EmberAfStatus zcl_decode_appliance_statistics_cluster_log_response_command (EmberAfClusterCommand * cmd, sl_zcl_appliance_statistics_cluster_log_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_appliance_statistics_cluster_log_response_command, (uint8_t*)cmd_struct);
} 


// Signature for GetMessageCancellation command
static const sl_signature_t sig_messaging_cluster_get_message_cancellation_command = sl_zcl_messaging_cluster_get_message_cancellation_command_signature;
// Command parser for GetMessageCancellation command
EmberAfStatus zcl_decode_messaging_cluster_get_message_cancellation_command (EmberAfClusterCommand * cmd, sl_zcl_messaging_cluster_get_message_cancellation_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_messaging_cluster_get_message_cancellation_command, (uint8_t*)cmd_struct);
} 


// Signature for CancelAllMessages command
static const sl_signature_t sig_messaging_cluster_cancel_all_messages_command = sl_zcl_messaging_cluster_cancel_all_messages_command_signature;
// Command parser for CancelAllMessages command
EmberAfStatus zcl_decode_messaging_cluster_cancel_all_messages_command (EmberAfClusterCommand * cmd, sl_zcl_messaging_cluster_cancel_all_messages_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_messaging_cluster_cancel_all_messages_command, (uint8_t*)cmd_struct);
} 


// Signature for SelectAvailableEmergencyCredit command
static const sl_signature_t sig_prepayment_cluster_select_available_emergency_credit_command = sl_zcl_prepayment_cluster_select_available_emergency_credit_command_signature;
// Command parser for SelectAvailableEmergencyCredit command
EmberAfStatus zcl_decode_prepayment_cluster_select_available_emergency_credit_command (EmberAfClusterCommand * cmd, sl_zcl_prepayment_cluster_select_available_emergency_credit_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_prepayment_cluster_select_available_emergency_credit_command, (uint8_t*)cmd_struct);
} 


// Signature for GetProfileResponse command
static const sl_signature_t sig_simple_metering_cluster_get_profile_response_command = sl_zcl_simple_metering_cluster_get_profile_response_command_signature;
// Command parser for GetProfileResponse command
EmberAfStatus zcl_decode_simple_metering_cluster_get_profile_response_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_get_profile_response_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_get_profile_response_command, (uint8_t*)cmd_struct);
} 


// Signature for GetConversionFactor command
static const sl_signature_t sig_price_cluster_get_conversion_factor_command = sl_zcl_price_cluster_get_conversion_factor_command_signature;
// Command parser for GetConversionFactor command
EmberAfStatus zcl_decode_price_cluster_get_conversion_factor_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_get_conversion_factor_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_get_conversion_factor_command, (uint8_t*)cmd_struct);
} 


// Signature for GetCalorificValue command
static const sl_signature_t sig_price_cluster_get_calorific_value_command = sl_zcl_price_cluster_get_calorific_value_command_signature;
// Command parser for GetCalorificValue command
EmberAfStatus zcl_decode_price_cluster_get_calorific_value_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_get_calorific_value_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_get_calorific_value_command, (uint8_t*)cmd_struct);
} 


// Signature for GetTariffInformation command
static const sl_signature_t sig_price_cluster_get_tariff_information_command = sl_zcl_price_cluster_get_tariff_information_command_signature;
// Command parser for GetTariffInformation command
EmberAfStatus zcl_decode_price_cluster_get_tariff_information_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_get_tariff_information_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_get_tariff_information_command, (uint8_t*)cmd_struct);
} 


// Signature for GetCO2Value command
static const sl_signature_t sig_price_cluster_get_co2_value_command = sl_zcl_price_cluster_get_co2_value_command_signature;
// Command parser for GetCO2Value command
EmberAfStatus zcl_decode_price_cluster_get_co2_value_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_get_co2_value_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_get_co2_value_command, (uint8_t*)cmd_struct);
} 


// Signature for GetBillingPeriod command
static const sl_signature_t sig_price_cluster_get_billing_period_command = sl_zcl_price_cluster_get_billing_period_command_signature;
// Command parser for GetBillingPeriod command
EmberAfStatus zcl_decode_price_cluster_get_billing_period_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_get_billing_period_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_get_billing_period_command, (uint8_t*)cmd_struct);
} 


// Signature for GetConsolidatedBill command
static const sl_signature_t sig_price_cluster_get_consolidated_bill_command = sl_zcl_price_cluster_get_consolidated_bill_command_signature;
// Command parser for GetConsolidatedBill command
EmberAfStatus zcl_decode_price_cluster_get_consolidated_bill_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_get_consolidated_bill_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_get_consolidated_bill_command, (uint8_t*)cmd_struct);
} 


// Signature for GetCalendar command
static const sl_signature_t sig_calendar_cluster_get_calendar_command = sl_zcl_calendar_cluster_get_calendar_command_signature;
// Command parser for GetCalendar command
EmberAfStatus zcl_decode_calendar_cluster_get_calendar_command (EmberAfClusterCommand * cmd, sl_zcl_calendar_cluster_get_calendar_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_calendar_cluster_get_calendar_command, (uint8_t*)cmd_struct);
} 


// Signature for GetScheduledPrices command
static const sl_signature_t sig_price_cluster_get_scheduled_prices_command = sl_zcl_price_cluster_get_scheduled_prices_command_signature;
// Command parser for GetScheduledPrices command
EmberAfStatus zcl_decode_price_cluster_get_scheduled_prices_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_get_scheduled_prices_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_get_scheduled_prices_command, (uint8_t*)cmd_struct);
} 


// Signature for GetCreditPayment command
static const sl_signature_t sig_price_cluster_get_credit_payment_command = sl_zcl_price_cluster_get_credit_payment_command_signature;
// Command parser for GetCreditPayment command
EmberAfStatus zcl_decode_price_cluster_get_credit_payment_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_get_credit_payment_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_get_credit_payment_command, (uint8_t*)cmd_struct);
} 


// Signature for GetTopUpLog command
static const sl_signature_t sig_prepayment_cluster_get_top_up_log_command = sl_zcl_prepayment_cluster_get_top_up_log_command_signature;
// Command parser for GetTopUpLog command
EmberAfStatus zcl_decode_prepayment_cluster_get_top_up_log_command (EmberAfClusterCommand * cmd, sl_zcl_prepayment_cluster_get_top_up_log_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_prepayment_cluster_get_top_up_log_command, (uint8_t*)cmd_struct);
} 


// Signature for GetBlockPeriods command
static const sl_signature_t sig_price_cluster_get_block_periods_command = sl_zcl_price_cluster_get_block_periods_command_signature;
// Command parser for GetBlockPeriods command
EmberAfStatus zcl_decode_price_cluster_get_block_periods_command (EmberAfClusterCommand * cmd, sl_zcl_price_cluster_get_block_periods_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_price_cluster_get_block_periods_command, (uint8_t*)cmd_struct);
} 


// Signature for GetDebtRepaymentLog command
static const sl_signature_t sig_prepayment_cluster_get_debt_repayment_log_command = sl_zcl_prepayment_cluster_get_debt_repayment_log_command_signature;
// Command parser for GetDebtRepaymentLog command
EmberAfStatus zcl_decode_prepayment_cluster_get_debt_repayment_log_command (EmberAfClusterCommand * cmd, sl_zcl_prepayment_cluster_get_debt_repayment_log_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_prepayment_cluster_get_debt_repayment_log_command, (uint8_t*)cmd_struct);
} 


// Signature for GetSpecialDays command
static const sl_signature_t sig_calendar_cluster_get_special_days_command = sl_zcl_calendar_cluster_get_special_days_command_signature;
// Command parser for GetSpecialDays command
EmberAfStatus zcl_decode_calendar_cluster_get_special_days_command (EmberAfClusterCommand * cmd, sl_zcl_calendar_cluster_get_special_days_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_calendar_cluster_get_special_days_command, (uint8_t*)cmd_struct);
} 


