stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Signature for GetScheduledEvents command
static const sl_signature_t sig_demand_response_and_load_control_cluster_get_scheduled_events_command = sl_zcl_demand_response_and_load_control_cluster_get_scheduled_events_command_signature;
// Command parser for GetScheduledEvents command
EmberAfStatus zcl_decode_demand_response_and_load_control_cluster_get_scheduled_events_command (EmberAfClusterCommand * cmd, sl_zcl_demand_response_and_load_control_cluster_get_scheduled_events_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_demand_response_and_load_control_cluster_get_scheduled_events_command, (uint8_t*)cmd_struct);
} 


// Signature for GetSnapshot command
static const sl_signature_t sig_simple_metering_cluster_get_snapshot_command = sl_zcl_simple_metering_cluster_get_snapshot_command_signature;
// Command parser for GetSnapshot command
EmberAfStatus zcl_decode_simple_metering_cluster_get_snapshot_command (EmberAfClusterCommand * cmd, sl_zcl_simple_metering_cluster_get_snapshot_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_simple_metering_cluster_get_snapshot_command, (uint8_t*)cmd_struct);
} 


// Signature for GetPrepaySnapshot command
static const sl_signature_t sig_prepayment_cluster_get_prepay_snapshot_command = sl_zcl_prepayment_cluster_get_prepay_snapshot_command_signature;
// Command parser for GetPrepaySnapshot command
EmberAfStatus zcl_decode_prepayment_cluster_get_prepay_snapshot_command (EmberAfClusterCommand * cmd, sl_zcl_prepayment_cluster_get_prepay_snapshot_command_t *cmd_struct) {
  // Use signature-decoding mechanism to parse this command.
  return sli_do_decode(cmd, sig_prepayment_cluster_get_prepay_snapshot_command, (uint8_t*)cmd_struct);
} 


// Command parser for GpPairingSearch command
EmberAfStatus zcl_decode_green_power_cluster_gp_pairing_search_command (EmberAfClusterCommand * cmd, sl_zcl_green_power_cluster_gp_pairing_search_command_t *cmd_struct) {
  // Use classic mechanism to parse this command.
  uint16_t payloadOffset = cmd->payloadStartIndex;
  // Not a fixed length command
            

  // - Argument is not present in all versions.
  if (cmd->bufLen < payloadOffset + 
2u)
  { 
    cmd_struct->options = 0xFFFF;
  } else {

        cmd_struct->options = sli_decode_parse_two_bytes(cmd, payloadOffset);


        payloadOffset+= 2u;
      }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0007) == 0x0000
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
4u ||
 !((cmd_struct->options & 0x0007) == 0x0000)) 
    { 
      cmd_struct->gpdSrcId = 0xFFFFFFFF;
    } 
    else 
    {
        cmd_struct->gpdSrcId = sli_decode_parse_four_bytes(cmd, payloadOffset);


        payloadOffset+= 4u;
    }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0007) == 0x0002
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
8u ||
 !((cmd_struct->options & 0x0007) == 0x0002)) 
    { 
        memset(cmd_struct->gpdIeee, 0, 8);
    } 
    else 
    {
        memcpy(cmd_struct->gpdIeee, sli_decode_bytes(cmd, payloadOffset), 8);


        payloadOffset+= 8u;
    }
            


      // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0007) == 0x0002
      if (!((cmd_struct->options & 0x0007) == 0x0002)) { 
        cmd_struct->endpoint = 0xFF;
      } else {
        cmd_struct->endpoint = sli_decode_parse_one_byte(cmd, payloadOffset);


  }
  return EMBER_ZCL_STATUS_SUCCESS;
} 


// Command parser for GpNotification command
EmberAfStatus zcl_decode_green_power_cluster_gp_notification_command (EmberAfClusterCommand * cmd, sl_zcl_green_power_cluster_gp_notification_command_t *cmd_struct) {
  // Use classic mechanism to parse this command.
  uint16_t payloadOffset = cmd->payloadStartIndex;
  // Not a fixed length command
            

  // - Argument is not present in all versions.
  if (cmd->bufLen < payloadOffset + 
2u)
  { 
    cmd_struct->options = 0xFFFF;
  } else {

        cmd_struct->options = sli_decode_parse_two_bytes(cmd, payloadOffset);


        payloadOffset+= 2u;
      }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0007) == 0x0000
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
4u ||
 !((cmd_struct->options & 0x0007) == 0x0000)) 
    { 
      cmd_struct->gpdSrcId = 0xFFFFFFFF;
    } 
    else 
    {
        cmd_struct->gpdSrcId = sli_decode_parse_four_bytes(cmd, payloadOffset);


        payloadOffset+= 4u;
    }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0007) == 0x0002
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
8u ||
 !((cmd_struct->options & 0x0007) == 0x0002)) 
    { 
        memset(cmd_struct->gpdIeee, 0, 8);
    } 
    else 
    {
        memcpy(cmd_struct->gpdIeee, sli_decode_bytes(cmd, payloadOffset), 8);


        payloadOffset+= 8u;
    }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0007) == 0x0002
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
1u ||
 !((cmd_struct->options & 0x0007) == 0x0002)) 
    { 
      cmd_struct->gpdEndpoint = 0xFF;
    } 
    else 
    {
        cmd_struct->gpdEndpoint = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
    }
            

  // - Argument is not present in all versions.
  if (cmd->bufLen < payloadOffset + 
4u)
  { 
    cmd_struct->gpdSecurityFrameCounter = 0xFFFFFFFF;
  } else {

        cmd_struct->gpdSecurityFrameCounter = sli_decode_parse_four_bytes(cmd, payloadOffset);


        payloadOffset+= 4u;
      }
            

  // - Argument is not present in all versions.
  if (cmd->bufLen < payloadOffset + 
1u)
  { 
    cmd_struct->gpdCommandId = 0xFF;
  } else {

        cmd_struct->gpdCommandId = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
      }
            

  // - Argument is not present in all versions.
  if (cmd->bufLen < payloadOffset + emberAfStringLength(cmd->buffer + payloadOffset) + 1u)
  { 
    cmd_struct->gpdCommandPayload = NULL;
  } else {

        cmd_struct->gpdCommandPayload = sli_decode_string(cmd, payloadOffset);


        payloadOffset+= emberAfStringLength(cmd->buffer + payloadOffset) + 1u;
      }
            


