stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x4000) || (cmd_struct->options & 0x0800)
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
2u ||
 !((cmd_struct->options & 0x4000) || (cmd_struct->options & 0x0800))) 
    { 
      cmd_struct->gppShortAddress = 0xFFFF;
    } 
    else 
    {
        cmd_struct->gppShortAddress = sli_decode_parse_two_bytes(cmd, payloadOffset);


        payloadOffset+= 2u;
    }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x4000) || (cmd_struct->options & 0x0800)
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
1u ||
 !((cmd_struct->options & 0x4000) || (cmd_struct->options & 0x0800))) 
    { 
      cmd_struct->gppDistance = 0xFF;
    } 
    else 
    {
        cmd_struct->gppDistance = sli_decode_parse_one_byte(cmd, payloadOffset);


    }
  return EMBER_ZCL_STATUS_SUCCESS;
} 


// Command parser for GpCommissioningNotification command
EmberAfStatus zcl_decode_green_power_cluster_gp_commissioning_notification_command (EmberAfClusterCommand * cmd, sl_zcl_green_power_cluster_gp_commissioning_notification_command_t *cmd_struct) {
  // Use classic mechanism to parse this command.
  uint16_t payloadOffset = cmd->payloadStartIndex;
  // Not a fixed length command
            

  // - Argument is not present in all versions.
  if (cmd->bufLen < payloadOffset + 
2u)
  { 
    cmd_struct->options = 0xFFFF;
  } else {

        cmd_struct->options = sli_decode_parse_two_bytes(cmd, payloadOffset);


        payloadOffset+= 2u;
      }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0007) == 0x0000
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
4u ||
 !((cmd_struct->options & 0x0007) == 0x0000)) 
    { 
      cmd_struct->gpdSrcId = 0xFFFFFFFF;
    } 
    else 
    {
        cmd_struct->gpdSrcId = sli_decode_parse_four_bytes(cmd, payloadOffset);


        payloadOffset+= 4u;
    }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0007) == 0x0002
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
8u ||
 !((cmd_struct->options & 0x0007) == 0x0002)) 
    { 
        memset(cmd_struct->gpdIeee, 0, 8);
    } 
    else 
    {
        memcpy(cmd_struct->gpdIeee, sli_decode_bytes(cmd, payloadOffset), 8);


        payloadOffset+= 8u;
    }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0007) == 0x0002
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
1u ||
 !((cmd_struct->options & 0x0007) == 0x0002)) 
    { 
      cmd_struct->endpoint = 0xFF;
    } 
    else 
    {
        cmd_struct->endpoint = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
    }
            

  // - Argument is not present in all versions.
  if (cmd->bufLen < payloadOffset + 
4u)
  { 
    cmd_struct->gpdSecurityFrameCounter = 0xFFFFFFFF;
  } else {

        cmd_struct->gpdSecurityFrameCounter = sli_decode_parse_four_bytes(cmd, payloadOffset);


        payloadOffset+= 4u;
      }
            

  // - Argument is not present in all versions.
  if (cmd->bufLen < payloadOffset + 
1u)
  { 
    cmd_struct->gpdCommandId = 0xFF;
  } else {

        cmd_struct->gpdCommandId = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
      }
            

  // - Argument is not present in all versions.
  if (cmd->bufLen < payloadOffset + emberAfStringLength(cmd->buffer + payloadOffset) + 1u)
  { 
    cmd_struct->gpdCommandPayload = NULL;
  } else {

        cmd_struct->gpdCommandPayload = sli_decode_string(cmd, payloadOffset);


        payloadOffset+= emberAfStringLength(cmd->buffer + payloadOffset) + 1u;
      }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0800) || (cmd_struct->options & 0x0008)
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
2u ||
 !((cmd_struct->options & 0x0800) || (cmd_struct->options & 0x0008))) 
    { 
      cmd_struct->gppShortAddress = 0xFFFF;
    } 
    else 
    {
        cmd_struct->gppShortAddress = sli_decode_parse_two_bytes(cmd, payloadOffset);


        payloadOffset+= 2u;
    }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0800) || (cmd_struct->options & 0x0008)
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
1u ||
 !((cmd_struct->options & 0x0800) || (cmd_struct->options & 0x0008))) 
    { 
      cmd_struct->gppLink = 0xFF;
    } 
    else 
    {
        cmd_struct->gppLink = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
    }
            


    // - Argument is conditionally present based on expression: cmd_struct->options & 0x0200
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
4u ||
 !(cmd_struct->options & 0x0200)) 
    { 
      cmd_struct->mic = 0xFFFFFFFF;
    } 
    else 
    {
        cmd_struct->mic = sli_decode_parse_four_bytes(cmd, payloadOffset);


    }
  return EMBER_ZCL_STATUS_SUCCESS;
} 


// Command parser for GpTranslationTableUpdate command
EmberAfStatus zcl_decode_green_power_cluster_gp_translation_table_update_command (EmberAfClusterCommand * cmd, sl_zcl_green_power_cluster_gp_translation_table_update_command_t *cmd_struct) {
  // Use classic mechanism to parse this command.
  uint16_t payloadOffset = cmd->payloadStartIndex;
  // Not a fixed length command
            

  // - Argument is not present in all versions.
  if (cmd->bufLen < payloadOffset + 
2u)
  { 
    cmd_struct->options = 0xFFFF;
  } else {

        cmd_struct->options = sli_decode_parse_two_bytes(cmd, payloadOffset);


        payloadOffset+= 2u;
      }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0007) == 0x0000
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
4u ||
 !((cmd_struct->options & 0x0007) == 0x0000)) 
    { 
      cmd_struct->gpdSrcId = 0xFFFFFFFF;
    } 
    else 
    {
        cmd_struct->gpdSrcId = sli_decode_parse_four_bytes(cmd, payloadOffset);


        payloadOffset+= 4u;
    }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0007) == 0x0002
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
8u ||
 !((cmd_struct->options & 0x0007) == 0x0002)) 
    { 
        memset(cmd_struct->gpdIeee, 0, 8);
    } 
    else 
    {
        memcpy(cmd_struct->gpdIeee, sli_decode_bytes(cmd, payloadOffset), 8);


        payloadOffset+= 8u;
    }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0007) == 0x0002
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
1u ||
 !((cmd_struct->options & 0x0007) == 0x0002)) 
    { 
      cmd_struct->endpoint = 0xFF;
    } 
    else 
    {
        cmd_struct->endpoint = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
    }
    cmd_struct->translations = cmd->buffer + payloadOffset;
  return EMBER_ZCL_STATUS_SUCCESS;
} 


// Command parser for GpPairing command
EmberAfStatus zcl_decode_green_power_cluster_gp_pairing_command (EmberAfClusterCommand * cmd, sl_zcl_green_power_cluster_gp_pairing_command_t *cmd_struct) {
  // Use classic mechanism to parse this command.
  uint16_t payloadOffset = cmd->payloadStartIndex;
  // Not a fixed length command
            

  // - Argument is not present in all versions.
  if (cmd->bufLen < payloadOffset + 
3u)
  { 
    cmd_struct->options = 0xFFFFFFFF;
  } else {

        cmd_struct->options = sli_decode_parse_three_bytes(cmd, payloadOffset);


