stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
        payloadOffset+= 3u;
      }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x000007) == 0x000000
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
4u ||
 !((cmd_struct->options & 0x000007) == 0x000000)) 
    { 
      cmd_struct->gpdSrcId = 0xFFFFFFFF;
    } 
    else 
    {
        cmd_struct->gpdSrcId = sli_decode_parse_four_bytes(cmd, payloadOffset);


        payloadOffset+= 4u;
    }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x000007) == 0x000002
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
8u ||
 !((cmd_struct->options & 0x000007) == 0x000002)) 
    { 
        memset(cmd_struct->gpdIeee, 0, 8);
    } 
    else 
    {
        memcpy(cmd_struct->gpdIeee, sli_decode_bytes(cmd, payloadOffset), 8);


        payloadOffset+= 8u;
    }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x000007) == 0x000002
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
1u ||
 !((cmd_struct->options & 0x000007) == 0x000002)) 
    { 
      cmd_struct->endpoint = 0xFF;
    } 
    else 
    {
        cmd_struct->endpoint = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
    }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x000010) == 0x000000 && ((cmd_struct->options & 0x000060) == 0x000000 || (cmd_struct->options & 0x000060) == 0x000060)
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
8u ||
 !((cmd_struct->options & 0x000010) == 0x000000 && ((cmd_struct->options & 0x000060) == 0x000000 || (cmd_struct->options & 0x000060) == 0x000060))) 
    { 
        memset(cmd_struct->sinkIeeeAddress, 0, 8);
    } 
    else 
    {
        memcpy(cmd_struct->sinkIeeeAddress, sli_decode_bytes(cmd, payloadOffset), 8);


        payloadOffset+= 8u;
    }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x000010) == 0x000000 && ((cmd_struct->options & 0x000060) == 0x000000 || (cmd_struct->options & 0x000060) == 0x000060)
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
2u ||
 !((cmd_struct->options & 0x000010) == 0x000000 && ((cmd_struct->options & 0x000060) == 0x000000 || (cmd_struct->options & 0x000060) == 0x000060))) 
    { 
      cmd_struct->sinkNwkAddress = 0xFFFF;
    } 
    else 
    {
        cmd_struct->sinkNwkAddress = sli_decode_parse_two_bytes(cmd, payloadOffset);


        payloadOffset+= 2u;
    }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x000010) == 0x000000 && ((cmd_struct->options & 0x000060) == 0x000020 || (cmd_struct->options & 0x000060) == 0x000040)
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
2u ||
 !((cmd_struct->options & 0x000010) == 0x000000 && ((cmd_struct->options & 0x000060) == 0x000020 || (cmd_struct->options & 0x000060) == 0x000040))) 
    { 
      cmd_struct->sinkGroupId = 0xFFFF;
    } 
    else 
    {
        cmd_struct->sinkGroupId = sli_decode_parse_two_bytes(cmd, payloadOffset);


        payloadOffset+= 2u;
    }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x000008) == 0x000008 && (cmd_struct->options & 0x000010) != 0x000010
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
1u ||
 !((cmd_struct->options & 0x000008) == 0x000008 && (cmd_struct->options & 0x000010) != 0x000010)) 
    { 
      cmd_struct->deviceId = 0xFF;
    } 
    else 
    {
        cmd_struct->deviceId = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
    }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x004000) == 0x004000
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
4u ||
 !((cmd_struct->options & 0x004000) == 0x004000)) 
    { 
      cmd_struct->gpdSecurityFrameCounter = 0xFFFFFFFF;
    } 
    else 
    {
        cmd_struct->gpdSecurityFrameCounter = sli_decode_parse_four_bytes(cmd, payloadOffset);


        payloadOffset+= 4u;
    }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x008000) == 0x008000
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
16u ||
 !((cmd_struct->options & 0x008000) == 0x008000)) 
    { 
        memset(cmd_struct->gpdKey, 0, 16);
    } 
    else 
    {
        memcpy(cmd_struct->gpdKey, sli_decode_bytes(cmd, payloadOffset), 16);


        payloadOffset+= 16u;
    }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x010000) == 0x010000
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
2u ||
 !((cmd_struct->options & 0x010000) == 0x010000)) 
    { 
      cmd_struct->assignedAlias = 0xFFFF;
    } 
    else 
    {
        cmd_struct->assignedAlias = sli_decode_parse_two_bytes(cmd, payloadOffset);


        payloadOffset+= 2u;
    }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x020000) == 0x020000
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
1u ||
 !((cmd_struct->options & 0x020000) == 0x020000)) 
    { 
      cmd_struct->groupcastRadius = 0xFF;
    } 
    else 
    {
        cmd_struct->groupcastRadius = sli_decode_parse_one_byte(cmd, payloadOffset);


    }
  return EMBER_ZCL_STATUS_SUCCESS;
} 


// Command parser for GpProxyTableRequest command
EmberAfStatus zcl_decode_green_power_cluster_gp_proxy_table_request_command (EmberAfClusterCommand * cmd, sl_zcl_green_power_cluster_gp_proxy_table_request_command_t *cmd_struct) {
  // Use classic mechanism to parse this command.
  uint16_t payloadOffset = cmd->payloadStartIndex;
  // Not a fixed length command
            
  if (cmd->bufLen < payloadOffset + 
1u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->options = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
            


      // - Argument is conditionally present based on expression: ((cmd_struct->options & 0x18) == 0x00) && ((cmd_struct->options & 0x07) == 0x00)
      if (!(((cmd_struct->options & 0x18) == 0x00) && ((cmd_struct->options & 0x07) == 0x00))) { 
        cmd_struct->gpdSrcId = 0xFFFFFFFF;
      } else {
        cmd_struct->gpdSrcId = sli_decode_parse_four_bytes(cmd, payloadOffset);


        payloadOffset+= 4u;
  }
            


      // - Argument is conditionally present based on expression: ((cmd_struct->options & 0x18) == 0x00) && ((cmd_struct->options & 0x07) == 0x02)
      if (!(((cmd_struct->options & 0x18) == 0x00) && ((cmd_struct->options & 0x07) == 0x02))) { 
        memset(cmd_struct->gpdIeee, 0, 8);
      } else {
        memcpy(cmd_struct->gpdIeee, sli_decode_bytes(cmd, payloadOffset), 8);


        payloadOffset+= 8u;
  }
            


