stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
      // - Argument is conditionally present based on expression: (cmd_struct->options & 0x07) == 0x02
      if (!((cmd_struct->options & 0x07) == 0x02)) { 
        cmd_struct->endpoint = 0xFF;
      } else {
        cmd_struct->endpoint = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
  }
            


      // - Argument is conditionally present based on expression: (cmd_struct->options & 0x18) == 0x08
      if (!((cmd_struct->options & 0x18) == 0x08)) { 
        cmd_struct->index = 0xFF;
      } else {
        cmd_struct->index = sli_decode_parse_one_byte(cmd, payloadOffset);


  }
  return EMBER_ZCL_STATUS_SUCCESS;
} 


// Command parser for GpPairingConfiguration command
EmberAfStatus zcl_decode_green_power_cluster_gp_pairing_configuration_command (EmberAfClusterCommand * cmd, sl_zcl_green_power_cluster_gp_pairing_configuration_command_t *cmd_struct) {
  // Use classic mechanism to parse this command.
  uint16_t payloadOffset = cmd->payloadStartIndex;
  // Not a fixed length command
            

  // - Argument is not present in all versions.
  if (cmd->bufLen < payloadOffset + 
1u)
  { 
    cmd_struct->actions = 0xFF;
  } else {

        cmd_struct->actions = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
      }
            

  // - Argument is not present in all versions.
  if (cmd->bufLen < payloadOffset + 
2u)
  { 
    cmd_struct->options = 0xFFFF;
  } else {

        cmd_struct->options = sli_decode_parse_two_bytes(cmd, payloadOffset);


        payloadOffset+= 2u;
      }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0007) == 0x0000
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
4u ||
 !((cmd_struct->options & 0x0007) == 0x0000)) 
    { 
      cmd_struct->gpdSrcId = 0xFFFFFFFF;
    } 
    else 
    {
        cmd_struct->gpdSrcId = sli_decode_parse_four_bytes(cmd, payloadOffset);


        payloadOffset+= 4u;
    }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0007) == 0x0002
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
8u ||
 !((cmd_struct->options & 0x0007) == 0x0002)) 
    { 
        memset(cmd_struct->gpdIeee, 0, 8);
    } 
    else 
    {
        memcpy(cmd_struct->gpdIeee, sli_decode_bytes(cmd, payloadOffset), 8);


        payloadOffset+= 8u;
    }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0007) == 0x0002
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
1u ||
 !((cmd_struct->options & 0x0007) == 0x0002)) 
    { 
      cmd_struct->endpoint = 0xFF;
    } 
    else 
    {
        cmd_struct->endpoint = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
    }
            

  // - Argument is not present in all versions.
  if (cmd->bufLen < payloadOffset + 
1u)
  { 
    cmd_struct->deviceId = 0xFF;
  } else {

        cmd_struct->deviceId = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
      }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0018) == 0x0010
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
1u ||
 !((cmd_struct->options & 0x0018) == 0x0010)) 
    { 
      cmd_struct->groupListCount = 0xFF;
    } 
    else 
    {
        cmd_struct->groupListCount = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
    }
  if ( (cmd_struct->options & 0x0018) == 0x0010 ) {
    // Array is conditionally present based on expression: (cmd_struct->options & 0x0018) == 0x0010
    cmd_struct->groupList = cmd->buffer + payloadOffset;
    payloadOffset += cmd_struct->groupListCount * sizeof(GpPairingConfigurationGroupList);
  } else {
    cmd_struct->groupList = NULL;
  } 
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0100)
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
2u ||
 !((cmd_struct->options & 0x0100))) 
    { 
      cmd_struct->gpdAssignedAlias = 0xFFFF;
    } 
    else 
    {
        cmd_struct->gpdAssignedAlias = sli_decode_parse_two_bytes(cmd, payloadOffset);


        payloadOffset+= 2u;
    }
            
  if (cmd->bufLen < payloadOffset + 
1u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->groupcastRadius = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0200)
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
1u ||
 !((cmd_struct->options & 0x0200))) 
    { 
      cmd_struct->securityOptions = 0xFF;
    } 
    else 
    {
        cmd_struct->securityOptions = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
    }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0200) || (cmd_struct->options & 0x0020)
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
4u ||
 !((cmd_struct->options & 0x0200) || (cmd_struct->options & 0x0020))) 
    { 
      cmd_struct->gpdSecurityFrameCounter = 0xFFFFFFFF;
    } 
    else 
    {
        cmd_struct->gpdSecurityFrameCounter = sli_decode_parse_four_bytes(cmd, payloadOffset);


        payloadOffset+= 4u;
    }
            


    // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0200)
    // - Argument is not present in all versions
    if (cmd->bufLen < payloadOffset + 
16u ||
 !((cmd_struct->options & 0x0200))) 
    { 
        memset(cmd_struct->gpdSecurityKey, 0, 16);
    } 
    else 
    {
        memcpy(cmd_struct->gpdSecurityKey, sli_decode_bytes(cmd, payloadOffset), 16);


