stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
        payloadOffset+= 16u;
    }
            

  // - Argument is not present in all versions.
  if (cmd->bufLen < payloadOffset + 
1u)
  { 
    cmd_struct->numberOfPairedEndpoints = 0xFF;
  } else {

        cmd_struct->numberOfPairedEndpoints = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
      }
  if ( 0 < cmd_struct->numberOfPairedEndpoints && cmd_struct->numberOfPairedEndpoints < 0xFD ) {
    // Array is conditionally present based on expression: 0 < cmd_struct->numberOfPairedEndpoints && cmd_struct->numberOfPairedEndpoints < 0xFD
    cmd_struct->pairedEndpoints = cmd->buffer + payloadOffset;
    payloadOffset += cmd_struct->numberOfPairedEndpoints * sizeof(uint8_t);
  } else {
    cmd_struct->pairedEndpoints = NULL;
  } 
            


      // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0400)
      if (!((cmd_struct->options & 0x0400))) { 
        cmd_struct->applicationInformation = 0xFF;
      } else {
        cmd_struct->applicationInformation = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
  }
            


      // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x01)
      if (!((cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x01))) { 
        cmd_struct->manufacturerId = 0xFFFF;
      } else {
        cmd_struct->manufacturerId = sli_decode_parse_two_bytes(cmd, payloadOffset);


        payloadOffset+= 2u;
  }
            


      // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x02)
      if (!((cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x02))) { 
        cmd_struct->modeId = 0xFFFF;
      } else {
        cmd_struct->modeId = sli_decode_parse_two_bytes(cmd, payloadOffset);


        payloadOffset+= 2u;
  }
            


      // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x04)
      if (!((cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x04))) { 
        cmd_struct->numberOfGpdCommands = 0xFF;
      } else {
        cmd_struct->numberOfGpdCommands = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
  }
  if ( (cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x04) ) {
    // Array is conditionally present based on expression: (cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x04)
    cmd_struct->gpdCommandIdList = cmd->buffer + payloadOffset;
    payloadOffset += cmd_struct->numberOfGpdCommands * sizeof(uint8_t);
  } else {
    cmd_struct->gpdCommandIdList = NULL;
  } 
            


      // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x08)
      if (!((cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x08))) { 
        cmd_struct->clusterIdListCount = 0xFF;
      } else {
        cmd_struct->clusterIdListCount = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
  }
  if ( (cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x08) && ((cmd_struct->clusterIdListCount & 0x0F) > 0) ) {
    // Array is conditionally present based on expression: (cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x08) && ((cmd_struct->clusterIdListCount & 0x0F) > 0)
    cmd_struct->clusterListServer = cmd->buffer + payloadOffset;
    payloadOffset += (cmd_struct->clusterIdListCount & 0x0F) * sizeof(uint16_t);
  } else {
    cmd_struct->clusterListServer = NULL;
  } 
  if ( (cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x08) && ((cmd_struct->clusterIdListCount >> 4) > 0) ) {
    // Array is conditionally present based on expression: (cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x08) && ((cmd_struct->clusterIdListCount >> 4) > 0)
    cmd_struct->clusterListClient = cmd->buffer + payloadOffset;
    payloadOffset += (cmd_struct->clusterIdListCount >> 4) * sizeof(uint16_t);
  } else {
    cmd_struct->clusterListClient = NULL;
  } 
            


      // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x10)
      if (!((cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x10))) { 
        cmd_struct->switchInformationLength = 0xFF;
      } else {
        cmd_struct->switchInformationLength = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
  }
            


      // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x10)
      if (!((cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x10))) { 
        cmd_struct->switchConfiguration = 0xFF;
      } else {
        cmd_struct->switchConfiguration = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
  }
            


      // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x10)
      if (!((cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x10))) { 
        cmd_struct->currentContactStatus = 0xFF;
      } else {
        cmd_struct->currentContactStatus = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
  }
            


      // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x20)
      if (!((cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x20))) { 
        cmd_struct->totalNumberOfReports = 0xFF;
      } else {
        cmd_struct->totalNumberOfReports = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
  }
            


      // - Argument is conditionally present based on expression: (cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x20)
      if (!((cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x20))) { 
        cmd_struct->numberOfReports = 0xFF;
      } else {
        cmd_struct->numberOfReports = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
  }
  if ( (cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x20) ) {
    // Array is conditionally present based on expression: (cmd_struct->options & 0x0400) && (cmd_struct->applicationInformation & 0x20)
    cmd_struct->reportDescriptor = cmd->buffer + payloadOffset;
  } else {
    cmd_struct->reportDescriptor = NULL;
  } 
  return EMBER_ZCL_STATUS_SUCCESS;
} 


// Command parser for GpResponse command
EmberAfStatus zcl_decode_green_power_cluster_gp_response_command (EmberAfClusterCommand * cmd, sl_zcl_green_power_cluster_gp_response_command_t *cmd_struct) {
  // Use classic mechanism to parse this command.
  uint16_t payloadOffset = cmd->payloadStartIndex;
  // Not a fixed length command
            

  // - Argument is not present in all versions.
  if (cmd->bufLen < payloadOffset + 
1u)
  { 
    cmd_struct->options = 0xFF;
  } else {

        cmd_struct->options = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
      }
            

  // - Argument is not present in all versions.
  if (cmd->bufLen < payloadOffset + 
2u)
  { 
    cmd_struct->tempMasterShortAddress = 0xFFFF;
  } else {

        cmd_struct->tempMasterShortAddress = sli_decode_parse_two_bytes(cmd, payloadOffset);


        payloadOffset+= 2u;
      }
            

  // - Argument is not present in all versions.
  if (cmd->bufLen < payloadOffset + 
1u)
  { 
    cmd_struct->tempMasterTxChannel = 0xFF;
  } else {

        cmd_struct->tempMasterTxChannel = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
      }
            


