stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
        cmd_struct->gppShortAddress = sli_decode_parse_two_bytes(cmd, payloadOffset);


        payloadOffset+= 2u;
      }
            

  // - Argument is not present in all versions.
  if (cmd->bufLen < payloadOffset + 
1u)
  { 
    cmd_struct->gppDistance = 0xFF;
  } else {

        cmd_struct->gppDistance = sli_decode_parse_one_byte(cmd, payloadOffset);


      }
  return EMBER_ZCL_STATUS_SUCCESS;
} 


// Command parser for ViewSceneResponse command
EmberAfStatus zcl_decode_scenes_cluster_view_scene_response_command (EmberAfClusterCommand * cmd, sl_zcl_scenes_cluster_view_scene_response_command_t *cmd_struct) {
  // Use classic mechanism to parse this command.
  uint16_t payloadOffset = cmd->payloadStartIndex;
  // Not a fixed length command
            
  if (cmd->bufLen < payloadOffset + 
1u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->status = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
            
  if (cmd->bufLen < payloadOffset + 
2u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->groupId = sli_decode_parse_two_bytes(cmd, payloadOffset);


        payloadOffset+= 2u;
            
  if (cmd->bufLen < payloadOffset + 
1u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->sceneId = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
            


      // - Argument is conditionally present based on expression: cmd_struct->status==0
      if (!(cmd_struct->status==0)) { 
        cmd_struct->transitionTime = 0xFFFF;
      } else {
        cmd_struct->transitionTime = sli_decode_parse_two_bytes(cmd, payloadOffset);


        payloadOffset+= 2u;
  }
            


      // - Argument is conditionally present based on expression: cmd_struct->status==0
      if (!(cmd_struct->status==0)) { 
        cmd_struct->sceneName = NULL;
      } else {
        cmd_struct->sceneName = sli_decode_string(cmd, payloadOffset);


        payloadOffset+= emberAfStringLength(cmd->buffer + payloadOffset) + 1u;
  }
  if ( cmd_struct->status==0 ) {
    // Array is conditionally present based on expression: cmd_struct->status==0
    cmd_struct->extensionFieldSets = cmd->buffer + payloadOffset;
  } else {
    cmd_struct->extensionFieldSets = NULL;
  } 
  return EMBER_ZCL_STATUS_SUCCESS;
} 


// Command parser for PoweringOffNotification command
EmberAfStatus zcl_decode_sl_works_with_all_hubs_cluster_powering_off_notification_command (EmberAfClusterCommand * cmd, sl_zcl_sl_works_with_all_hubs_cluster_powering_off_notification_command_t *cmd_struct) {
  // Use classic mechanism to parse this command.
  uint16_t payloadOffset = cmd->payloadStartIndex;
  // Not a fixed length command
            
  if (cmd->bufLen < payloadOffset + 
1u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->powerNotificationReason = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
            
  if (cmd->bufLen < payloadOffset + 
2u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->manufacturerId = sli_decode_parse_two_bytes(cmd, payloadOffset);


        payloadOffset+= 2u;
            
  if (cmd->bufLen < payloadOffset + 
1u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->manufacturerReasonLength = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
  if ( cmd_struct->manufacturerReasonLength!=0 ) {
    // Array is conditionally present based on expression: cmd_struct->manufacturerReasonLength!=0
    cmd_struct->manufacturerReason = cmd->buffer + payloadOffset;
  } else {
    cmd_struct->manufacturerReason = NULL;
  } 
  return EMBER_ZCL_STATUS_SUCCESS;
} 


// Command parser for PoweringOnNotification command
EmberAfStatus zcl_decode_sl_works_with_all_hubs_cluster_powering_on_notification_command (EmberAfClusterCommand * cmd, sl_zcl_sl_works_with_all_hubs_cluster_powering_on_notification_command_t *cmd_struct) {
  // Use classic mechanism to parse this command.
  uint16_t payloadOffset = cmd->payloadStartIndex;
  // Not a fixed length command
            
  if (cmd->bufLen < payloadOffset + 
1u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->powerNotificationReason = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
            
  if (cmd->bufLen < payloadOffset + 
2u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->manufacturerId = sli_decode_parse_two_bytes(cmd, payloadOffset);


        payloadOffset+= 2u;
            
  if (cmd->bufLen < payloadOffset + 
1u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->manufacturerReasonLength = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
  if ( cmd_struct->manufacturerReasonLength!=0 ) {
    // Array is conditionally present based on expression: cmd_struct->manufacturerReasonLength!=0
    cmd_struct->manufacturerReason = cmd->buffer + payloadOffset;
  } else {
    cmd_struct->manufacturerReason = NULL;
  } 
  return EMBER_ZCL_STATUS_SUCCESS;
} 


// Command parser for GpSinkTableRequest command
EmberAfStatus zcl_decode_green_power_cluster_gp_sink_table_request_command (EmberAfClusterCommand * cmd, sl_zcl_green_power_cluster_gp_sink_table_request_command_t *cmd_struct) {
  // Use classic mechanism to parse this command.
  uint16_t payloadOffset = cmd->payloadStartIndex;
  // Not a fixed length command
            
  if (cmd->bufLen < payloadOffset + 
1u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->options = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
            


      // - Argument is conditionally present based on expression: ((cmd_struct->options & 0x07) == 0x00) && ((cmd_struct->options & 0x18) == 0x00)
      if (!(((cmd_struct->options & 0x07) == 0x00) && ((cmd_struct->options & 0x18) == 0x00))) { 
        cmd_struct->gpdSrcId = 0xFFFFFFFF;
      } else {
        cmd_struct->gpdSrcId = sli_decode_parse_four_bytes(cmd, payloadOffset);


        payloadOffset+= 4u;
  }
            


      // - Argument is conditionally present based on expression: ((cmd_struct->options & 0x07) == 0x02) && ((cmd_struct->options & 0x18) == 0x00)
      if (!(((cmd_struct->options & 0x07) == 0x02) && ((cmd_struct->options & 0x18) == 0x00))) { 
        memset(cmd_struct->gpdIeee, 0, 8);
      } else {
        memcpy(cmd_struct->gpdIeee, sli_decode_bytes(cmd, payloadOffset), 8);


        payloadOffset+= 8u;
  }
            


      // - Argument is conditionally present based on expression: ((cmd_struct->options & 0x07) == 0x02) && ((cmd_struct->options & 0x18) == 0x00)
      if (!(((cmd_struct->options & 0x07) == 0x02) && ((cmd_struct->options & 0x18) == 0x00))) { 
        cmd_struct->endpoint = 0xFF;
      } else {
        cmd_struct->endpoint = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
  }
            


      // - Argument is conditionally present based on expression: (cmd_struct->options & 0x18) == 0x08
      if (!((cmd_struct->options & 0x18) == 0x08)) { 
        cmd_struct->index = 0xFF;
      } else {
        cmd_struct->index = sli_decode_parse_one_byte(cmd, payloadOffset);


