stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
  }
  return EMBER_ZCL_STATUS_SUCCESS;
} 


// Command parser for GetSceneMembershipResponse command
EmberAfStatus zcl_decode_scenes_cluster_get_scene_membership_response_command (EmberAfClusterCommand * cmd, sl_zcl_scenes_cluster_get_scene_membership_response_command_t *cmd_struct) {
  // Use classic mechanism to parse this command.
  uint16_t payloadOffset = cmd->payloadStartIndex;
  // Not a fixed length command
            
  if (cmd->bufLen < payloadOffset + 
1u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->status = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
            
  if (cmd->bufLen < payloadOffset + 
1u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->capacity = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
            
  if (cmd->bufLen < payloadOffset + 
2u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->groupId = sli_decode_parse_two_bytes(cmd, payloadOffset);


        payloadOffset+= 2u;
            


      // - Argument is conditionally present based on expression: cmd_struct->status==0
      if (!(cmd_struct->status==0)) { 
        cmd_struct->sceneCount = 0xFF;
      } else {
        cmd_struct->sceneCount = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
  }
  if ( cmd_struct->status==0 ) {
    // Array is conditionally present based on expression: cmd_struct->status==0
    cmd_struct->sceneList = cmd->buffer + payloadOffset;
  } else {
    cmd_struct->sceneList = NULL;
  } 
  return EMBER_ZCL_STATUS_SUCCESS;
} 


// Command parser for UseTrustCenterForClusterServerResponse command
EmberAfStatus zcl_decode_sl_works_with_all_hubs_cluster_use_trust_center_for_cluster_server_response_command (EmberAfClusterCommand * cmd, sl_zcl_sl_works_with_all_hubs_cluster_use_trust_center_for_cluster_server_response_command_t *cmd_struct) {
  // Use classic mechanism to parse this command.
  uint16_t payloadOffset = cmd->payloadStartIndex;
  // Not a fixed length command
            
  if (cmd->bufLen < payloadOffset + 
1u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->status = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
            
  if (cmd->bufLen < payloadOffset + 
1u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->clusterStatusLength = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
  if ( cmd_struct->clusterStatusLength!=0 ) {
    // Array is conditionally present based on expression: cmd_struct->clusterStatusLength!=0
    cmd_struct->clusterStatus = cmd->buffer + payloadOffset;
  } else {
    cmd_struct->clusterStatus = NULL;
  } 
  return EMBER_ZCL_STATUS_SUCCESS;
} 


// Command parser for ScanNetworksResp command
EmberAfStatus zcl_decode_network_provisioning_cluster_scan_networks_resp_command (EmberAfClusterCommand * cmd, sl_zcl_network_provisioning_cluster_scan_networks_resp_command_t *cmd_struct) {
  // Use classic mechanism to parse this command.
  uint16_t payloadOffset = cmd->payloadStartIndex;
  // Not a fixed length command
            
  if (cmd->bufLen < payloadOffset + 
1u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->ErrorCode = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
            
  if (cmd->bufLen < payloadOffset + emberAfStringLength(cmd->buffer + payloadOffset) + 1u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->DebugText = sli_decode_string(cmd, payloadOffset);


        payloadOffset+= emberAfStringLength(cmd->buffer + payloadOffset) + 1u;
    cmd_struct->WiFiScanResults = cmd->buffer + payloadOffset;
    cmd_struct->ThreadScanResults = cmd->buffer + payloadOffset;
  return EMBER_ZCL_STATUS_SUCCESS;
} 


// Command parser for EnableApsLinkKeyAuthorization command
EmberAfStatus zcl_decode_sl_works_with_all_hubs_cluster_enable_aps_link_key_authorization_command (EmberAfClusterCommand * cmd, sl_zcl_sl_works_with_all_hubs_cluster_enable_aps_link_key_authorization_command_t *cmd_struct) {
  // Use classic mechanism to parse this command.
  uint16_t payloadOffset = cmd->payloadStartIndex;
  // Not a fixed length command
            
  if (cmd->bufLen < payloadOffset + 
1u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->numberExemptClusters = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
  if ( cmd_struct->numberExemptClusters!=0 ) {
    // Array is conditionally present based on expression: cmd_struct->numberExemptClusters!=0
    cmd_struct->clusterId = cmd->buffer + payloadOffset;
  } else {
    cmd_struct->clusterId = NULL;
  } 
  return EMBER_ZCL_STATUS_SUCCESS;
} 


// Command parser for DisableApsLinkKeyAuthorization command
EmberAfStatus zcl_decode_sl_works_with_all_hubs_cluster_disable_aps_link_key_authorization_command (EmberAfClusterCommand * cmd, sl_zcl_sl_works_with_all_hubs_cluster_disable_aps_link_key_authorization_command_t *cmd_struct) {
  // Use classic mechanism to parse this command.
  uint16_t payloadOffset = cmd->payloadStartIndex;
  // Not a fixed length command
            
  if (cmd->bufLen < payloadOffset + 
1u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->numberExemptClusters = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
  if ( cmd_struct->numberExemptClusters!=0 ) {
    // Array is conditionally present based on expression: cmd_struct->numberExemptClusters!=0
    cmd_struct->clusterId = cmd->buffer + payloadOffset;
  } else {
    cmd_struct->clusterId = NULL;
  } 
  return EMBER_ZCL_STATUS_SUCCESS;
} 


// Command parser for RequireApsAcksOnUnicasts command
EmberAfStatus zcl_decode_sl_works_with_all_hubs_cluster_require_aps_acks_on_unicasts_command (EmberAfClusterCommand * cmd, sl_zcl_sl_works_with_all_hubs_cluster_require_aps_acks_on_unicasts_command_t *cmd_struct) {
  // Use classic mechanism to parse this command.
  uint16_t payloadOffset = cmd->payloadStartIndex;
  // Not a fixed length command
            
  if (cmd->bufLen < payloadOffset + 
1u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->numberExemptClusters = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
  if ( cmd_struct->numberExemptClusters!=0 ) {
    // Array is conditionally present based on expression: cmd_struct->numberExemptClusters!=0
    cmd_struct->clusterId = cmd->buffer + payloadOffset;
  } else {
    cmd_struct->clusterId = NULL;
  } 
  return EMBER_ZCL_STATUS_SUCCESS;
} 


// Command parser for UseTrustCenterForClusterServer command
EmberAfStatus zcl_decode_sl_works_with_all_hubs_cluster_use_trust_center_for_cluster_server_command (EmberAfClusterCommand * cmd, sl_zcl_sl_works_with_all_hubs_cluster_use_trust_center_for_cluster_server_command_t *cmd_struct) {
  // Use classic mechanism to parse this command.
  uint16_t payloadOffset = cmd->payloadStartIndex;
  // Not a fixed length command
            
  if (cmd->bufLen < payloadOffset + 
1u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->numberOfClusters = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
  if ( cmd_struct->numberOfClusters!=0 ) {
    // Array is conditionally present based on expression: cmd_struct->numberOfClusters!=0
    cmd_struct->clusterId = cmd->buffer + payloadOffset;
  } else {
    cmd_struct->clusterId = NULL;
  } 
  return EMBER_ZCL_STATUS_SUCCESS;
} 


