stream2me/hacking-lidl-silvercrest-gateway/2-Zigbee-Radio-Silabs-EFR32/27-Router/patches/zap-cluster-command-parser.c
// Command parser for ApsAckEnablementQueryResponse command
EmberAfStatus zcl_decode_sl_works_with_all_hubs_cluster_aps_ack_enablement_query_response_command (EmberAfClusterCommand * cmd, sl_zcl_sl_works_with_all_hubs_cluster_aps_ack_enablement_query_response_command_t *cmd_struct) {
  // Use classic mechanism to parse this command.
  uint16_t payloadOffset = cmd->payloadStartIndex;
  // Not a fixed length command
            
  if (cmd->bufLen < payloadOffset + 
1u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->numberExemptClusters = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
  if ( cmd_struct->numberExemptClusters!=0 ) {
    // Array is conditionally present based on expression: cmd_struct->numberExemptClusters!=0
    cmd_struct->clusterId = cmd->buffer + payloadOffset;
  } else {
    cmd_struct->clusterId = NULL;
  } 
  return EMBER_ZCL_STATUS_SUCCESS;
} 


// Command parser for TrustCenterForClusterServerQueryResponse command
EmberAfStatus zcl_decode_sl_works_with_all_hubs_cluster_trust_center_for_cluster_server_query_response_command (EmberAfClusterCommand * cmd, sl_zcl_sl_works_with_all_hubs_cluster_trust_center_for_cluster_server_query_response_command_t *cmd_struct) {
  // Use classic mechanism to parse this command.
  uint16_t payloadOffset = cmd->payloadStartIndex;
  // Not a fixed length command
            
  if (cmd->bufLen < payloadOffset + 
1u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->numberOfClusters = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
  if ( cmd_struct->numberOfClusters!=0 ) {
    // Array is conditionally present based on expression: cmd_struct->numberOfClusters!=0
    cmd_struct->clusterId = cmd->buffer + payloadOffset;
  } else {
    cmd_struct->clusterId = NULL;
  } 
  return EMBER_ZCL_STATUS_SUCCESS;
} 


// Command parser for Bypass command
EmberAfStatus zcl_decode_ias_ace_cluster_bypass_command (EmberAfClusterCommand * cmd, sl_zcl_ias_ace_cluster_bypass_command_t *cmd_struct) {
  // Use classic mechanism to parse this command.
  uint16_t payloadOffset = cmd->payloadStartIndex;
  // Not a fixed length command
            
  if (cmd->bufLen < payloadOffset + 
1u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->numberOfZones = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
    cmd_struct->zoneIds = cmd->buffer + payloadOffset;
    payloadOffset += cmd_struct->numberOfZones * sizeof(uint8_t);
            

  // - Argument is not present in all versions.
  if (cmd->bufLen < payloadOffset + emberAfStringLength(cmd->buffer + payloadOffset) + 1u)
  { 
    cmd_struct->armDisarmCode = NULL;
  } else {

        cmd_struct->armDisarmCode = sli_decode_string(cmd, payloadOffset);


      }
  return EMBER_ZCL_STATUS_SUCCESS;
} 


// Command parser for SurveyBeaconsResponse command
EmberAfStatus zcl_decode_sl_works_with_all_hubs_cluster_survey_beacons_response_command (EmberAfClusterCommand * cmd, sl_zcl_sl_works_with_all_hubs_cluster_survey_beacons_response_command_t *cmd_struct) {
  // Use classic mechanism to parse this command.
  uint16_t payloadOffset = cmd->payloadStartIndex;
  // Not a fixed length command
            
  if (cmd->bufLen < payloadOffset + 
1u)
  {
    return EMBER_ZCL_STATUS_MALFORMED_COMMAND;
  }


        cmd_struct->numberOfBeacons = sli_decode_parse_one_byte(cmd, payloadOffset);


        payloadOffset+= 1u;
  if ( cmd_struct->numberOfBeacons!=0 ) {
    // Array is conditionally present based on expression: cmd_struct->numberOfBeacons!=0
    cmd_struct->beacon = cmd->buffer + payloadOffset;
  } else {
    cmd_struct->beacon = NULL;
  } 
  return EMBER_ZCL_STATUS_SUCCESS;
} 



#endif //End of SL_CATALOG_ZIGBEE_ZCL_FRAMEWORK_CORE_PRESENT
